/** ****************************************************************************
 * @copyright Copyright (c) XXX
 * All rights reserved.
 *
 * @file    app_dm1.c
 * @brief   
 * @version V1.0
 * @author  liuwenlong
 * @date    2022-7-18
 * @note <b>history:</b>
 * 1. create file
 *
 */


#include "r_typedefs.h"
#include "iodefine.h"
#include "string.h"
#include "SYSTEM.h"
#include "app_dm1.h"
#include "app_can.h"
#include "uds_support.h"
#include "adc.h"
#include "ptmr.h"


/********** GLOBAL VARIABLE DECLEAR **********/
uint16_t icuCrtFltNum;      //当前仪表发出的故障数量
DTC_BUF_t icuCrtDM1Flt[ICU_MAX_ERR_NUM]; //当前仪表发出的故障
uint16_t ListCrtFltPos[100]; //当前列表中故障发生位置
uint16_t TotalDM;
uint16_t DM1_Ftl_Sum;   //故障列表里面的故障总数
CURRENNT_FLT_INFO_t  CurrentFltInfo[DM1_OWNER_NUM]; //当前发生的故障信息(除仪表发出的以外的)

uint16_t bmsListCrtFltPos[100]; //电池当前列表中故障发生位置
uint16_t bmsCrtFltNum;      //当前电池发出的故障数量

#define DM1_LIST_FLT_NUM (sizeof(DMPackage)/sizeof(canDMInterpret_t))
canDMInterpret_t  DMPackage[]=
{
/*   0*/{0xF4, 521300, 17, {(uint8_t *)"BMS:绝缘电阻轻微低(521300,17)",           (uint8_t *)"BMS:(521300,17)"},   0}, //BMS
/*   1*/{0xF4, 521300, 18, {(uint8_t *)"BMS:绝缘电阻一般低(521300,18)",           (uint8_t *)"BMS:(521300,18)"},   0}, //BMS
/*   2*/{0xF4, 521300,  1, {(uint8_t *)"BMS:绝缘电阻严重低(521300,1)",            (uint8_t *)"BMS:(521300,1)"},    0}, //BMS
/*   3*/{0xF4, 521301, 15, {(uint8_t *)"BMS:单体温度轻微高(521301,15)",           (uint8_t *)"BMS:(521301,15)"},   0}, //BMS
/*   4*/{0xF4, 521301, 16, {(uint8_t *)"BMS:单体温度一般高(521301,16)",           (uint8_t *)"BMS:(521301,16)"},   0}, //BMS
/*   5*/{0xF4, 521301,  0, {(uint8_t *)"BMS:单体温度严重高(521301,0)",            (uint8_t *)"BMS:(521301,0)"},    0}, //BMS
/*   6*/{0xF4,0xFFFFF, 0xFF /* 521301, 18 */, {(uint8_t *)"BMS:单体温度一般低(521301,18)",           (uint8_t *)"BMS:(521301,18)"},   0}, //BMS
/*   7*/{0xF4, 521301,  1, {(uint8_t *)"请挪车至温暖场合,如无效,请联系服务站保养", (uint8_t *)"Please move the car to warm occasions"}, /* {(uint8_t *)"BMS:单体温度严重低(521301,1)",            (uint8_t *)"BMS:(521301,1)"} */    0}, //BMS
/*   8*/{0xF4,0xFFFFF, 0xFF /* 521302, 15 */, {(uint8_t *)"BMS:温差轻微大(521302,15)",               (uint8_t *)"BMS:(521302,15)"},   0}, //BMS
/*   9*/{0xF4,0xFFFFF, 0xFF /* 521302, 16 */, {(uint8_t *)"BMS:温差一般大(521302,16)",               (uint8_t *)"BMS:(521302,16)"},   0}, //BMS
/*  10*/{0xF4, 521302,  0, {(uint8_t *)"BMS:温差严重大(521302,0)",                (uint8_t *)"BMS:(521302,0)"},    0}, //BMS
/*  11*/{0xF4, 521303,  0, {(uint8_t *)"BMS:均温高(521303,0)",                    (uint8_t *)"BMS:(521303,0)"},    0}, //BMS
/*  12*/{0xF4, 521303,  1, {(uint8_t *)"BMS:均温低(521303,1)",                    (uint8_t *)"BMS:(521303,1)"},    0}, //BMS
/*  13*/{0xF4,0xFFFFF, 0xFF /* 521304, 16 */, {(uint8_t *)"BMS:电池总电压一般高(521304,16)",         (uint8_t *)"BMS:(521304,16)"},   0}, //BMS
/*  14*/{0xF4,0xFFFFF, 0xFF /* 521304,  0 */, {(uint8_t *)"BMS:电池总电压严重高(521304,0)",          (uint8_t *)"BMS:(521304,0)"},    0}, //BMS
/*  15*/{0xF4, 521304, 17, {(uint8_t *)"BMS:电池总电压轻微低(521304,17)",         (uint8_t *)"BMS:(521304,17)"},   0}, //BMS
/*  16*/{0xF4, 521304, 18, {(uint8_t *)"BMS:电池总电压一般低(521304,18)",         (uint8_t *)"BMS:(521304,18)"},   0}, //BMS
/*  17*/{0xF4, 521304,  1, {(uint8_t *)"BMS:电池总电压严重低(521304,1)",          (uint8_t *)"BMS:(521304,1)"},    0}, //BMS
/*  18*/{0xF4,0xFFFFF, 0xFF /* 521305, 16 */, {(uint8_t *)"BMS:单体一般过压(521305,16)",             (uint8_t *)"BMS:(521305,16)"},   0}, //BMS
/*  19*/{0xF4,0xFFFFF, 0xFF /* 521305,  0 */, {(uint8_t *)"BMS:单体严重过压(521305,0)",              (uint8_t *)"BMS:(521305,0)"},    0}, //BMS
/*  20*/{0xF4, 521305, 17, {(uint8_t *)"BMS:单体轻微欠压(521305,17)",             (uint8_t *)"BMS:(521305,17)"},   0}, //BMS
/*  21*/{0xF4, 521305, 18, {(uint8_t *)"BMS:单体一般欠压(521305,18)",             (uint8_t *)"BMS:(521305,18)"},   0}, //BMS
/*  22*/{0xF4, 521305,  1, {(uint8_t *)"BMS:单体严重欠压(521305,1)",              (uint8_t *)"BMS:(521305,1)"},    0}, //BMS
/*  23*/{0xF4,0xFFFFF, 0xFF /* 521306, 16 */, {(uint8_t *)"BMS:单体压差一般大(521306,16)",           (uint8_t *)"BMS:(521306,16)"},   0}, //BMS
/*  24*/{0xF4,0xFFFFF, 0xFF /* 521306,  0 */, {(uint8_t *)"BMS:单体压差严重大(521306,0)",            (uint8_t *)"BMS:(521306,0)"},    0}, //BMS
/*  25*/{0xF4,0xFFFFF, 0xFF /* 521307, 16 */, {(uint8_t *)"BMS:峰值回充电流一般大(521307,16)",       (uint8_t *)"BMS:(521307,16)"},   0}, //BMS
/*  26*/{0xF4,0xFFFFF, 0xFF /* 521307,  0 */, {(uint8_t *)"BMS:峰值回充电流严重大(521307,0)",        (uint8_t *)"BMS:(521307,0)"},    0}, //BMS
/*  27*/{0xF4,0xFFFFF, 0xFF /* 521308, 15 */, {(uint8_t *)"BMS:峰值放电电流轻微大(521308,15)",       (uint8_t *)"BMS:(521308,15)"},   0}, //BMS
/*  28*/{0xF4,0xFFFFF, 0xFF /* 521308, 16 */, {(uint8_t *)"BMS:峰值放电电流一般大(521308,16)",       (uint8_t *)"BMS:(521308,16)"},   0}, //BMS
/*  29*/{0xF4, 521308,  0, {(uint8_t *)"BMS:峰值放电电流严重大(521308,0)",        (uint8_t *)"BMS:(521308,0)"},    0}, //BMS
/*  30*/{0xF4,0xFFFFF, 0xFF /* 521309, 17 */, {(uint8_t *)"BMS:电池SOC轻微低(521309,17)",            (uint8_t *)"BMS:(521309,17)"},   0}, //BMS
/*  31*/{0xF4, 521309, 18, {(uint8_t *)"SOC明显低, 请尽快充电", (uint8_t *)"SOC is obviously low, please charge"}, /* {(uint8_t *)"BMS:电池SOC一般低(521309,18)",            (uint8_t *)"BMS:(521309,18)"}, */   0}, //BMS
/*  32*/{0xF4, 521309,  1, {(uint8_t *)"SOC严重低, 请立即充电", (uint8_t *)"SOC is seriously low, please charge immediately"}, /* {(uint8_t *)"BMS:电池SOC严重低(521309,1)",             (uint8_t *)"BMS:(521309,1)"}, */    0}, //BMS
/*  33*/{0xF4,0xFFFFF, 0xFF /* 521309,  0 */, {(uint8_t *)"BMS:电池SOC高(521309,0)",                 (uint8_t *)"BMS:(521309,0)"},    0}, //BMS
/*  34*/{0xF4, 521310, 13, {(uint8_t *)"BMS:BMS24V供电异常(521310,13)",           (uint8_t *)"BMS:(521310,13)"},   0}, //BMS
/*  35*/{0xF4, 521311,  9, {(uint8_t *)"BMS:BMS内部通信故障(521311,9)",           (uint8_t *)"BMS:(521311,9)"},    0}, //BMS
/*  36*/{0xF4, 521312,  5, {(uint8_t *)"请检查MSD是否安装正常", (uint8_t *)"Please check whether MSD is installed properly"}, /* {(uint8_t *)"BMS:高压互锁故障(521312,5)",              (uint8_t *)"BMS:(521312,5)"}, */    0}, //BMS
/*  37*/{0xF4,0xFFFFF, 0xFF /* 521313, 13 */, {(uint8_t *)"BMS:单体电压检测(521313,13)",             (uint8_t *)"BMS:(521313,13)"},   0}, //BMS
/*  38*/{0xF4,0xFFFFF, 0xFF /* 521314,  0 */, {(uint8_t *)"BMS:预留(521314,NULL)",                   (uint8_t *)"BMS:(521314,NULL)"}, 0}, //BMS
/*  39*/{0xF4,0xFFFFF, 0xFF /* 521315,  6 */, {(uint8_t *)"BMS:禁止充电(521315,6)",                  (uint8_t *)"BMS:(521315,6)"},    0}, //BMS
/*  40*/{0xF4,0xFFFFF, 0xFF /* 521316,  6 */, {(uint8_t *)"BMS:禁止放电(521316,6)",                  (uint8_t *)"BMS:(521316,6)"},    0}, //BMS
/*  41*/{0xF4,0xFFFFF, 0xFF /* 521317, 12 */, {(uint8_t *)"BMS:充电器故障(521317,12)",               (uint8_t *)"BMS:(521317,12)"},   0}, //BMS
/*  42*/{0xF4,0xFFFFF, 0xFF /* 521318,  4 */, {(uint8_t *)"BMS:短路故障(521318,4)",                  (uint8_t *)"BMS:(521318,4)"},    0}, //BMS
/*  43*/{0xF4,0xFFFFF, 0xFF /* 521319,  2 */, {(uint8_t *)"BMS:ds12c887(521319,2)",                  (uint8_t *)"BMS:(521319,2)"},    0}, //BMS
/*  44*/{0xF4,0xFFFFF, 0xFF /* 521321,  2 */, {(uint8_t *)"BMS:外CAN初始化(521321,2)",               (uint8_t *)"BMS:(521321,2)"},    0}, //BMS
/*  45*/{0xF4,0xFFFFF, 0xFF /* 521322,  2 */, {(uint8_t *)"BMS:内CAN初始化(521322,2)",               (uint8_t *)"BMS:(521322,2)"},    0}, //BMS
/*  46*/{0xF4,0xFFFFF, 0xFF /* 521323, 12 */, {(uint8_t *)"BMS:外CAN接收(521323,12)",                (uint8_t *)"BMS:(521323,12)"},   0}, //BMS
/*  47*/{0xF4,0xFFFFF, 0xFF /* 521324,  2 */, {(uint8_t *)"BMS:总压采集(521324,2)",                  (uint8_t *)"BMS:(521324,2)"},    0}, //BMS
/*  48*/{0xF4,0xFFFFF, 0xFF /* 521325,  3 */, {(uint8_t *)"BMS:单体温度检测错误(521325,3)",          (uint8_t *)"BMS:(521325,3)"},    0}, //BMS
/*  49*/{0xF4, 521327,  5, {(uint8_t *)"BMS:主负接触器无法闭合(521327,5)",        (uint8_t *)"BMS:(521327,5)"},    0}, //BMS
/*  50*/{0xF4, 521327,  3, {(uint8_t *)"BMS:主负接触器无法断开(521327,3)",        (uint8_t *)"BMS:(521327,3)"},    0}, //BMS
/*  51*/{0xF4, 521328,  0, {(uint8_t *)"BMS:主正接触器(521328,NULL)",             (uint8_t *)"BMS:(521328,NULL)"}, 0}, //BMS
/*  52*/{0xF4, 521329,  5, {(uint8_t *)"BMS:直流充电A正接触器无法闭合(521329,5)", (uint8_t *)"BMS:(521329,5)"},    0}, //BMS
/*  53*/{0xF4, 521329,  3, {(uint8_t *)"BMS:直流充电A正接触器无法断开(521329,3)", (uint8_t *)"BMS:(521329,3)"},    0}, //BMS
/*  54*/{0xF4, 521329,  2, {(uint8_t *)"BMS:预留(521329,2)",                      (uint8_t *)"BMS:(521329,2)"},    0}, //BMS
/*  55*/{0xF4, 521330,  5, {(uint8_t *)"BMS:直流充电A负接触器无法闭合(521330,5)", (uint8_t *)"BMS:(521330,5)"},    0}, //BMS
/*  56*/{0xF4, 521330,  3, {(uint8_t *)"BMS:直流充电A负接触器无法断开(521330,3)", (uint8_t *)"BMS:(521330,3)"},    0}, //BMS
/*  57*/{0xF4, 521331,  0, {(uint8_t *)"BMS:预留(充电B正)(521331,NULL)",          (uint8_t *)"BMS:(521331,NULL)"}, 0}, //BMS
/*  58*/{0xF4, 521332,  0, {(uint8_t *)"BMS:预留(充电B负)(521332,NULL)",          (uint8_t *)"BMS:(521332,NULL)"}, 0}, //BMS
/*  59*/{0xF4, 521333,  5, {(uint8_t *)"BMS:支路断路(521333,5)",                  (uint8_t *)"BMS:(521333,5)"},    0}, //BMS
/*  60*/{0xF4, 521334,  3, {(uint8_t *)"BMS:电池包极限故障(521334,3)",            (uint8_t *)"BMS:(521334,3)"},    0}, //BMS
/*  61*/{0xF4, 521335,  3, {(uint8_t *)"请立即靠边停车并撤离车辆", (uint8_t *)"Please pull over and evacuate immediately"}, /* {(uint8_t *)"BMS:电池包火灾故障(521335,3)",            (uint8_t *)"BMS:(521335,3)"} */    0}, //BMS
/*  62*/{0xF4,0xFFFFF, 0xFF /* 521336,  5 */, {(uint8_t *)"BMS:充电插座温度掉线(521336,5)",          (uint8_t *)"BMS:(521336,5)"},    0}, //BMS
/*  63*/{0xF4, 521336, 16, {(uint8_t *)"请更换充电桩, 无效则联系服务站保养", (uint8_t *)"Please replace the charging pile"}, /* {(uint8_t *)"BMS:充电插座一般过温(521336,16)",         (uint8_t *)"BMS:(521336,16)"}, */   0}, //BMS
/*  64*/{0xF4, 521336,  0, {(uint8_t *)"请更换充电桩, 无效则联系服务站保养", (uint8_t *)"Please replace the charging pile"}, /* {(uint8_t *)"BMS:充电插座严重过温(521336,0)",          (uint8_t *)"BMS:(521336,0)"}, */    0}, //BMS
/*  65*/{0xF4, 521344,  5, {(uint8_t *)"BMS:加热膜或TMS接触器无法闭合(521344,5)", (uint8_t *)"BMS:(521344,5)"},    0}, //BMS
/*  66*/{0xF4, 521344,  3, {(uint8_t *)"BMS:加热膜或TMS接触器无法断开(521344,3)", (uint8_t *)"BMS:(521344,3)"},    0}, //BMS
/*  67*/{0xF4,0xFFFFF, 0xFF /* 521345, 13 */, {(uint8_t *)"BMS:整车端高压负载异常故障(521345,13)",   (uint8_t *)"BMS:(521345,13)"},   0}, //BMS
/*  68*/{0xF4,0xFFFFF, 0xFF /* 521346, 13 */, {(uint8_t *)"BMS:强切继电器故障(521346,13)",           (uint8_t *)"BMS:(521346,13)"},   0}, //BMS
/*  69*/{0xF4,0xFFFFF, 0xFF /* 521347,  0 */, {(uint8_t *)"BMS:烟雾探测器烟雾报警(521347,0)",        (uint8_t *)"BMS:(521347,0)"},    0}, //BMS
/*  70*/{0xF4,0xFFFFF, 0xFF /* 521348,  0 */, {(uint8_t *)"BMS:烟雾探测器高温报警(521348,0)",        (uint8_t *)"BMS:(521348,0)"},    0}, //BMS
/*  71*/{0xF4,0xFFFFF, 0xFF /* 521348,  2 */, {(uint8_t *)"BMS:烟雾探测器温度突变报警(521348,2)",    (uint8_t *)"BMS:(521348,2)"},    0}, //BMS
/*  72*/{0xF4,0xFFFFF, 0xFF /* 521349,  5 */, {(uint8_t *)"BMS:烟雾传感器掉线故障(521349,5)",        (uint8_t *)"BMS:(521349,5)"},    0}, //BMS
/*  73*/{0xF4, 521350, 12, {(uint8_t *)"BMS:电流采集失效(521350,12)",             (uint8_t *)"BMS:(521350,12)"},   0}, //BMS
/*  74*/{0xF4,0xFFFFF, 0xFF /* 521309,  2 */, {(uint8_t *)"BMS:SOC跳变故障报警(521309,2)",           (uint8_t *)"BMS:(521309,2)"},    0}, //BMS
/*  75*/{0xF4, 521304, 23, {(uint8_t *)"BMS:可充电储能系统不匹配故障(521304,23)", (uint8_t *)"BMS:(521304,23)"},   0}, //BMS

/*  76*/{0xEF,0xFFFFF, 0xFF /* 521700, 16 */, {(uint8_t *)"MCU:母线过压保护(521700,16)",                            (uint8_t *)"MCU:(521700,16)"}, 0}, //MCU
/*  77*/{0xEF, 521700,  0, {(uint8_t *)"MCU:母线过压停机,高于最高工作电压(软件保护)(521700,0)",  (uint8_t *)"MCU:(521700,0)"},  0}, //MCU
/*  78*/{0xEF, 521700, 22, {(uint8_t *)"MCU:母线过压停机,高于最高工作电压(硬件保护)(521700,22)", (uint8_t *)"MCU:(521700,22)"}, 0}, //MCU
/*  79*/{0xEF,0xFFFFF, 0xFF /* 521700, 18 */, {(uint8_t *)"MCU:母线欠压保护(521700,18)",                            (uint8_t *)"MCU:(521700,18)"}, 0}, //MCU
/*  80*/{0xEF, 521700,  1, {(uint8_t *)"MCU:母线欠压停机,低于最低工作电压(521700,1)",            (uint8_t *)"MCU:(521700,1)"},  0}, //MCU
/*  81*/{0xEF, 521701,  0, {(uint8_t *)"MCU:母线电流过流停机,软件保护(521701,0)",                (uint8_t *)"MCU:(521701,0)"},  0}, //MCU
/*  82*/{0xEF, 521701, 22, {(uint8_t *)"MCU:母线电流过流停机,硬件保护(521701,22)",               (uint8_t *)"MCU:(521701,22)"}, 0}, //MCU
/*  83*/{0xEF, 521702,  0, {(uint8_t *)"MCU:电机转速超速停机保护(521702,0)",                     (uint8_t *)"MCU:(521702,0)"},  0}, //MCU
/*  84*/{0xEF,0xFFFFF, 0xFF /* 521703, 16 */, {(uint8_t *)"MCU:电机绕组过温保护(521703,16)",                        (uint8_t *)"MCU:(521703,16)"}, 0}, //MCU
/*  85*/{0xEF, 521703,  0, {(uint8_t *)"MCU:电机绕组过温停机(521703,0)",                         (uint8_t *)"MCU:(521703,0)"},  0}, //MCU
/*  86*/{0xEF,0xFFFFF, 0xFF /* 521704, 16 */, {(uint8_t *)"MCU:功率模块温度过温保护(521704,16)",                    (uint8_t *)"MCU:(521704,16)"}, 0}, //MCU
/*  87*/{0xEF, 521704,  0, {(uint8_t *)"MCU:功率模块温度过温停机(521704,0)",                     (uint8_t *)"MCU:(521704,0)"},  0}, //MCU
/*  88*/{0xEF, 521705, 22, {(uint8_t *)"MCU:功率模块故障(521705,22)",                            (uint8_t *)"MCU:(521705,22)"}, 0}, //MCU
/*  89*/{0xEF,0xFFFFF, 0xFF /* 521706, 16 */, {(uint8_t *)"MCU:相电流过载,软件保护(521706,16)",                     (uint8_t *)"MCU:(521706,16)"}, 0}, //MCU
/*  90*/{0xEF, 521706,  0, {(uint8_t *)"MCU:相电流过流,软件保护(521706,0)",                      (uint8_t *)"MCU:(521706,0)"},  0}, //MCU
/*  91*/{0xEF, 521706, 22, {(uint8_t *)"MCU:相电流过流,硬件保护,最严重等级(521706,22)",          (uint8_t *)"MCU:(521706,22)"}, 0}, //MCU
/*  92*/{0xEF,    168,  0, {(uint8_t *)"MCU:24V供电电源过压,高于最高工作电压(168,0)",            (uint8_t *)"MCU:(168,0)"},     0}, //MCU
/*  93*/{0xEF,    168,  1, {(uint8_t *)"MCU:24V供电电源欠压,低于最低工作电压(168,1)",            (uint8_t *)"MCU:(168,1)"},     0}, //MCU
/*  94*/{0xEF, 521708,  2, {(uint8_t *)"MCU:U相电流传感器零偏过大(521708,2)",                    (uint8_t *)"MCU:(521708,2)"},  0}, //MCU
/*  95*/{0xEF, 521708,  4, {(uint8_t *)"MCU:U相电流传感器与地短路、断线(521708,4)",              (uint8_t *)"MCU:(521708,4)"},  0}, //MCU
/*  96*/{0xEF, 521708,  3, {(uint8_t *)"MCU:U相电流传感器与电源短路(521708,3)",                  (uint8_t *)"MCU:(521708,3)"},  0}, //MCU
/*  97*/{0xEF, 521710,  2, {(uint8_t *)"MCU:W相电流传感器零偏过大(521710,2)",                    (uint8_t *)"MCU:(521710,2)"},  0}, //MCU
/*  98*/{0xEF, 521710,  4, {(uint8_t *)"MCU:W相电流传感器与地短路、断线(521710,4)",              (uint8_t *)"MCU:(521710,4)"},  0}, //MCU
/*  99*/{0xEF, 521710,  3, {(uint8_t *)"MCU:W相电流传感器与电源短路(521710,3)",                  (uint8_t *)"MCU:(521710,3)"},  0}, //MCU
/* 100*/{0xEF, 521713,  2, {(uint8_t *)"MCU:电机温度传感器断线(521713,2)",                       (uint8_t *)"MCU:(521713,2)"},  0}, //MCU
/* 101*/{0xEF,0xFFFFF, 0xFF /*    630, 12 */, {(uint8_t *)"MCU:控制器软件错误(630,12)",                             (uint8_t *)"MCU:(630,12)"},    0}, //MCU
/* 102*/{0xEF,    639,  9, {(uint8_t *)"MCU:CAN通讯数据不连续或收不到,丢帧(639,9)",              (uint8_t *)"MCU:(639,9)"},     0}, //MCU
/* 103*/{0xEF,0xFFFFF, 0xFF /* 521717, 23 */, {(uint8_t *)"MCU:电机堵转(521717,23)",                                (uint8_t *)"MCU:(521717,23)"}, 0}, //MCU
/* 104*/{0xEF,0xFFFFF, 0xFF /* 521718, 11 */, {(uint8_t *)"MCU:10s之内同一故障出现3次(521718,11)",                  (uint8_t *)"MCU:(521718,11)"}, 0}, //MCU
/* 105*/{0xEF, 521719,  0, {(uint8_t *)"MCU:UVW三相绝缘故障(521719,0)",                          (uint8_t *)"MCU:(521719,0)"},  0}, //MCU
/* 106*/{0xEF, 521720,  0, {(uint8_t *)"MCU:电压传感器信号超过最大范围(521720,0)",               (uint8_t *)"MCU:(521720,0)"},  0}, //MCU
/* 107*/{0xEF, 521721,  0, {(uint8_t *)"MCU:IGBT温度传感器信号超过最大范围(521721,0)",           (uint8_t *)"MCU:(521721,0)"},  0}, //MCU
/* 108*/{0xEF, 521721,  4, {(uint8_t *)"MCU:IGBT温度传感器信号超过最小范围(521721,4)",           (uint8_t *)"MCU:(521721,4)"},  0}, //MCU
/* 109*/{0xEF, 521722,  0, {(uint8_t *)"MCU:电机温度传感器信号超过最大范围(521722,0)",           (uint8_t *)"MCU:(521722,0)"},  0}, //MCU
/* 110*/{0xEF, 521722,  4, {(uint8_t *)"MCU:电机温度传感器信号超过最小范围(521722,4)",           (uint8_t *)"MCU:(521722,4)"},  0}, //MCU
/* 111*/{0xEF, 521723,  2, {(uint8_t *)"MCU:转速传感器信号错误(521723,2)",                       (uint8_t *)"MCU:(521723,2)"},  0}, //MCU
/* 112*/{0xEF, 521724,  0, {(uint8_t *)"MCU:高压线路断路(521724,0)",                             (uint8_t *)"MCU:(521724,0)"},  0}, //MCU
/* 113*/{0xEF, 521725,  0, {(uint8_t *)"MCU:初始化的所有故障(521725,0)",                         (uint8_t *)"MCU:(521725,0)"},  0}, //MCU
/* 114*/{0xEF, 521726,  2, {(uint8_t *)"MCU:电流传感器偏移超出范围(521726,2)",                   (uint8_t *)"MCU:(521726,2)"},  0}, //MCU

/* 115*/{0x30, 521801, 12, {(uint8_t *)"空压机:电流检测故障(521801,12)",  (uint8_t *)"Air Compressor:(521801,12)"}, 0}, //空压机
/* 116*/{0x30, 521803,  3, {(uint8_t *)"空压机:控制器过载故障(521803,3)", (uint8_t *)"Air Compressor:(521803,3)"},  0}, //空压机
/* 117*/{0x30, 521803, 12, {(uint8_t *)"空压机:输出过流(521803,12)",      (uint8_t *)"Air Compressor:(521803,12)"}, 0}, //空压机
/* 118*/{0x30,0xFFFFF, 0xFF /* 521808, 12 */, {(uint8_t *)"空压机:PT100短路(521808,12)",     (uint8_t *)"Air Compressor:(521808,12)"}, 0}, //空压机
/* 119*/{0x30,0xFFFFF, 0xFF /* 521808,  5 */, {(uint8_t *)"空压机:PT100开路(521808,5)",      (uint8_t *)"Air Compressor:(521808,5)"},  0}, //空压机
/* 120*/{0x30, 521817,  4, {(uint8_t *)"空压机:输入欠压(521817,4)",       (uint8_t *)"Air Compressor:(521817,4)"},  0}, //空压机
/* 121*/{0x30, 521817,  3, {(uint8_t *)"空压机:输入过压(521817,3)",       (uint8_t *)"Air Compressor:(521817,3)"},  0}, //空压机
/* 122*/{0x30, 521819,  0, {(uint8_t *)"空压机:控制器过温故障(521819,0)", (uint8_t *)"Air Compressor:(521819,0)"},  0}, //空压机
/* 123*/{0x30, 521819,  3, {(uint8_t *)"空压机:控制器过温告警(521819,3)", (uint8_t *)"Air Compressor:(521819,3)"},  0}, //空压机
/* 124*/{0x30,0xFFFFF, 0xFF /* 521820,  0 */, {(uint8_t *)"空压机:电机过温故障(521820,0)",   (uint8_t *)"Air Compressor:(521820,0)"},  0}, //空压机
/* 125*/{0x30,0xFFFFF, 0xFF /* 521820,  3 */, {(uint8_t *)"空压机:电机过温告警(521820,3)",   (uint8_t *)"Air Compressor:(521820,3)"},  0}, //空压机
/* 126*/{0x30, 521835,  2, {(uint8_t *)"空压机:输出缺相(521835,2)",       (uint8_t *)"Air Compressor:(521835,2)"},  0}, //空压机
/* 127*/{0x30, 521844,  6, {(uint8_t *)"空压机:对地短路(521844,6)",       (uint8_t *)"Air Compressor:(521844,6)"},  0}, //空压机
/* 128*/{0x30, 521845, 12, {(uint8_t *)"空压机:失调故障(521845,12)",      (uint8_t *)"Air Compressor:(521845,12)"}, 0}, //空压机
/* 129*/{0x30, 521846, 10, {(uint8_t *)"空压机:速度偏差(521846,10)",      (uint8_t *)"Air Compressor:(521846,10)"}, 0}, //空压机

/* 130*/{0x03,   1378,  1, {(uint8_t *)"AMT:TCU电源电压高(1378,1)",             (uint8_t *)"AMT:(1378,1)"},  0}, //AMT
/* 131*/{0x03,   1378,  2, {(uint8_t *)"AMT:TCU电源电压低(1378,2)",             (uint8_t *)"AMT:(1378,2)"},  0}, //AMT
/* 132*/{0x03,   1824,  8, {(uint8_t *)"AMT:车速信号无效(1824,8)",              (uint8_t *)"AMT:(1824,8)"},  0}, //AMT
/* 133*/{0x03,   1824,  4, {(uint8_t *)"AMT:车速没有信号(1824,4)",              (uint8_t *)"AMT:(1824,4)"},  0}, //AMT
/* 134*/{0x03,  54786,  4, {(uint8_t *)"AMT:CAN收不到选档面板信号(54786,4)",    (uint8_t *)"AMT:(54786,4)"}, 0}, //AMT
/* 135*/{0x03,   5953,  1, {(uint8_t *)"AMT:换档位置传感器高于最大值(5953,1)",  (uint8_t *)"AMT:(5953,1)"},  0}, //AMT
/* 136*/{0x03,   5953,  2, {(uint8_t *)"AMT:换档位置传感器低于最小值(5953,2)",  (uint8_t *)"AMT:(5953,2)"},  0}, //AMT
/* 137*/{0x03,   5953,  8, {(uint8_t *)"AMT:换档位置传感器信号无效(5953,8)",    (uint8_t *)"AMT:(5953,8)"},  0}, //AMT
/* 138*/{0x03,   5954,  1, {(uint8_t *)"AMT:选档位置传感器高于最大值(5954,1)",  (uint8_t *)"AMT:(5954,1)"},  0}, //AMT
/* 139*/{0x03,   5954,  2, {(uint8_t *)"AMT:选档位置传感器低于最小值(5954,2)",  (uint8_t *)"AMT:(5954,2)"},  0}, //AMT
/* 140*/{0x03,   5954,  8, {(uint8_t *)"AMT:选档位置传感器信号无效(5954,8)",    (uint8_t *)"AMT:(5954,8)"},  0}, //AMT
/* 141*/{0x03,   5969,  8, {(uint8_t *)"AMT:选档执行机构卡死(5969,8)",          (uint8_t *)"AMT:(5969,8)"},  0}, //AMT
/* 142*/{0x03,   5971,  8, {(uint8_t *)"AMT:换档执行机构卡死(5971,8)",          (uint8_t *)"AMT:(5971,8)"},  0}, //AMT
/* 143*/{0x03,   6208,  8, {(uint8_t *)"AMT:1、2挡均换挡失败(6208,8)",          (uint8_t *)"AMT:(6208,8)"},  0}, //AMT
/* 144*/{0x03,   5990,  8, {(uint8_t *)"AMT:上次断电异常(5990,8)",              (uint8_t *)"AMT:(5990,8)"},  0}, //AMT
/* 145*/{0x03,   5991,  8, {(uint8_t *)"AMT:bois软件错误(5991,8)",              (uint8_t *)"AMT:(5991,8)"},  0}, //AMT
/* 146*/{0x03,   5992,  8, {(uint8_t *)"AMT:硬件错误(5992,8)",                  (uint8_t *)"AMT:(5992,8)"},  0}, //AMT
/* 147*/{0x03,   7670,  4, {(uint8_t *)"AMT:传感器短路或取力器无法断开(7670,4)",(uint8_t *)"AMT:(7670,4)"},  0}, //AMT

/* 148*/{0x1A, 521500,  0, {(uint8_t *)"DCDC:输出严重过压(521500,0)",           (uint8_t *)"DCDC:(521500,0)"},  0},//DCDC
/* 149*/{0x1A, 521500, 16, {(uint8_t *)"DCDC:输出过压(521500,16)",              (uint8_t *)"DCDC:(521500,16)"}, 0},//DCDC
/* 150*/{0x1A, 521501,  0, {(uint8_t *)"DCDC:输出过流(521501,0)",               (uint8_t *)"DCDC:(521501,0)"},  0},//DCDC
/* 151*/{0x1A, 521502,  7, {(uint8_t *)"DCDC:过温保护(521502,7)",               (uint8_t *)"DCDC:(521502,7)"},  0},//DCDC
/* 152*/{0x1A, 521503,  0, {(uint8_t *)"DCDC:输入过压(521503,0)",               (uint8_t *)"DCDC:(521503,0)"},  0},//DCDC
/* 153*/{0x1A, 521504,  4, {(uint8_t *)"DCDC:输入欠压(521504,4)",               (uint8_t *)"DCDC:(521504,4)"},  0},//DCDC
/* 154*/{0x1A, 521505,  3, {(uint8_t *)"DCDC:过温告警(521505,3)",               (uint8_t *)"DCDC:(521505,3)"},  0},//DCDC
/* 155*/{0x2E, 521900,  0, {(uint8_t *)"HSCU:输入欠压(521900,0)",               (uint8_t *)"HSCU:(521900,0)"},  0},//HSCU
/* 156*/{0x2E, 521901,  0, {(uint8_t *)"HSCU:输入过压(521901,0)",               (uint8_t *)"HSCU:(521901,0)"},  0},//HSCU
/* 157*/{0x2E, 521902, 12, {(uint8_t *)"HSCU:EEPROM故障(521902,12)",            (uint8_t *)"HSCU:(521902,12)"}, 0},//HSCU
/* 158*/{0x2E, 521903,  0, {(uint8_t *)"HSCU:过流故障(521903,0)",               (uint8_t *)"HSCU:(521903,0)"},  0},//HSCU
/* 159*/{0x2E,0xFFFFF,0xFF /* 521904,  0 */, {(uint8_t *)"HSCU:过温故障(521904,0)",               (uint8_t *)"HSCU:(521904,0)"},  0},//HSCU
/* 160*/{0x2E, 521905,  0, {(uint8_t *)"HSCU:控制器过载故障(521905,0)",         (uint8_t *)"HSCU:(521905,0)"},  0},//HSCU
/* 161*/{0x2E, 521906,  8, {(uint8_t *)"HSCU:输出缺相(521906,8)",               (uint8_t *)"HSCU:(521906,8)"},  0},//HSCU
/* 162*/{0x2E, 521907, 23, {(uint8_t *)"HSCU:CAN通讯故障(521907,23)",           (uint8_t *)"HSCU:(521907,23)"}, 0},//HSCU
/* 163*/{0x1E, 521550,  3, {(uint8_t *)"PDU:输出短路(521550,3)",                (uint8_t *)"PDU:(521550,3)"},   0},//PDU
/* 164*/{0x1E, 521551, 15, {(uint8_t *)"PDU:负载电容过大(521551,15)",           (uint8_t *)"PDU:(521551,15)"},  0},//PDU
/* 165*/{0x1E, 521552,  5, {(uint8_t *)"PDU:外部输入高压失电超过3S(521552,5)",  (uint8_t *)"PDU:(521552,5)"},   0},//PDU
/* 166*/{0x1E, 521553, 15, {(uint8_t *)"PDU:预充高压压差过大(521553,15)",       (uint8_t *)"PDU:(521553,15)"},  0},//PDU
/* 167*/{0x1E, 521568, 22, {(uint8_t *)"PDU:上装回路上电反向压差大(521568,22)", (uint8_t *)"PDU:(521568,22)"},  0},//PDU
/* 168*/{0x1E,0xFFFFF, 0xFF /* 521555,  2 */, {(uint8_t *)"PDU:MCU欠压复位(521555,2)",             (uint8_t *)"PDU:(521555,2)"},   0},//PDU
/* 169*/{0x1E, 521555,  5, {(uint8_t *)"PDU:低压电控制失电(521555,5)",          (uint8_t *)"PDU:(521555,5)"},   0},//PDU
/* 170*/{0x1E,0xFFFFF, 0xFF /* 521556, 31 */, {(uint8_t *)"PDU:曾有禁止信号(521556,31)",           (uint8_t *)"PDU:(521556,31)"},  0},//PDU
/* 171*/{0x1E, 521557,  1, {(uint8_t *)"PDU:高压输入异常(521557,1)",            (uint8_t *)"PDU:(521557,1)"},   0},//PDU
/* 172*/{0x1E, 521558,  3, {(uint8_t *)"PDU:主接触器无法断开(521558,3)",        (uint8_t *)"PDU:(521558,3)"},   0},//PDU
/* 173*/{0x1E, 521558,  5, {(uint8_t *)"PDU:主接触器无法闭合(521558,5)",        (uint8_t *)"PDU:(521558,5)"},   0},//PDU

/* 174*/{0x0B,0xFFFFF,0xFF /*   789,  8 */, {(uint8_t *)"ABS:前桥左轮速传感器或线路故障(789,8)",  (uint8_t *)"ABS:(789,8)"},   0}, //ABS河南焦作
/* 175*/{0x0B,0xFFFFF,0xFF /*   789, 12 */, {(uint8_t *)"ABS:前桥左轮速传感器或线路故障(789,12)", (uint8_t *)"ABS:(789,12)"},  0}, //ABS河南焦作
/* 176*/{0x0B,0xFFFFF,0xFF /*   790,  8 */, {(uint8_t *)"ABS:前桥右轮速传感器或线路故障(790,8)",  (uint8_t *)"ABS:(790,8)"},   0}, //ABS河南焦作
/* 177*/{0x0B,0xFFFFF,0xFF /*   790, 12 */, {(uint8_t *)"ABS:前桥右轮速传感器或线路故障(790,12)", (uint8_t *)"ABS:(790,12)"},  0}, //ABS河南焦作
/* 178*/{0x0B,0xFFFFF,0xFF /*   791,  8 */, {(uint8_t *)"ABS:后桥左轮速传感器或线路故障(791,8)",  (uint8_t *)"ABS:(791,8)"},   0}, //ABS河南焦作
/* 179*/{0x0B,0xFFFFF,0xFF /*   791, 12 */, {(uint8_t *)"ABS:后桥左轮速传感器或线路故障(791,12)", (uint8_t *)"ABS:(791,12)"},  0}, //ABS河南焦作
/* 180*/{0x0B,0xFFFFF,0xFF /*   792,  8 */, {(uint8_t *)"ABS:后桥右轮速传感器或线路故障(792,8)",  (uint8_t *)"ABS:(792,8)"},   0}, //ABS河南焦作
/* 181*/{0x0B,0xFFFFF,0xFF /*   792, 12 */, {(uint8_t *)"ABS:后桥右轮速传感器或线路故障(792,12)", (uint8_t *)"ABS:(792,12)"},  0}, //ABS河南焦作
/* 182*/{0x0B,0xFFFFF,0xFF /*   795,  4 */, {(uint8_t *)"ABS:前桥左电磁阀或线路故障(795,4)",      (uint8_t *)"ABS:(795,4)"},   0}, //ABS河南焦作
/* 183*/{0x0B,0xFFFFF,0xFF /*   795,  5 */, {(uint8_t *)"ABS:前桥左电磁阀或线路故障(795,5)",      (uint8_t *)"ABS:(795,5)"},   0}, //ABS河南焦作
/* 184*/{0x0B,0xFFFFF,0xFF /*   796,  4 */, {(uint8_t *)"ABS:前桥右电磁阀或线路故障(796,4)",      (uint8_t *)"ABS:(796,4)"},   0}, //ABS河南焦作
/* 185*/{0x0B,0xFFFFF,0xFF /*   796,  5 */, {(uint8_t *)"ABS:前桥右电磁阀或线路故障(796,5)",      (uint8_t *)"ABS:(796,5)"},   0}, //ABS河南焦作
/* 186*/{0x0B,0xFFFFF,0xFF /*   797,  4 */, {(uint8_t *)"ABS:后桥左电磁阀或线路故障(797,4)",      (uint8_t *)"ABS:(797,4)"},   0}, //ABS河南焦作
/* 187*/{0x0B,0xFFFFF,0xFF /*   797,  5 */, {(uint8_t *)"ABS:后桥左电磁阀或线路故障(797,5)",      (uint8_t *)"ABS:(797,5)"},   0}, //ABS河南焦作
/* 188*/{0x0B,0xFFFFF,0xFF /*   798,  4 */, {(uint8_t *)"ABS:后桥右电磁阀或线路故障(798,4)",      (uint8_t *)"ABS:(798,4)"},   0}, //ABS河南焦作
/* 189*/{0x0B,0xFFFFF,0xFF /*   798,  5 */, {(uint8_t *)"ABS:后桥右电磁阀或线路故障(798,5)",      (uint8_t *)"ABS:(798,5)"},   0}, //ABS河南焦作
/* 190*/{0x0B,0xFFFFF,0xFF /*   627,  3 */, {(uint8_t *)"ABS:供电电压异常(627,3)",                (uint8_t *)"ABS:(627,3)"},   0}, //ABS河南焦作
/* 191*/{0x0B,0xFFFFF,0xFF /*   627,  4 */, {(uint8_t *)"ABS:供电电压异常(627,4)",                (uint8_t *)"ABS:(627,4)"},   0}, //ABS河南焦作
/* 192*/{0x0B,0xFFFFF,0xFF /*   629, 12 */, {(uint8_t *)"ABS:控制器或线路故障(629,12)",           (uint8_t *)"ABS:(629,12)"},  0}, //ABS河南焦作
/* 193*/{0x0B,0xFFFFF,0xFF /*   806,  4 */, {(uint8_t *)"ABS:ASR电磁阀断路(806,4)",               (uint8_t *)"ABS:(806,4)"},   0}, //ABS河南焦作
/* 194*/{0x0B,0xFFFFF,0xFF /*   116,  4 */, {(uint8_t *)"ABS:左气室压力传感器或线路故障(116,4)",  (uint8_t *)"ABS:(116,4)"},   0}, //ABS河南焦作
/* 195*/{0x0B,0xFFFFF,0xFF /*   117,  4 */, {(uint8_t *)"ABS:右气室压力传感器或线路故障(117,4)",  (uint8_t *)"ABS:(117,4)"},   0}, //ABS河南焦作
/* 196*/{0x0B,0xFFFFF,0xFF /*   116,  5 */, {(uint8_t *)"ABS:左制动气室压力传感器失效(116,5)",    (uint8_t *)"ABS:(116,5)"},   0}, //ABS河南焦作
/* 197*/{0x0B,0xFFFFF,0xFF /*   117,  5 */, {(uint8_t *)"ABS:右制动气室压力传感器失效(117,5)",    (uint8_t *)"ABS:(117,5)"},   0}, //ABS河南焦作

/* 198*/{0x0B,0xFFFFF,0xFF /*    168,  3 */, {(uint8_t *)"ABS:供电电压高(168,3)",                     (uint8_t *)"ABS:(168,3)"},     0}, //ABSKNORR
/* 199*/{0x0B,0xFFFFF,0xFF /*    168,  4 */, {(uint8_t *)"ABS:供电电压低(168,4)",                     (uint8_t *)"ABS:(168,4)"},     0}, //ABSKNORR
/* 200*/{0x0B,0xFFFFF,0xFF /*    564,  3 */, {(uint8_t *)"ABS:桥间差速锁电压高(564,3)",               (uint8_t *)"ABS:(564,3)"},     0}, //ABSKNORR
/* 201*/{0x0B,0xFFFFF,0xFF /*    564,  4 */, {(uint8_t *)"ABS:桥间差速锁电压低(564,4)",               (uint8_t *)"ABS:(564,4)"},     0}, //ABSKNORR
/* 202*/{0x0B,0xFFFFF,0xFF /*    564,  5 */, {(uint8_t *)"ABS:桥间差速锁开路(564,5)",                 (uint8_t *)"ABS:(564,5)"},     0}, //ABSKNORR
/* 203*/{0x0B,0xFFFFF,0xFF /*    575, 14 */, {(uint8_t *)"ABS:ABS非公路模式激活(575,14)",             (uint8_t *)"ABS:(575,14)"},    0}, //ABSKNORR
/* 204*/{0x0B,0xFFFFF,0xFF /*    576, 14 */, {(uint8_t *)"ABS:滚筒台测试模式激活,关闭ASR(576,14)",    (uint8_t *)"ABS:(576,14)"},    0}, //ABSKNORR
/* 205*/{0x0B,0xFFFFF,0xFF /*    609,  2 */, {(uint8_t *)"ABS:ASR系统信号异常(609,2)",                (uint8_t *)"ABS:(609,2)"},     0}, //ABSKNORR
/* 206*/{0x0B,0xFFFFF,0xFF /*    609, 11 */, {(uint8_t *)"ABS:传感器CAN通讯故障(609,11)",             (uint8_t *)"ABS:(609,11)"},    0}, //ABSKNORR
/* 207*/{0x0B,0xFFFFF,0xFF /*    609, 14 */, {(uint8_t *)"ABS:ASR系统被开关关闭(609,14)",             (uint8_t *)"ABS:(609,14)"},    0}, //ABSKNORR
/* 208*/{0x0B,0xFFFFF,0xFF /*    612, 14 */, {(uint8_t *)"ABS:前桥差速锁啮合使ABS系统失效(612,14)",   (uint8_t *)"ABS:(612,14)"},    0}, //ABSKNORR
/* 209*/{0x0B,0xFFFFF,0xFF /*    629,  2 */, {(uint8_t *)"ABS:ABS电磁阀信号异常(629,2)",              (uint8_t *)"ABS:(629,2)"},     0}, //ABSKNORR
/* 210*/{0x0B,0xFFFFF,0xFF /*    629,  3 */, {(uint8_t *)"ABS:ECU故障(629,3)",                        (uint8_t *)"ABS:(629,3)"},     0}, //ABSKNORR
/* 211*/{0x0B,0xFFFFF,0xFF /*    629,  7 */, {(uint8_t *)"ABS:ABS系统故障(629,7)",                    (uint8_t *)"ABS:(629,7)"},     0}, //ABSKNORR
/* 212*/{0x0B,0xFFFFF,0xFF /*    629,  8 */, {(uint8_t *)"ABS:ABS系统配置故障(629,8)",                (uint8_t *)"ABS:(629,8)"},     0}, //ABSKNORR
/* 213*/{0x0B,0xFFFFF,0xFF /*    629, 11 */, {(uint8_t *)"ABS:ABS系统故障(629,11)",                   (uint8_t *)"ABS:(629,11)"},    0}, //ABSKNORR
/* 214*/{0x0B,0xFFFFF,0xFF /*    629, 12 */, {(uint8_t *)"ABS:ECU内部故障(629,12)",                   (uint8_t *)"ABS:(629,12)"},    0}, //ABSKNORR
/* 215*/{0x0B,0xFFFFF,0xFF /*    629, 13 */, {(uint8_t *)"ABS:ECU标定错误(629,13)",                   (uint8_t *)"ABS:(629,13)"},    0}, //ABSKNORR
/* 216*/{0x0B,0xFFFFF,0xFF /*    629, 14 */, {(uint8_t *)"ABS:ECU内部故障(629,14)",                   (uint8_t *)"ABS:(629,14)"},    0}, //ABSKNORR
/* 217*/{0x0B,0xFFFFF,0xFF /*    630, 11 */, {(uint8_t *)"ABS:ECU软件故障(630,11)",                   (uint8_t *)"ABS:(630,11)"},    0}, //ABSKNORR
/* 218*/{0x0B,0xFFFFF,0xFF /*    630, 12 */, {(uint8_t *)"ABS:ECU故障(630,12)",                       (uint8_t *)"ABS:(630,12)"},    0}, //ABSKNORR
/* 219*/{0x0B,0xFFFFF,0xFF /*    630, 13 */, {(uint8_t *)"ABS:ECU标定错误(630,13)",                   (uint8_t *)"ABS:(630,13)"},    0}, //ABSKNORR
/* 220*/{0x0B,0xFFFFF,0xFF /*    630, 14 */, {(uint8_t *)"ABS:ECUCAN通讯故障(630,14)",                (uint8_t *)"ABS:(630,14)"},    0}, //ABSKNORR
/* 221*/{0x0B,0xFFFFF,0xFF /*    639,  2 */, {(uint8_t *)"ABS:CAN通讯故障(639,2)",                    (uint8_t *)"ABS:(639,2)"},     0}, //ABSKNORR
/* 222*/{0x0B,0xFFFFF,0xFF /*    639, 11 */, {(uint8_t *)"ABS:CAN通讯故障(639,11)",                   (uint8_t *)"ABS:(639,11)"},    0}, //ABSKNORR
/* 223*/{0x0B,0xFFFFF,0xFF /*    639, 14 */, {(uint8_t *)"ABS:CAN通讯故障(639,14)",                   (uint8_t *)"ABS:(639,14)"},    0}, //ABSKNORR
/* 224*/{0x0B,0xFFFFF,0xFF /*    789,  1 */, {(uint8_t *)"ABS:前桥左轮速传感器信号异常(789,1)",       (uint8_t *)"ABS:(789,1)"},     0}, //ABSKNORR
/* 225*/{0x0B,0xFFFFF,0xFF /*    789,  2 */, {(uint8_t *)"ABS:前桥左轮速传感器信号异常(789,2)",       (uint8_t *)"ABS:(789,2)"},     0}, //ABSKNORR
/* 226*/{0x0B,0xFFFFF,0xFF /*    789,  5 */, {(uint8_t *)"ABS:前桥左轮速传感器开路(789,5)",           (uint8_t *)"ABS:(789,5)"},     0}, //ABSKNORR
/* 227*/{0x0B,0xFFFFF,0xFF /*    789,  7 */, {(uint8_t *)"ABS:前桥左轮速传感器故障(789,7)",           (uint8_t *)"ABS:(789,7)"},     0}, //ABSKNORR
/* 228*/{0x0B,0xFFFFF,0xFF /*    789,  8 */, {(uint8_t *)"ABS:前桥左轮速传感器信号异常(789,8)",       (uint8_t *)"ABS:(789,8)"},     0}, //ABSKNORR
/* 229*/{0x0B,0xFFFFF,0xFF /*    789, 10 */, {(uint8_t *)"ABS:前桥左轮速传感器信号异常(789,10)",      (uint8_t *)"ABS:(789,10)"},    0}, //ABSKNORR
/* 230*/{0x0B,0xFFFFF,0xFF /*    789, 13 */, {(uint8_t *)"ABS:前桥左轮速传感器标定错误(789,13)",      (uint8_t *)"ABS:(789,13)"},    0}, //ABSKNORR
/* 231*/{0x0B,0xFFFFF,0xFF /*    790,  1 */, {(uint8_t *)"ABS:前桥右轮速传感器信号异常(790,1)",       (uint8_t *)"ABS:(790,1)"},     0}, //ABSKNORR
/* 232*/{0x0B,0xFFFFF,0xFF /*    790,  2 */, {(uint8_t *)"ABS:前桥右轮速传感器信号异常(790,2)",       (uint8_t *)"ABS:(790,2)"},     0}, //ABSKNORR
/* 233*/{0x0B,0xFFFFF,0xFF /*    790,  5 */, {(uint8_t *)"ABS:前桥右轮速传感器开路(790,5)",           (uint8_t *)"ABS:(790,5)"},     0}, //ABSKNORR
/* 234*/{0x0B,0xFFFFF,0xFF /*    790,  7 */, {(uint8_t *)"ABS:前桥右轮速传感器故障(790,7)",           (uint8_t *)"ABS:(790,7)"},     0}, //ABSKNORR
/* 235*/{0x0B,0xFFFFF,0xFF /*    790,  8 */, {(uint8_t *)"ABS:前桥右轮速传感器信号异常(790,8)",       (uint8_t *)"ABS:(790,8)"},     0}, //ABSKNORR
/* 236*/{0x0B,0xFFFFF,0xFF /*    790, 10 */, {(uint8_t *)"ABS:前桥右轮速传感器信号异常(790,10)",      (uint8_t *)"ABS:(790,10)"},    0}, //ABSKNORR
/* 237*/{0x0B,0xFFFFF,0xFF /*    790, 13 */, {(uint8_t *)"ABS:前桥右轮速传感器标定错误(790,13)",      (uint8_t *)"ABS:(790,13)"},    0}, //ABSKNORR
/* 238*/{0x0B,0xFFFFF,0xFF /*    791,  1 */, {(uint8_t *)"ABS:驱动桥左轮速传感器信号异常(791,1)",     (uint8_t *)"ABS:(791,1)"},     0}, //ABSKNORR
/* 239*/{0x0B,0xFFFFF,0xFF /*    791,  2 */, {(uint8_t *)"ABS:驱动桥左轮速传感器信号异常(791,2)",     (uint8_t *)"ABS:(791,2)"},     0}, //ABSKNORR
/* 240*/{0x0B,0xFFFFF,0xFF /*    791,  5 */, {(uint8_t *)"ABS:驱动桥左轮速传感器开路(791,5)",         (uint8_t *)"ABS:(791,5)"},     0}, //ABSKNORR
/* 241*/{0x0B,0xFFFFF,0xFF /*    791,  7 */, {(uint8_t *)"ABS:驱动桥左轮速传感器故障(791,7)",         (uint8_t *)"ABS:(791,7)"},     0}, //ABSKNORR
/* 242*/{0x0B,0xFFFFF,0xFF /*    791,  8 */, {(uint8_t *)"ABS:驱动桥左轮速传感器信号异常(791,8)",     (uint8_t *)"ABS:(791,8)"},     0}, //ABSKNORR
/* 243*/{0x0B,0xFFFFF,0xFF /*    791, 10 */, {(uint8_t *)"ABS:驱动桥左轮速传感器信号异常(791,10)",    (uint8_t *)"ABS:(791,10)"},    0}, //ABSKNORR
/* 244*/{0x0B,0xFFFFF,0xFF /*    791, 13 */, {(uint8_t *)"ABS:驱动桥左轮速传感器标定错误(791,13)",    (uint8_t *)"ABS:(791,13)"},    0}, //ABSKNORR
/* 245*/{0x0B,0xFFFFF,0xFF /*    792,  1 */, {(uint8_t *)"ABS:驱动桥右轮速传感器信号异常(792,1)",     (uint8_t *)"ABS:(792,1)"},     0}, //ABSKNORR
/* 246*/{0x0B,0xFFFFF,0xFF /*    792,  2 */, {(uint8_t *)"ABS:驱动桥右轮速传感器信号异常(792,2)",     (uint8_t *)"ABS:(792,2)"},     0}, //ABSKNORR
/* 247*/{0x0B,0xFFFFF,0xFF /*    792,  5 */, {(uint8_t *)"ABS:驱动桥右轮速传感器开路(792,5)",         (uint8_t *)"ABS:(792,5)"},     0}, //ABSKNORR
/* 248*/{0x0B,0xFFFFF,0xFF /*    792,  7 */, {(uint8_t *)"ABS:驱动桥右轮速传感器故障(792,7)",         (uint8_t *)"ABS:(792,7)"},     0}, //ABSKNORR
/* 249*/{0x0B,0xFFFFF,0xFF /*    792,  8 */, {(uint8_t *)"ABS:驱动桥右轮速传感器信号异常(792,8)",     (uint8_t *)"ABS:(792,8)"},     0}, //ABSKNORR
/* 250*/{0x0B,0xFFFFF,0xFF /*    792, 10 */, {(uint8_t *)"ABS:驱动桥右轮速传感器信号异常(792,10)",    (uint8_t *)"ABS:(792,10)"},    0}, //ABSKNORR
/* 251*/{0x0B,0xFFFFF,0xFF /*    792, 13 */, {(uint8_t *)"ABS:驱动桥右轮速传感器标定错误(792,13)",    (uint8_t *)"ABS:(792,13)"},    0}, //ABSKNORR
/* 252*/{0x0B,0xFFFFF,0xFF /*    793,  1 */, {(uint8_t *)"ABS:第三桥左轮速传感器信号异常(793,1)",     (uint8_t *)"ABS:(793,1)"},     0}, //ABSKNORR
/* 253*/{0x0B,0xFFFFF,0xFF /*    793,  2 */, {(uint8_t *)"ABS:第三桥左轮速传感器信号异常(793,2)",     (uint8_t *)"ABS:(793,2)"},     0}, //ABSKNORR
/* 254*/{0x0B,0xFFFFF,0xFF /*    793,  5 */, {(uint8_t *)"ABS:第三桥左轮速传感器开路(793,5)",         (uint8_t *)"ABS:(793,5)"},     0}, //ABSKNORR
/* 255*/{0x0B,0xFFFFF,0xFF /*    793,  7 */, {(uint8_t *)"ABS:第三桥左轮速传感器故障(793,7)",         (uint8_t *)"ABS:(793,7)"},     0}, //ABSKNORR
/* 256*/{0x0B,0xFFFFF,0xFF /*    793,  8 */, {(uint8_t *)"ABS:第三桥左轮速传感器信号异常(793,8)",     (uint8_t *)"ABS:(793,8)"},     0}, //ABSKNORR
/* 257*/{0x0B,0xFFFFF,0xFF /*    793, 10 */, {(uint8_t *)"ABS:第三桥左轮速传感器信号异常(793,10)",    (uint8_t *)"ABS:(793,10)"},    0}, //ABSKNORR
/* 258*/{0x0B,0xFFFFF,0xFF /*    793, 13 */, {(uint8_t *)"ABS:第三桥左轮速传感器标定错误(793,13)",    (uint8_t *)"ABS:(793,13)"},    0}, //ABSKNORR
/* 259*/{0x0B,0xFFFFF,0xFF /*    794,  1 */, {(uint8_t *)"ABS:第三桥右轮速传感器信号异常(794,1)",     (uint8_t *)"ABS:(794,1)"},     0}, //ABSKNORR
/* 260*/{0x0B,0xFFFFF,0xFF /*    794,  2 */, {(uint8_t *)"ABS:第三桥右轮速传感器信号异常(794,2)",     (uint8_t *)"ABS:(794,2)"},     0}, //ABSKNORR
/* 261*/{0x0B,0xFFFFF,0xFF /*    794,  5 */, {(uint8_t *)"ABS:第三桥右轮速传感器开路(794,5)",         (uint8_t *)"ABS:(794,5)"},     0}, //ABSKNORR
/* 262*/{0x0B,0xFFFFF,0xFF /*    794,  7 */, {(uint8_t *)"ABS:第三桥右轮速传感器故障(794,7)",         (uint8_t *)"ABS:(794,7)"},     0}, //ABSKNORR
/* 263*/{0x0B,0xFFFFF,0xFF /*    794,  8 */, {(uint8_t *)"ABS:第三桥右轮速传感器信号异常(794,8)",     (uint8_t *)"ABS:(794,8)"},     0}, //ABSKNORR
/* 264*/{0x0B,0xFFFFF,0xFF /*    794, 10 */, {(uint8_t *)"ABS:第三桥右轮速传感器信号异常(794,10)",    (uint8_t *)"ABS:(794,10)"},    0}, //ABSKNORR
/* 265*/{0x0B,0xFFFFF,0xFF /*    794, 13 */, {(uint8_t *)"ABS:第三桥右轮速传感器标定错误(794,13)",    (uint8_t *)"ABS:(794,13)"},    0}, //ABSKNORR
/* 266*/{0x0B,0xFFFFF,0xFF /*    795,  5 */, {(uint8_t *)"ABS:前桥左ABS电磁阀开路(795,5)",            (uint8_t *)"ABS:(795,5)"},     0}, //ABSKNORR
/* 267*/{0x0B,0xFFFFF,0xFF /*    795, 13 */, {(uint8_t *)"ABS:前桥左ABS电磁阀标定错误(795,13)",       (uint8_t *)"ABS:(795,13)"},    0}, //ABSKNORR
/* 268*/{0x0B,0xFFFFF,0xFF /*    795, 14 */, {(uint8_t *)"ABS:前桥左ABS电磁阀装配错误(795,14)",       (uint8_t *)"ABS:(795,14)"},    0}, //ABSKNORR
/* 269*/{0x0B,0xFFFFF,0xFF /*    796,  5 */, {(uint8_t *)"ABS:前桥右ABS电磁阀开路(796,5)",            (uint8_t *)"ABS:(796,5)"},     0}, //ABSKNORR
/* 270*/{0x0B,0xFFFFF,0xFF /*    796, 13 */, {(uint8_t *)"ABS:前桥右ABS电磁阀标定错误(796,13)",       (uint8_t *)"ABS:(796,13)"},    0}, //ABSKNORR
/* 271*/{0x0B,0xFFFFF,0xFF /*    796, 14 */, {(uint8_t *)"ABS:前桥右ABS电磁阀装配错误(796,14)",       (uint8_t *)"ABS:(796,14)"},    0}, //ABSKNORR
/* 272*/{0x0B,0xFFFFF,0xFF /*    797,  5 */, {(uint8_t *)"ABS:驱动桥左ABS电磁阀开路(797,5)",          (uint8_t *)"ABS:(797,5)"},     0}, //ABSKNORR
/* 273*/{0x0B,0xFFFFF,0xFF /*    797, 13 */, {(uint8_t *)"ABS:驱动桥左ABS电磁阀标定错误(797,13)",     (uint8_t *)"ABS:(797,13)"},    0}, //ABSKNORR
/* 274*/{0x0B,0xFFFFF,0xFF /*    797, 14 */, {(uint8_t *)"ABS:驱动桥左ABS电磁阀装配错误(797,14)",     (uint8_t *)"ABS:(797,14)"},    0}, //ABSKNORR
/* 275*/{0x0B,0xFFFFF,0xFF /*    798,  5 */, {(uint8_t *)"ABS:驱动桥右ABS电磁阀开路(798,5)",          (uint8_t *)"ABS:(798,5)"},     0}, //ABSKNORR
/* 276*/{0x0B,0xFFFFF,0xFF /*    798, 13 */, {(uint8_t *)"ABS:驱动桥右ABS电磁阀标定错误(798,13)",     (uint8_t *)"ABS:(798,13)"},    0}, //ABSKNORR
/* 277*/{0x0B,0xFFFFF,0xFF /*    798, 14 */, {(uint8_t *)"ABS:驱动桥右ABS电磁阀装配错误(798,14)",     (uint8_t *)"ABS:(798,14)"},    0}, //ABSKNORR
/* 278*/{0x0B,0xFFFFF,0xFF /*    799,  5 */, {(uint8_t *)"ABS:第三桥左ABS电磁阀或线路故障(799,5)",    (uint8_t *)"ABS:(799,5)"},     0}, //ABSKNORR
/* 279*/{0x0B,0xFFFFF,0xFF /*    799, 13 */, {(uint8_t *)"ABS:第三桥左ABS电磁阀标定错误(799,13)",     (uint8_t *)"ABS:(799,13)"},    0}, //ABSKNORR
/* 280*/{0x0B,0xFFFFF,0xFF /*    799, 14 */, {(uint8_t *)"ABS:第三桥左ABS电磁阀装配错误(799,14)",     (uint8_t *)"ABS:(799,14)"},    0}, //ABSKNORR
/* 281*/{0x0B,0xFFFFF,0xFF /*    800,  5 */, {(uint8_t *)"ABS:第三桥右ABS电磁阀或线路故障(800,5)",    (uint8_t *)"ABS:(800,5)"},     0}, //ABSKNORR
/* 282*/{0x0B,0xFFFFF,0xFF /*    800, 13 */, {(uint8_t *)"ABS:第三桥右ABS电磁阀标定错误(800,13)",     (uint8_t *)"ABS:(800,13)"},    0}, //ABSKNORR
/* 283*/{0x0B,0xFFFFF,0xFF /*    800, 14 */, {(uint8_t *)"ABS:第三桥右ABS电磁阀装配错误(800,14)",     (uint8_t *)"ABS:(800,14)"},    0}, //ABSKNORR
/* 284*/{0x0B,0xFFFFF,0xFF /*    801,  2 */, {(uint8_t *)"ABS:缓速器继电器开路(801,2)",               (uint8_t *)"ABS:(801,2)"},     0}, //ABSKNORR
/* 285*/{0x0B,0xFFFFF,0xFF /*    801,  3 */, {(uint8_t *)"ABS:缓速器继电器电压高(801,3)",             (uint8_t *)"ABS:(801,3)"},     0}, //ABSKNORR
/* 286*/{0x0B,0xFFFFF,0xFF /*    802,  3 */, {(uint8_t *)"ABS:电磁阀公共地电压高(802,3)",             (uint8_t *)"ABS:(802,3)"},     0}, //ABSKNORR
/* 287*/{0x0B,0xFFFFF,0xFF /*    802,  4 */, {(uint8_t *)"ABS:电磁阀公共地电压低(802,4)",             (uint8_t *)"ABS:(802,4)"},     0}, //ABSKNORR
/* 288*/{0x0B,0xFFFFF,0xFF /*    806,  3 */, {(uint8_t *)"ABS:驱动桥ASR电磁阀电压高(806,3)",          (uint8_t *)"ABS:(806,3)"},     0}, //ABSKNORR
/* 289*/{0x0B,0xFFFFF,0xFF /*    806,  4 */, {(uint8_t *)"ABS:驱动桥ASR电磁阀电压低(806,4)",          (uint8_t *)"ABS:(806,4)"},     0}, //ABSKNORR
/* 290*/{0x0B,0xFFFFF,0xFF /*    806,  5 */, {(uint8_t *)"ABS:驱动桥ASR电磁阀开路(806,5)",            (uint8_t *)"ABS:(806,5)"},     0}, //ABSKNORR
/* 291*/{0x0B,0xFFFFF,0xFF /*    806, 13 */, {(uint8_t *)"ABS:驱动桥ASR电磁阀标定错误(806,13)",       (uint8_t *)"ABS:(806,13)"},    0}, //ABSKNORR
/* 292*/{0x0B,0xFFFFF,0xFF /*    806, 14 */, {(uint8_t *)"ABS:驱动桥ASR电磁阀装配错误(806,14)",       (uint8_t *)"ABS:(806,14)"},    0}, //ABSKNORR
/* 293*/{0x0B,0xFFFFF,0xFF /*    807,  3 */, {(uint8_t *)"ABS:前桥ASR电磁阀电压高(807,3)",            (uint8_t *)"ABS:(807,3)"},     0}, //ABSKNORR
/* 294*/{0x0B,0xFFFFF,0xFF /*    807,  4 */, {(uint8_t *)"ABS:前桥ASR电磁阀电压低(807,4)",            (uint8_t *)"ABS:(807,4)"},     0}, //ABSKNORR
/* 295*/{0x0B,0xFFFFF,0xFF /*    807,  5 */, {(uint8_t *)"ABS:前桥ASR电磁阀开路(807,5)",              (uint8_t *)"ABS:(807,5)"},     0}, //ABSKNORR
/* 296*/{0x0B,0xFFFFF,0xFF /*    807, 13 */, {(uint8_t *)"ABS:前桥ASR电磁阀标定错误(807,13)",         (uint8_t *)"ABS:(807,13)"},    0}, //ABSKNORR
/* 297*/{0x0B,0xFFFFF,0xFF /*    807, 14 */, {(uint8_t *)"ABS:前桥ASR电磁阀装配错误(807,14)",         (uint8_t *)"ABS:(807,14)"},    0}, //ABSKNORR
/* 298*/{0x0B,0xFFFFF,0xFF /*    810,  7 */, {(uint8_t *)"ABS:轮速传感器左右装反(810,7)",             (uint8_t *)"ABS:(810,7)"},     0}, //ABSKNORR
/* 299*/{0x0B,0xFFFFF,0xFF /*    811,  2 */, {(uint8_t *)"ABS:ABS故障指示灯或线路故障(811,2)",        (uint8_t *)"ABS:(811,2)"},     0}, //ABSKNORR
/* 300*/{0x0B,0xFFFFF,0xFF /*    815, 13 */, {(uint8_t *)"ABS:第三桥轮速传感器标定错误(815,13)",      (uint8_t *)"ABS:(815,13)"},    0}, //ABSKNORR
/* 301*/{0x0B,0xFFFFF,0xFF /*    925,  3 */, {(uint8_t *)"ABS:备用输出2电压高(925,3)",                (uint8_t *)"ABS:(925,3)"},     0}, //ABSKNORR
/* 302*/{0x0B,0xFFFFF,0xFF /*    926,  3 */, {(uint8_t *)"ABS:备用输出3电压高(926,3)",                (uint8_t *)"ABS:(926,3)"},     0}, //ABSKNORR
/* 303*/{0x0B,0xFFFFF,0xFF /*    926,  4 */, {(uint8_t *)"ABS:备用输出3电压低(926,4)",                (uint8_t *)"ABS:(926,4)"},     0}, //ABSKNORR
/* 304*/{0x0B,0xFFFFF,0xFF /*    926,  5 */, {(uint8_t *)"ABS:备用输出3开路(926,5)",                  (uint8_t *)"ABS:(926,5)"},     0}, //ABSKNORR
/* 305*/{0x0B,0xFFFFF,0xFF /*    932,  3 */, {(uint8_t *)"ABS:前桥左进气电磁阀电压高(932,3)",         (uint8_t *)"ABS:(932,3)"},     0}, //ABSKNORR
/* 306*/{0x0B,0xFFFFF,0xFF /*    932,  4 */, {(uint8_t *)"ABS:前桥左进气电磁阀电压低(932,4)",         (uint8_t *)"ABS:(932,4)"},     0}, //ABSKNORR
/* 307*/{0x0B,0xFFFFF,0xFF /*    932,  5 */, {(uint8_t *)"ABS:前桥左进气电磁阀开路(932,5)",           (uint8_t *)"ABS:(932,5)"},     0}, //ABSKNORR
/* 308*/{0x0B,0xFFFFF,0xFF /*    933,  3 */, {(uint8_t *)"ABS:前桥右进气电磁阀电压高(933,3)",         (uint8_t *)"ABS:(933,3)"},     0}, //ABSKNORR
/* 309*/{0x0B,0xFFFFF,0xFF /*    933,  4 */, {(uint8_t *)"ABS:前桥右进气电磁阀电压低(933,4)",         (uint8_t *)"ABS:(933,4)"},     0}, //ABSKNORR
/* 310*/{0x0B,0xFFFFF,0xFF /*    933,  5 */, {(uint8_t *)"ABS:前桥右进气电磁阀开路(933,5)",           (uint8_t *)"ABS:(933,5)"},     0}, //ABSKNORR
/* 311*/{0x0B,0xFFFFF,0xFF /*    934,  3 */, {(uint8_t *)"ABS:驱动桥左进气电磁阀电压高(934,3)",       (uint8_t *)"ABS:(934,3)"},     0}, //ABSKNORR
/* 312*/{0x0B,0xFFFFF,0xFF /*    934,  4 */, {(uint8_t *)"ABS:驱动桥左进气电磁阀电压低(934,4)",       (uint8_t *)"ABS:(934,4)"},     0}, //ABSKNORR
/* 313*/{0x0B,0xFFFFF,0xFF /*    934,  5 */, {(uint8_t *)"ABS:驱动桥左进气电磁阀开路(934,5)",         (uint8_t *)"ABS:(934,5)"},     0}, //ABSKNORR
/* 314*/{0x0B,0xFFFFF,0xFF /*    935,  3 */, {(uint8_t *)"ABS:驱动桥右进气电磁阀电压高(935,3)",       (uint8_t *)"ABS:(935,3)"},     0}, //ABSKNORR
/* 315*/{0x0B,0xFFFFF,0xFF /*    935,  4 */, {(uint8_t *)"ABS:驱动桥右进气电磁阀电压低(935,4)",       (uint8_t *)"ABS:(935,4)"},     0}, //ABSKNORR
/* 316*/{0x0B,0xFFFFF,0xFF /*    935,  5 */, {(uint8_t *)"ABS:驱动桥右进气电磁阀开路(935,5)",         (uint8_t *)"ABS:(935,5)"},     0}, //ABSKNORR
/* 317*/{0x0B,0xFFFFF,0xFF /*    936,  3 */, {(uint8_t *)"ABS:第三桥左进气电磁阀电压高(936,3)",       (uint8_t *)"ABS:(936,3)"},     0}, //ABSKNORR
/* 318*/{0x0B,0xFFFFF,0xFF /*    936,  4 */, {(uint8_t *)"ABS:第三桥左进气电磁阀电压低(936,4)",       (uint8_t *)"ABS:(936,4)"},     0}, //ABSKNORR
/* 319*/{0x0B,0xFFFFF,0xFF /*    936,  5 */, {(uint8_t *)"ABS:第三桥左进气电磁阀开路(936,5)",         (uint8_t *)"ABS:(936,5)"},     0}, //ABSKNORR
/* 320*/{0x0B,0xFFFFF,0xFF /*    937,  3 */, {(uint8_t *)"ABS:第三桥右进气电磁阀电压高(937,3)",       (uint8_t *)"ABS:(937,3)"},     0}, //ABSKNORR
/* 321*/{0x0B,0xFFFFF,0xFF /*    937,  4 */, {(uint8_t *)"ABS:第三桥右进气电磁阀电压低(937,4)",       (uint8_t *)"ABS:(937,4)"},     0}, //ABSKNORR
/* 322*/{0x0B,0xFFFFF,0xFF /*    937,  5 */, {(uint8_t *)"ABS:第三桥右进气电磁阀开路(937,5)",         (uint8_t *)"ABS:(937,5)"},     0}, //ABSKNORR
/* 323*/{0x0B,0xFFFFF,0xFF /*    938,  3 */, {(uint8_t *)"ABS:前桥左排气电磁阀电压高(938,3)",         (uint8_t *)"ABS:(938,3)"},     0}, //ABSKNORR
/* 324*/{0x0B,0xFFFFF,0xFF /*    938,  4 */, {(uint8_t *)"ABS:前桥左排气电磁阀电压低(938,4)",         (uint8_t *)"ABS:(938,4)"},     0}, //ABSKNORR
/* 325*/{0x0B,0xFFFFF,0xFF /*    938,  5 */, {(uint8_t *)"ABS:前桥左排气电磁阀开路(938,5)",           (uint8_t *)"ABS:(938,5)"},     0}, //ABSKNORR
/* 326*/{0x0B,0xFFFFF,0xFF /*    939,  3 */, {(uint8_t *)"ABS:前桥右排气电磁阀电压高(939,3)",         (uint8_t *)"ABS:(939,3)"},     0}, //ABSKNORR
/* 327*/{0x0B,0xFFFFF,0xFF /*    939,  4 */, {(uint8_t *)"ABS:前桥右排气电磁阀电压低(939,4)",         (uint8_t *)"ABS:(939,4)"},     0}, //ABSKNORR
/* 328*/{0x0B,0xFFFFF,0xFF /*    939,  5 */, {(uint8_t *)"ABS:前桥右排气电磁阀开路(939,5)",           (uint8_t *)"ABS:(939,5)"},     0}, //ABSKNORR
/* 329*/{0x0B,0xFFFFF,0xFF /*    940,  3 */, {(uint8_t *)"ABS:驱动桥左排气电磁阀电压高(940,3)",       (uint8_t *)"ABS:(940,3)"},     0}, //ABSKNORR
/* 330*/{0x0B,0xFFFFF,0xFF /*    940,  4 */, {(uint8_t *)"ABS:驱动桥左排气电磁阀电压低(940,4)",       (uint8_t *)"ABS:(940,4)"},     0}, //ABSKNORR
/* 331*/{0x0B,0xFFFFF,0xFF /*    940,  5 */, {(uint8_t *)"ABS:驱动桥左排气电磁阀开路(940,5)",         (uint8_t *)"ABS:(940,5)"},     0}, //ABSKNORR
/* 332*/{0x0B,0xFFFFF,0xFF /*    941,  3 */, {(uint8_t *)"ABS:驱动桥右排气电磁阀电压高(941,3)",       (uint8_t *)"ABS:(941,3)"},     0}, //ABSKNORR
/* 333*/{0x0B,0xFFFFF,0xFF /*    941,  4 */, {(uint8_t *)"ABS:驱动桥右排气电磁阀电压低(941,4)",       (uint8_t *)"ABS:(941,4)"},     0}, //ABSKNORR
/* 334*/{0x0B,0xFFFFF,0xFF /*    941,  5 */, {(uint8_t *)"ABS:驱动桥右排气电磁阀开路(941,5)",         (uint8_t *)"ABS:(941,5)"},     0}, //ABSKNORR
/* 335*/{0x0B,0xFFFFF,0xFF /*    942,  3 */, {(uint8_t *)"ABS:第三桥左排气电磁阀电压高(942,3)",       (uint8_t *)"ABS:(942,3)"},     0}, //ABSKNORR
/* 336*/{0x0B,0xFFFFF,0xFF /*    942,  4 */, {(uint8_t *)"ABS:第三桥左排气电磁阀电压低(942,4)",       (uint8_t *)"ABS:(942,4)"},     0}, //ABSKNORR
/* 337*/{0x0B,0xFFFFF,0xFF /*    942,  5 */, {(uint8_t *)"ABS:第三桥左排气电磁阀开路(942,5)",         (uint8_t *)"ABS:(942,5)"},     0}, //ABSKNORR
/* 338*/{0x0B,0xFFFFF,0xFF /*    943,  3 */, {(uint8_t *)"ABS:第三桥右排气电磁阀电压高(943,3)",       (uint8_t *)"ABS:(943,3)"},     0}, //ABSKNORR
/* 339*/{0x0B,0xFFFFF,0xFF /*    943,  4 */, {(uint8_t *)"ABS:第三桥右排气电磁阀电压低(943,4)",       (uint8_t *)"ABS:(943,4)"},     0}, //ABSKNORR
/* 340*/{0x0B,0xFFFFF,0xFF /*    943,  5 */, {(uint8_t *)"ABS:第三桥右排气电磁阀开路(943,5)",         (uint8_t *)"ABS:(943,5)"},     0}, //ABSKNORR
/* 341*/{0x0B,0xFFFFF,0xFF /*   1045,  2 */, {(uint8_t *)"ABS:制动开关信号异常(1045,2)",              (uint8_t *)"ABS:(1045,2)"},    0}, //ABSKNORR
/* 342*/{0x0B,0xFFFFF,0xFF /*   1045,  7 */, {(uint8_t *)"ABS:制动开关或线路故障(1045,7)",            (uint8_t *)"ABS:(1045,7)"},    0}, //ABSKNORR
/* 343*/{0x0B,0xFFFFF,0xFF /*   1056,  3 */, {(uint8_t *)"ABS:挂车ABS电磁阀电压高(1056,3)",           (uint8_t *)"ABS:(1056,3)"},    0}, //ABSKNORR
/* 344*/{0x0B,0xFFFFF,0xFF /*   1056,  4 */, {(uint8_t *)"ABS:挂车ABS电磁阀电压低(1056,4)",           (uint8_t *)"ABS:(1056,4)"},    0}, //ABSKNORR
/* 345*/{0x0B,0xFFFFF,0xFF /*   1056,  5 */, {(uint8_t *)"ABS:挂车ABS电磁阀开路(1056,5)",             (uint8_t *)"ABS:(1056,5)"},    0}, //ABSKNORR
/* 346*/{0x0B,0xFFFFF,0xFF /*   1056, 11 */, {(uint8_t *)"ABS:挂车ABS电磁阀故障(1056,11)",            (uint8_t *)"ABS:(1056,11)"},   0}, //ABSKNORR
/* 347*/{0x0B,0xFFFFF,0xFF /*   1056, 13 */, {(uint8_t *)"ABS:挂车ABS电磁阀标定错误(1056,13)",        (uint8_t *)"ABS:(1056,13)"},   0}, //ABSKNORR
/* 348*/{0x0B,0xFFFFF,0xFF /*   1056, 14 */, {(uint8_t *)"ABS:挂车ABS电磁阀装配错误(1056,14)",        (uint8_t *)"ABS:(1056,14)"},   0}, //ABSKNORR
/* 349*/{0x0B,0xFFFFF,0xFF /*   1059,  2 */, {(uint8_t *)"ABS:轴荷压力传感器或线路故障(1059,2)",      (uint8_t *)"ABS:(1059,2)"},    0}, //ABSKNORR
/* 350*/{0x0B,0xFFFFF,0xFF /*   1066,  3 */, {(uint8_t *)"ABS:制动压力传感器1/2电压高(1066,3)",       (uint8_t *)"ABS:(1066,3)"},    0}, //ABSKNORR
/* 351*/{0x0B,0xFFFFF,0xFF /*   1066,  4 */, {(uint8_t *)"ABS:制动压力传感器1/2电压低(1066,4)",       (uint8_t *)"ABS:(1066,4)"},    0}, //ABSKNORR
/* 352*/{0x0B,0xFFFFF,0xFF /*   1066,  6 */, {(uint8_t *)"ABS:制动压力传感器1/2短路到地(1066,6)",     (uint8_t *)"ABS:(1066,6)"},    0}, //ABSKNORR
/* 353*/{0x0B,0xFFFFF,0xFF /*   1066, 11 */, {(uint8_t *)"ABS:制动压力传感器1/2信号异常(1066,11)",    (uint8_t *)"ABS:(1066,11)"},   0}, //ABSKNORR
/* 354*/{0x0B,   1066, 13, {(uint8_t *)"ABS:制动压力传感器1/2标定错误(1066,13)",    (uint8_t *)"ABS:(1066,13)"},   0}, //ABSKNORR
/* 355*/{0x0B,0xFFFFF,0xFF /*   1066, 14 */, {(uint8_t *)"ABS:制动压力传感器1/2标定错误(1066,14)",    (uint8_t *)"ABS:(1066,14)"},   0}, //ABSKNORR
/* 356*/{0x0B,0xFFFFF,0xFF /*   1067,  2 */, {(uint8_t *)"ABS:制动压力传感器1或线路故障(1067,2)",     (uint8_t *)"ABS:(1067,2)"},    0}, //ABSKNORR
/* 357*/{0x0B,0xFFFFF,0xFF /*   1068,  2 */, {(uint8_t *)"ABS:制动压力传感器2或线路故障(1068,2)",     (uint8_t *)"ABS:(1068,2)"},    0}, //ABSKNORR
/* 358*/{0x0B,0xFFFFF,0xFF /*   1671,  2 */, {(uint8_t *)"ABS:CAN通讯故障(1671,2)",                   (uint8_t *)"ABS:(1671,2)"},    0}, //ABSKNORR
/* 359*/{0x0B,0xFFFFF,0xFF /*   1807,  0 */, {(uint8_t *)"ABS:转向角度传感器信号过高(1807,0)",        (uint8_t *)"ABS:(1807,0)"},    0}, //ABSKNORR
/* 360*/{0x0B,0xFFFFF,0xFF /*   1807,  2 */, {(uint8_t *)"ABS:转向角度传感器信号异常(1807,2)",        (uint8_t *)"ABS:(1807,2)"},    0}, //ABSKNORR
/* 361*/{0x0B,0xFFFFF,0xFF /*   1807,  7 */, {(uint8_t *)"ABS:转向角度传感器故障(1807,7)",            (uint8_t *)"ABS:(1807,7)"},    0}, //ABSKNORR
/* 362*/{0x0B,0xFFFFF,0xFF /*   1807,  9 */, {(uint8_t *)"ABS:转向角度传感器CAN通讯故障(1807,9)",     (uint8_t *)"ABS:(1807,9)"},    0}, //ABSKNORR
/* 363*/{0x0B,0xFFFFF,0xFF /*   1807, 10 */, {(uint8_t *)"ABS:转向角度传感器信号异常(1807,10)",       (uint8_t *)"ABS:(1807,10)"},   0}, //ABSKNORR
/* 364*/{0x0B,0xFFFFF,0xFF /*   1807, 11 */, {(uint8_t *)"ABS:转向角度传感器或ABSECU故障(1807,11)",   (uint8_t *)"ABS:(1807,11)"},   0}, //ABSKNORR
/* 365*/{0x0B,0xFFFFF,0xFF /*   1807, 12 */, {(uint8_t *)"ABS:转向角度传感器故障(1807,12)",           (uint8_t *)"ABS:(1807,12)"},   0}, //ABSKNORR
/* 366*/{0x0B,   1807, 13, {(uint8_t *)"ABS:转向角度传感器标定错误(1807,13)",       (uint8_t *)"ABS:(1807,13)"},   0}, //ABSKNORR
/* 367*/{0x0B,0xFFFFF,0xFF /*   1807, 14 */, {(uint8_t *)"ABS:转向角度传感器故障(1807,14)",           (uint8_t *)"ABS:(1807,14)"},   0}, //ABSKNORR
/* 368*/{0x0B,0xFFFFF,0xFF /*   1808,  0 */, {(uint8_t *)"ABS:横摆角度传感器信号过高(1808,0)",        (uint8_t *)"ABS:(1808,0)"},    0}, //ABSKNORR
/* 369*/{0x0B,0xFFFFF,0xFF /*   1808,  2 */, {(uint8_t *)"ABS:横摆角度传感器信号异常(1808,2)",        (uint8_t *)"ABS:(1808,2)"},    0}, //ABSKNORR
/* 370*/{0x0B,0xFFFFF,0xFF /*   1808,  3 */, {(uint8_t *)"ABS:横摆角度传感器电压高(1808,3)",          (uint8_t *)"ABS:(1808,3)"},    0}, //ABSKNORR
/* 371*/{0x0B,0xFFFFF,0xFF /*   1808,  7 */, {(uint8_t *)"ABS:横摆角度传感器装配方向错误(1808,7)",    (uint8_t *)"ABS:(1808,7)"},    0}, //ABSKNORR
/* 372*/{0x0B,0xFFFFF,0xFF /*   1808,  8 */, {(uint8_t *)"ABS:横摆角度传感器信号异常(1808,8)",        (uint8_t *)"ABS:(1808,8)"},    0}, //ABSKNORR
/* 373*/{0x0B,0xFFFFF,0xFF /*   1808,  9 */, {(uint8_t *)"ABS:横摆角度传感器CAN通讯故障(1808,9)",     (uint8_t *)"ABS:(1808,9)"},    0}, //ABSKNORR
/* 374*/{0x0B,0xFFFFF,0xFF /*   1808, 10 */, {(uint8_t *)"ABS:横摆角度传感器信号异常(1808,10)",       (uint8_t *)"ABS:(1808,10)"},   0}, //ABSKNORR
/* 375*/{0x0B,0xFFFFF,0xFF /*   1808, 11 */, {(uint8_t *)"ABS:横摆角度传感器或ABSECU故障(1808,11)",   (uint8_t *)"ABS:(1808,11)"},   0}, //ABSKNORR
/* 376*/{0x0B,0xFFFFF,0xFF /*   1808, 12 */, {(uint8_t *)"ABS:横摆角度传感器故障(1808,12)",           (uint8_t *)"ABS:(1808,12)"},   0}, //ABSKNORR
/* 377*/{0x0B,   1808, 13, {(uint8_t *)"ABS:横摆角度传感器标定错误(1808,13)",       (uint8_t *)"ABS:(1808,13)"},   0}, //ABSKNORR
/* 378*/{0x0B,0xFFFFF,0xFF /*   1808, 14 */, {(uint8_t *)"ABS:横摆角度传感器故障(1808,14)",           (uint8_t *)"ABS:(1808,14)"},   0}, //ABSKNORR
/* 379*/{0x0B,0xFFFFF,0xFF /*   1809,  0 */, {(uint8_t *)"ABS:横向加速度传感器信号过高(1809,0)",      (uint8_t *)"ABS:(1809,0)"},    0}, //ABSKNORR
/* 380*/{0x0B,0xFFFFF,0xFF /*   1809,  2 */, {(uint8_t *)"ABS:横向加速度传感器装配方向错误(1809,2)",  (uint8_t *)"ABS:(1809,2)"},    0}, //ABSKNORR
/* 381*/{0x0B,0xFFFFF,0xFF /*   1809, 11 */, {(uint8_t *)"ABS:横向加速度传感器装配错误(1809,11)",     (uint8_t *)"ABS:(1809,11)"},   0}, //ABSKNORR
/* 382*/{0x0B,   1809, 13, {(uint8_t *)"ABS:横向加速度传感器标定错误(1809,13)",     (uint8_t *)"ABS:(1809,13)"},   0}, //ABSKNORR
/* 383*/{0x0B,0xFFFFF,0xFF /*   1809, 14 */, {(uint8_t *)"ABS:横向加速度传感器故障(1809,14)",         (uint8_t *)"ABS:(1809,14)"},   0}, //ABSKNORR
/* 384*/{0x0B,0xFFFFF,0xFF /* 520250, 14 */, {(uint8_t *)"ABS:压力控制阀超出使用寿命(520250,14)",     (uint8_t *)"ABS:(520250,14)"}, 0}, //ABSKNORR
/* 385*/{0x0B,0xFFFFF,0xFF /* 520251, 14 */, {(uint8_t *)"ABS:因阀使用过度使坡起功能无效(520251,14)", (uint8_t *)"ABS:(520251,14)"}, 0}, //ABSKNORR
/* 386*/{0x0B,0xFFFFF,0xFF /* 520563,  4 */, {(uint8_t *)"ABS:ESP传感器电压低(520563,4)",             (uint8_t *)"ABS:(520563,4)"},  0}, //ABSKNORR
/* 387*/{0x0B,0xFFFFF,0xFF /* 521010,  2 */, {(uint8_t *)"ABS:时间CAN信号异常(521010,2)",             (uint8_t *)"ABS:(521010,2)"},  0}, //ABSKNORR
/* 388*/{0x0B,0xFFFFF,0xFF /* 521011,  2 */, {(uint8_t *)"ABS:里程CAN信号异常(521011,2)",             (uint8_t *)"ABS:(521011,2)"},  0}, //ABSKNORR
/* 389*/{0x0B,0xFFFFF,0xFF /* 521012,  2 */, {(uint8_t *)"ABS:时间CAN报文超时(521012,2)",             (uint8_t *)"ABS:(521012,2)"},  0}, //ABSKNORR
/* 390*/{0x0B,0xFFFFF,0xFF /* 521014,  2 */, {(uint8_t *)"ABS:里程CAN报文超时(521014,2)",             (uint8_t *)"ABS:(521014,2)"},  0}, //ABSKNORR
/* 391*/{0x0B,0xFFFFF,0xFF /* 521016,  2 */, {(uint8_t *)"ABS:EAC1_SCHCAN报文超时(521016,2)",         (uint8_t *)"ABS:(521016,2)"},  0}, //ABSKNORR
/* 392*/{0x0B,0xFFFFF,0xFF /* 521017,  2 */, {(uint8_t *)"ABS:ASC1_CLCSCAN报文超时(521017,2)",        (uint8_t *)"ABS:(521017,2)"},  0}, //ABSKNORR
/* 393*/{0x0B,0xFFFFF,0xFF /* 521018,  2 */, {(uint8_t *)"ABS:VW_CLCSCAN报文超时(521018,2)",          (uint8_t *)"ABS:(521018,2)"},  0}, //ABSKNORR
/* 394*/{0x0B,0xFFFFF,0xFF /* 521019,  2 */, {(uint8_t *)"ABS:ETC1_TCUCAN报文超时(521019,2)",         (uint8_t *)"ABS:(521019,2)"},  0}, //ABSKNORR
/* 395*/{0x0B,0xFFFFF,0xFF /* 521020,  2 */, {(uint8_t *)"ABS:ETC2CAN报文超时(521020,2)",             (uint8_t *)"ABS:(521020,2)"},  0}, //ABSKNORR
/* 396*/{0x0B,0xFFFFF,0xFF /* 521021,  2 */, {(uint8_t *)"ABS:EEC1_CPC3CAN报文超时(521021,2)",        (uint8_t *)"ABS:(521021,2)"},  0}, //ABSKNORR
/* 397*/{0x0B,0xFFFFF,0xFF /* 521022,  2 */, {(uint8_t *)"ABS:EEC2_CPC3CAN报文超时(521022,2)",        (uint8_t *)"ABS:(521022,2)"},  0}, //ABSKNORR
/* 398*/{0x0B,0xFFFFF,0xFF /* 521023,  2 */, {(uint8_t *)"ABS:EEC3_CPC3CAN报文超时(521023,2)",        (uint8_t *)"ABS:(521023,2)"},  0}, //ABSKNORR
/* 399*/{0x0B,0xFFFFF,0xFF /* 521024,  2 */, {(uint8_t *)"ABS:ERC1_RETCAN报文超时(521024,2)",         (uint8_t *)"ABS:(521024,2)"},  0}, //ABSKNORR
/* 400*/{0x0B,0xFFFFF,0xFF /* 521025,  2 */, {(uint8_t *)"ABS:CCVS_CPCCAN报文超时(521025,2)",         (uint8_t *)"ABS:(521025,2)"},  0}, //ABSKNORR
/* 401*/{0x0B,0xFFFFF,0xFF /* 521026,  2 */, {(uint8_t *)"ABS:TCO1_TCOCAN报文超时(521026,2)",         (uint8_t *)"ABS:(521026,2)"},  0}, //ABSKNORR
/* 402*/{0x0B,0xFFFFF,0xFF /* 521027,  2 */, {(uint8_t *)"ABS:TD_TCOCAN报文超时(521027,2)",           (uint8_t *)"ABS:(521027,2)"},  0}, //ABSKNORR
/* 403*/{0x0B,0xFFFFF,0xFF /* 521028,  2 */, {(uint8_t *)"ABS:AIR1CAN报文超时(521028,2)",             (uint8_t *)"ABS:(521028,2)"},  0}, //ABSKNORR
/* 404*/{0x0B,0xFFFFF,0xFF /* 521029,  2 */, {(uint8_t *)"ABS:AUXIOCAN报文超时(521029,2)",            (uint8_t *)"ABS:(521029,2)"},  0}, //ABSKNORR
/* 405*/{0x0B,0xFFFFF,0xFF /* 521030,  2 */, {(uint8_t *)"ABS:XBRCAN报文超时(521030,2)",              (uint8_t *)"ABS:(521030,2)"},  0}, //ABSKNORR
/* 406*/{0x0B,0xFFFFF,0xFF /* 521031,  2 */, {(uint8_t *)"ABS:ETC7CAN报文超时(521031,2)",             (uint8_t *)"ABS:(521031,2)"},  0}, //ABSKNORR
/* 407*/{0x0B,0xFFFFF,0xFF /* 521032,  2 */, {(uint8_t *)"ABS:DC1CAN报文超时(521032,2)",              (uint8_t *)"ABS:(521032,2)"},  0}, //ABSKNORR
/* 408*/{0x0B,0xFFFFF,0xFF /*    628, 14 */, {(uint8_t *)"ABS:ECU内部故障(628,14)",                   (uint8_t *)"ABS:(628,14)"},    0}, //ABSKNORR
/* 409*/{0x0B,0xFFFFF,0xFF /*    639,  5 */, {(uint8_t *)"ABS:与整车通讯中断(639,5)",                 (uint8_t *)"ABS:(639,5)"},     0}, //ABSKNORR
/* 410*/{0x0B,0xFFFFF,0xFF /*    941,  7 */, {(uint8_t *)"ABS:右后轮电磁阀线束故障(941,7)",           (uint8_t *)"ABS:(941,7)"},     0}, //ABSKNORR
/* 411*/{0x0B,0xFFFFF,0xFF /*   1049,  2 */, {(uint8_t *)"ABS:前桥ESP气压传感器线束故障(1049,2)",     (uint8_t *)"ABS:(1049,2)"},    0}, //ABSKNORR
/* 412*/{0x0B,0xFFFFF,0xFF /*   1052,  2 */, {(uint8_t *)"ABS:后桥ESP气压传感器线束故障(1052,2)",     (uint8_t *)"ABS:(1052,2)"},    0}, //ABSKNORR
/* 413*/{0x0B,0xFFFFF,0xFF /*   1810,  2 */, {(uint8_t *)"ABS:横摆率传感器信号故障(1810,2)",          (uint8_t *)"ABS:(1810,2)"},    0}, //ABSKNORR
/* 414*/{0x0B,0xFFFFF,0xFF /*   1810, 11 */, {(uint8_t *)"ABS:横摆率传感器信号故障(1810,11)",         (uint8_t *)"ABS:(1810,11)"},   0}, //ABSKNORR
/* 415*/{0x0B,0xFFFFF,0xFF /*   1810, 14 */, {(uint8_t *)"ABS:横摆率传感器信号故障(1810,14)",         (uint8_t *)"ABS:(1810,14)"},   0}, //ABSKNORR
/* 416*/{0x0B,0xFFFFF,0xFF /*   2011, 31 */, {(uint8_t *)"ABS:CAN通讯故障(2011,31)",                  (uint8_t *)"ABS:(2011,31)"},   0}, //ABSKNORR
/* 417*/{0x0B,0xFFFFF,0xFF /*   3534,  7 */, {(uint8_t *)"ABS:前桥左制动控制故障(3534,7)",            (uint8_t *)"ABS:(3534,7)"},    0}, //ABSKNORR
/* 418*/{0x0B,0xFFFFF,0xFF /*   3535,  7 */, {(uint8_t *)"ABS:前桥右制动控制故障(3535,7)",            (uint8_t *)"ABS:(3535,7)"},    0}, //ABSKNORR
/* 419*/{0x0B,0xFFFFF,0xFF /*   3536,  7 */, {(uint8_t *)"ABS:后桥左制动控制故障(3536,7)",            (uint8_t *)"ABS:(3536,7)"},    0}, //ABSKNORR
/* 420*/{0x0B,0xFFFFF,0xFF /*   3537,  7 */, {(uint8_t *)"ABS:后桥右制动控制故障(3537,7)",            (uint8_t *)"ABS:(3537,7)"},    0}, //ABSKNORR
/* 421*/{0x0B,0xFFFFF,0xFF /*   3538,  7 */, {(uint8_t *)"ABS:第三桥左制动控制故障(3538,7)",          (uint8_t *)"ABS:(3538,7)"},    0}, //ABSKNORR
/* 422*/{0x0B,0xFFFFF,0xFF /*   3539,  7 */, {(uint8_t *)"ABS:第三桥右制动控制故障(3539,7)",          (uint8_t *)"ABS:(3539,7)"},    0}, //ABSKNORR

/* 423*/{0x0B,    260,  0, {(uint8_t *)"EBS:(260,0)",                  (uint8_t *)"EBS:(260,0)"},    0}, //EBSKNORR
/* 424*/{0x0B,    261,  0, {(uint8_t *)"EBS:(261,0)",                  (uint8_t *)"EBS:(261,0)"},    0}, //EBSKNORR
/* 425*/{0x0B,    262,  0, {(uint8_t *)"EBS:(262,0)",                  (uint8_t *)"EBS:(262,0)"},    0}, //EBSKNORR
/* 426*/{0x0B,    265,  0, {(uint8_t *)"EBS:(265,0)",                  (uint8_t *)"EBS:(265,0)"},    0}, //EBSKNORR
/* 427*/{0x0B,    273,  0, {(uint8_t *)"EBS:(273,0)",                  (uint8_t *)"EBS:(273,0)"},    0}, //EBSKNORR
/* 428*/{0x0B,    274,  0, {(uint8_t *)"EBS:(274,0)",                  (uint8_t *)"EBS:(274,0)"},    0}, //EBSKNORR
/* 429*/{0x0B,    412,  0, {(uint8_t *)"EBS:(412,0)",                  (uint8_t *)"EBS:(412,0)"},    0}, //EBSKNORR
/* 430*/{0x0B,    415,  0, {(uint8_t *)"EBS:(415,0)",                  (uint8_t *)"EBS:(415,0)"},    0}, //EBSKNORR
/* 431*/{0x0B,    420,  0, {(uint8_t *)"EBS:(420,0)",                  (uint8_t *)"EBS:(420,0)"},    0}, //EBSKNORR
/* 432*/{0x0B,    423,  0, {(uint8_t *)"EBS:(423,0)",                  (uint8_t *)"EBS:(423,0)"},    0}, //EBSKNORR
/* 433*/{0x0B,    424,  0, {(uint8_t *)"EBS:(424,0)",                  (uint8_t *)"EBS:(424,0)"},    0}, //EBSKNORR
/* 434*/{0x0B,    425,  0, {(uint8_t *)"EBS:(425,0)",                  (uint8_t *)"EBS:(425,0)"},    0}, //EBSKNORR
/* 435*/{0x0B,    517,  0, {(uint8_t *)"EBS:(517,0)",                  (uint8_t *)"EBS:(517,0)"},    0}, //EBSKNORR
/* 436*/{0x0B,    518,  0, {(uint8_t *)"EBS:(518,0)",                  (uint8_t *)"EBS:(518,0)"},    0}, //EBSKNORR
/* 437*/{0x0B,    521,  0, {(uint8_t *)"EBS:(521,0)",                  (uint8_t *)"EBS:(521,0)"},    0}, //EBSKNORR
/* 438*/{0x0B,    530,  0, {(uint8_t *)"EBS:(530,0)",                  (uint8_t *)"EBS:(530,0)"},    0}, //EBSKNORR
/* 439*/{0x0B,    567,  0, {(uint8_t *)"EBS:(567,0)",                  (uint8_t *)"EBS:(567,0)"},    0}, //EBSKNORR
/* 440*/{0x0B,    668,  0, {(uint8_t *)"EBS:(668,0)",                  (uint8_t *)"EBS:(668,0)"},    0}, //EBSKNORR
/* 441*/{0x0B,    671,  0, {(uint8_t *)"EBS:(671,0)",                  (uint8_t *)"EBS:(671,0)"},    0}, //EBSKNORR
/* 442*/{0x0B,    674,  0, {(uint8_t *)"EBS:(674,0)",                  (uint8_t *)"EBS:(674,0)"},    0}, //EBSKNORR
/* 443*/{0x0B,    675,  0, {(uint8_t *)"EBS:(675,0)",                  (uint8_t *)"EBS:(675,0)"},    0}, //EBSKNORR
/* 444*/{0x0B,    692,  0, {(uint8_t *)"EBS:(692,0)",                  (uint8_t *)"EBS:(692,0)"},    0}, //EBSKNORR
/* 445*/{0x0B,    693,  0, {(uint8_t *)"EBS:(693,0)",                  (uint8_t *)"EBS:(693,0)"},    0}, //EBSKNORR
/* 446*/{0x0B,    694,  0, {(uint8_t *)"EBS:(694,0)",                  (uint8_t *)"EBS:(694,0)"},    0}, //EBSKNORR
/* 447*/{0x0B,    695,  0, {(uint8_t *)"EBS:(695,0)",                  (uint8_t *)"EBS:(695,0)"},    0}, //EBSKNORR
/* 448*/{0x0B,    697,  0, {(uint8_t *)"EBS:(697,0)",                  (uint8_t *)"EBS:(697,0)"},    0}, //EBSKNORR
/* 449*/{0x0B,    698,  0, {(uint8_t *)"EBS:(698,0)",                  (uint8_t *)"EBS:(698,0)"},    0}, //EBSKNORR
/* 450*/{0x0B,    699,  0, {(uint8_t *)"EBS:(699,0)",                  (uint8_t *)"EBS:(699,0)"},    0}, //EBSKNORR
/* 451*/{0x0B,    700,  0, {(uint8_t *)"EBS:(700,0)",                  (uint8_t *)"EBS:(700,0)"},    0}, //EBSKNORR
/* 452*/{0x0B,    774,  0, {(uint8_t *)"EBS:(774,0)",                  (uint8_t *)"EBS:(774,0)"},    0}, //EBSKNORR
/* 453*/{0x0B,    927,  0, {(uint8_t *)"EBS:(927,0)",                  (uint8_t *)"EBS:(927,0)"},    0}, //EBSKNORR
/* 454*/{0x0B,    928,  0, {(uint8_t *)"EBS:(928,0)",                  (uint8_t *)"EBS:(928,0)"},    0}, //EBSKNORR
/* 455*/{0x0B,    929,  0, {(uint8_t *)"EBS:(929,0)",                  (uint8_t *)"EBS:(929,0)"},    0}, //EBSKNORR
/* 456*/{0x0B,    930,  0, {(uint8_t *)"EBS:(930,0)",                  (uint8_t *)"EBS:(930,0)"},    0}, //EBSKNORR
/* 457*/{0x0B,    933,  0, {(uint8_t *)"EBS:(933,0)",                  (uint8_t *)"EBS:(933,0)"},    0}, //EBSKNORR
/* 458*/{0x0B,    957,  0, {(uint8_t *)"EBS:(957,0)",                  (uint8_t *)"EBS:(957,0)"},    0}, //EBSKNORR
/* 459*/{0x0B,    958,  0, {(uint8_t *)"EBS:(958,0)",                  (uint8_t *)"EBS:(958,0)"},    0}, //EBSKNORR
/* 460*/{0x0B,    959,  0, {(uint8_t *)"EBS:(959,0)",                  (uint8_t *)"EBS:(959,0)"},    0}, //EBSKNORR
/* 461*/{0x0B,    960,  0, {(uint8_t *)"EBS:(960,0)",                  (uint8_t *)"EBS:(960,0)"},    0}, //EBSKNORR
/* 462*/{0x0B,    961,  0, {(uint8_t *)"EBS:(961,0)",                  (uint8_t *)"EBS:(961,0)"},    0}, //EBSKNORR
/* 463*/{0x0B,    962,  0, {(uint8_t *)"EBS:(962,0)",                  (uint8_t *)"EBS:(962,0)"},    0}, //EBSKNORR
/* 464*/{0x0B,   1038,  0, {(uint8_t *)"EBS:(1038,0)",                 (uint8_t *)"EBS:(1038,0)"},    0}, //EBSKNORR
/* 465*/{0x0B,   1041,  0, {(uint8_t *)"EBS:(1041,0)",                 (uint8_t *)"EBS:(1041,0)"},    0}, //EBSKNORR
/* 466*/{0x0B,   1042,  0, {(uint8_t *)"EBS:(1042,0)",                 (uint8_t *)"EBS:(1042,0)"},    0}, //EBSKNORR
/* 467*/{0x0B,   1294,  0, {(uint8_t *)"EBS:(1294,0)",                 (uint8_t *)"EBS:(1294,0)"},    0}, //EBSKNORR
/* 468*/{0x0B,   1297,  0, {(uint8_t *)"EBS:(1297,0)",                 (uint8_t *)"EBS:(1297,0)"},    0}, //EBSKNORR
/* 469*/{0x0B,   1298,  0, {(uint8_t *)"EBS:(1298,0)",                 (uint8_t *)"EBS:(1298,0)"},    0}, //EBSKNORR
/* 470*/{0x0B,   1537,  0, {(uint8_t *)"EBS:(1537,0)",                 (uint8_t *)"EBS:(1537,0)"},    0}, //EBSKNORR
/* 471*/{0x0B,   1626,  0, {(uint8_t *)"EBS:(1626,0)",                 (uint8_t *)"EBS:(1626,0)"},    0}, //EBSKNORR
/* 472*/{0x0B,   1627,  0, {(uint8_t *)"EBS:(1627,0)",                 (uint8_t *)"EBS:(1627,0)"},    0}, //EBSKNORR
/* 473*/{0x0B,   1628,  0, {(uint8_t *)"EBS:(1628,0)",                 (uint8_t *)"EBS:(1628,0)"},    0}, //EBSKNORR
/* 474*/{0x0B,   1630,  0, {(uint8_t *)"EBS:(1630,0)",                 (uint8_t *)"EBS:(1630,0)"},    0}, //EBSKNORR
/* 475*/{0x0B,   1631,  0, {(uint8_t *)"EBS:(1631,0)",                 (uint8_t *)"EBS:(1631,0)"},    0}, //EBSKNORR
/* 476*/{0x0B,   1634,  0, {(uint8_t *)"EBS:(1634,0)",                 (uint8_t *)"EBS:(1634,0)"},    0}, //EBSKNORR
/* 477*/{0x0B,   1636,  0, {(uint8_t *)"EBS:(1636,0)",                 (uint8_t *)"EBS:(1636,0)"},    0}, //EBSKNORR
/* 478*/{0x0B,   1637,  0, {(uint8_t *)"EBS:(1637,0)",                 (uint8_t *)"EBS:(1637,0)"},    0}, //EBSKNORR
/* 479*/{0x0B,   1638,  0, {(uint8_t *)"EBS:(1638,0)",                 (uint8_t *)"EBS:(1638,0)"},    0}, //EBSKNORR
/* 480*/{0x0B,   1639,  0, {(uint8_t *)"EBS:(1639,0)",                 (uint8_t *)"EBS:(1639,0)"},    0}, //EBSKNORR
/* 481*/{0x0B,   1645,  0, {(uint8_t *)"EBS:(1645,0)",                 (uint8_t *)"EBS:(1645,0)"},    0}, //EBSKNORR
/* 482*/{0x0B,   1646,  0, {(uint8_t *)"EBS:(1646,0)",                 (uint8_t *)"EBS:(1646,0)"},    0}, //EBSKNORR
/* 483*/{0x0B,   1647,  0, {(uint8_t *)"EBS:(1647,0)",                 (uint8_t *)"EBS:(1647,0)"},    0}, //EBSKNORR
/* 484*/{0x0B,   1656,  0, {(uint8_t *)"EBS:(1656,0)",                 (uint8_t *)"EBS:(1656,0)"},    0}, //EBSKNORR
/* 485*/{0x0B,   1657,  0, {(uint8_t *)"EBS:(1657,0)",                 (uint8_t *)"EBS:(1657,0)"},    0}, //EBSKNORR
/* 486*/{0x0B,   1658,  0, {(uint8_t *)"EBS:(1658,0)",                 (uint8_t *)"EBS:(1658,0)"},    0}, //EBSKNORR
/* 487*/{0x0B,   1660,  0, {(uint8_t *)"EBS:(1660,0)",                 (uint8_t *)"EBS:(1660,0)"},    0}, //EBSKNORR
/* 488*/{0x0B,   1661,  0, {(uint8_t *)"EBS:(1661,0)",                 (uint8_t *)"EBS:(1661,0)"},    0}, //EBSKNORR
/* 489*/{0x0B,   1664,  0, {(uint8_t *)"EBS:(1664,0)",                 (uint8_t *)"EBS:(1664,0)"},    0}, //EBSKNORR
/* 490*/{0x0B,   1666,  0, {(uint8_t *)"EBS:(1666,0)",                 (uint8_t *)"EBS:(1666,0)"},    0}, //EBSKNORR
/* 491*/{0x0B,   1667,  0, {(uint8_t *)"EBS:(1667,0)",                 (uint8_t *)"EBS:(1667,0)"},    0}, //EBSKNORR
/* 492*/{0x0B,   1668,  0, {(uint8_t *)"EBS:(1668,0)",                 (uint8_t *)"EBS:(1668,0)"},    0}, //EBSKNORR
/* 493*/{0x0B,   1669,  0, {(uint8_t *)"EBS:(1669,0)",                 (uint8_t *)"EBS:(1669,0)"},    0}, //EBSKNORR
/* 494*/{0x0B,   1675,  0, {(uint8_t *)"EBS:(1675,0)",                 (uint8_t *)"EBS:(1675,0)"},    0}, //EBSKNORR
/* 495*/{0x0B,   1676,  0, {(uint8_t *)"EBS:(1676,0)",                 (uint8_t *)"EBS:(1676,0)"},    0}, //EBSKNORR
/* 496*/{0x0B,   1678,  0, {(uint8_t *)"EBS:(1678,0)",                 (uint8_t *)"EBS:(1678,0)"},    0}, //EBSKNORR
/* 497*/{0x0B,   1680,  0, {(uint8_t *)"EBS:(1680,0)",                 (uint8_t *)"EBS:(1680,0)"},    0}, //EBSKNORR
/* 498*/{0x0B,   1806,  0, {(uint8_t *)"EBS:(1806,0)",                 (uint8_t *)"EBS:(1806,0)"},    0}, //EBSKNORR
/* 499*/{0x0B,   1811,  0, {(uint8_t *)"EBS:(1811,0)",                 (uint8_t *)"EBS:(1811,0)"},    0}, //EBSKNORR
/* 500*/{0x0B,   1851,  0, {(uint8_t *)"EBS:(1851,0)",                 (uint8_t *)"EBS:(1851,0)"},    0}, //EBSKNORR
/* 501*/{0x0B,   2573,  0, {(uint8_t *)"EBS:(2573,0)",                 (uint8_t *)"EBS:(2573,0)"},    0}, //EBSKNORR
/* 502*/{0x0B,   3161,  0, {(uint8_t *)"EBS:(3161,0)",                 (uint8_t *)"EBS:(3161,0)"},    0}, //EBSKNORR
/* 503*/{0x0B,   3586,  0, {(uint8_t *)"EBS:(3586,0)",                 (uint8_t *)"EBS:(3586,0)"},    0}, //EBSKNORR
/* 504*/{0x0B,   3594,  0, {(uint8_t *)"EBS:(3594,0)",                 (uint8_t *)"EBS:(3594,0)"},    0}, //EBSKNORR
/* 505*/{0x0B,   3597,  0, {(uint8_t *)"EBS:(3597,0)",                 (uint8_t *)"EBS:(3597,0)"},    0}, //EBSKNORR
/* 506*/{0x0B,   3598,  0, {(uint8_t *)"EBS:(3598,0)",                 (uint8_t *)"EBS:(3598,0)"},    0}, //EBSKNORR
/* 507*/{0x0B,   3853,  0, {(uint8_t *)"EBS:(3853,0)",                 (uint8_t *)"EBS:(3853,0)"},    0}, //EBSKNORR
/* 508*/{0x0B,   4953,  0, {(uint8_t *)"EBS:(4953,0)",                 (uint8_t *)"EBS:(4953,0)"},    0}, //EBSKNORR
/* 509*/{0x0B,   7968,  0, {(uint8_t *)"EBS:(7968,0)",                 (uint8_t *)"EBS:(7968,0)"},    0}, //EBSKNORR
/* 510*/{0x0B,   8224,  0, {(uint8_t *)"EBS:(8224,0)",                 (uint8_t *)"EBS:(8224,0)"},    0}, //EBSKNORR
/* 511*/{0x0B,   8480,  0, {(uint8_t *)"EBS:(8480,0)",                 (uint8_t *)"EBS:(8480,0)"},    0}, //EBSKNORR
/* 512*/{0x0B,   8736,  0, {(uint8_t *)"EBS:(8736,0)",                 (uint8_t *)"EBS:(8736,0)"},    0}, //EBSKNORR
/* 513*/{0x0B,   8992,  0, {(uint8_t *)"EBS:(8992,0)",                 (uint8_t *)"EBS:(8992,0)"},    0}, //EBSKNORR
/* 514*/{0x0B,   9216,  0, {(uint8_t *)"EBS:(9216,0)",                 (uint8_t *)"EBS:(9216,0)"},    0}, //EBSKNORR
/* 515*/{0x0B,  13056,  0, {(uint8_t *)"EBS:(13056,0)",                (uint8_t *)"EBS:(13056,0)"},    0}, //EBSKNORR
/* 516*/{0x0B,  13312,  0, {(uint8_t *)"EBS:(13312,0)",                (uint8_t *)"EBS:(13312,0)"},    0}, //EBSKNORR
/* 517*/{0x0B,  14614,  0, {(uint8_t *)"EBS:(14614,0)",                (uint8_t *)"EBS:(14614,0)"},    0}, //EBSKNORR
/* 518*/{0x0B,  15386,  0, {(uint8_t *)"EBS:(15386,0)",                (uint8_t *)"EBS:(15386,0)"},    0}, //EBSKNORR
/* 519*/{0x0B,  15395,  0, {(uint8_t *)"EBS:(15395,0)",                (uint8_t *)"EBS:(15395,0)"},    0}, //EBSKNORR
/* 520*/{0x0B,  15410,  0, {(uint8_t *)"EBS:(15410,0)",                (uint8_t *)"EBS:(15410,0)"},    0}, //EBSKNORR
/* 521*/{0x0B,  15638,  0, {(uint8_t *)"EBS:(15638,0)",                (uint8_t *)"EBS:(15638,0)"},    0}, //EBSKNORR
/* 522*/{0x0B,  15639,  0, {(uint8_t *)"EBS:(15639,0)",                (uint8_t *)"EBS:(15639,0)"},    0}, //EBSKNORR
/* 523*/{0x0B,  15894,  0, {(uint8_t *)"EBS:(15894,0)",                (uint8_t *)"EBS:(15894,0)"},    0}, //EBSKNORR
/* 524*/{0x0B,  15895,  0, {(uint8_t *)"EBS:(15895,0)",                (uint8_t *)"EBS:(15895,0)"},    0}, //EBSKNORR
/* 525*/{0x0B,  16660,  0, {(uint8_t *)"EBS:(16660,0)",                (uint8_t *)"EBS:(16660,0)"},    0}, //EBSKNORR
/* 526*/{0x0B,  16661,  0, {(uint8_t *)"EBS:(16661,0)",                (uint8_t *)"EBS:(16661,0)"},    0}, //EBSKNORR
/* 527*/{0x0B,  17153,  0, {(uint8_t *)"EBS:(17153,0)",                (uint8_t *)"EBS:(17153,0)"},    0}, //EBSKNORR
/* 528*/{0x0B,  18432,  0, {(uint8_t *)"EBS:(18432,0)",                (uint8_t *)"EBS:(18432,0)"},    0}, //EBSKNORR
/* 529*/{0x0B,  18588,  0, {(uint8_t *)"EBS:(18588,0)",                (uint8_t *)"EBS:(18588,0)"},    0}, //EBSKNORR
/* 530*/{0x0B,  18589,  0, {(uint8_t *)"EBS:(18589,0)",                (uint8_t *)"EBS:(18589,0)"},    0}, //EBSKNORR
/* 531*/{0x0B,  18592,  0, {(uint8_t *)"EBS:(18592,0)",                (uint8_t *)"EBS:(18592,0)"},    0}, //EBSKNORR
/* 532*/{0x0B,  18689,  0, {(uint8_t *)"EBS:(18689,0)",                (uint8_t *)"EBS:(18689,0)"},    0}, //EBSKNORR
/* 533*/{0x0B,  18738,  0, {(uint8_t *)"EBS:(18738,0)",                (uint8_t *)"EBS:(18738,0)"},    0}, //EBSKNORR
/* 534*/{0x0B,  24576,  0, {(uint8_t *)"EBS:(24576,0)",                (uint8_t *)"EBS:(24576,0)"},    0}, //EBSKNORR
/* 535*/{0x0B,  25088,  0, {(uint8_t *)"EBS:(25088,0)",                (uint8_t *)"EBS:(25088,0)"},    0}, //EBSKNORR
/* 536*/{0x0B,  25600,  0, {(uint8_t *)"EBS:(25600,0)",                (uint8_t *)"EBS:(25600,0)"},    0}, //EBSKNORR
/* 537*/{0x0B,  25856,  0, {(uint8_t *)"EBS:(25856,0)",                (uint8_t *)"EBS:(25856,0)"},    0}, //EBSKNORR
/* 538*/{0x0B,  26112,  0, {(uint8_t *)"EBS:(26112,0)",                (uint8_t *)"EBS:(26112,0)"},    0}, //EBSKNORR
/* 539*/{0x0B,  26368,  0, {(uint8_t *)"EBS:(26368,0)",                (uint8_t *)"EBS:(26368,0)"},    0}, //EBSKNORR
/* 540*/{0x0B,  26624,  0, {(uint8_t *)"EBS:(26624,0)",                (uint8_t *)"EBS:(26624,0)"},    0}, //EBSKNORR
/* 541*/{0x0B,  26880,  0, {(uint8_t *)"EBS:(26880,0)",                (uint8_t *)"EBS:(26880,0)"},    0}, //EBSKNORR
/* 542*/{0x0B,  27136,  0, {(uint8_t *)"EBS:(27136,0)",                (uint8_t *)"EBS:(27136,0)"},    0}, //EBSKNORR
/* 543*/{0x0B,  27392,  0, {(uint8_t *)"EBS:(27392,0)",                (uint8_t *)"EBS:(27392,0)"},    0}, //EBSKNORR
/* 544*/{0x0B,  27648,  0, {(uint8_t *)"EBS:(27648,0)",                (uint8_t *)"EBS:(27648,0)"},    0}, //EBSKNORR
/* 545*/{0x0B,  27904,  0, {(uint8_t *)"EBS:(27904,0)",                (uint8_t *)"EBS:(27904,0)"},    0}, //EBSKNORR
/* 546*/{0x0B,  25645,  0, {(uint8_t *)"EBS:(25645,0)",                (uint8_t *)"EBS:(25645,0)"},    0}, //EBSKNORR
/* 547*/{0x0B,  25901,  0, {(uint8_t *)"EBS:(25901,0)",                (uint8_t *)"EBS:(25901,0)"},    0}, //EBSKNORR
/* 548*/{0x0B,  26157,  0, {(uint8_t *)"EBS:(26157,0)",                (uint8_t *)"EBS:(26157,0)"},    0}, //EBSKNORR
/* 549*/{0x0B,  26413,  0, {(uint8_t *)"EBS:(26413,0)",                (uint8_t *)"EBS:(26413,0)"},    0}, //EBSKNORR
/* 550*/{0x0B,  26669,  0, {(uint8_t *)"EBS:(26669,0)",                (uint8_t *)"EBS:(26669,0)"},    0}, //EBSKNORR
/* 551*/{0x0B,  26925,  0, {(uint8_t *)"EBS:(26925,0)",                (uint8_t *)"EBS:(26925,0)"},    0}, //EBSKNORR
/* 552*/{0x0B,  27181,  0, {(uint8_t *)"EBS:(27181,0)",                (uint8_t *)"EBS:(27181,0)"},    0}, //EBSKNORR
/* 553*/{0x0B,  27437,  0, {(uint8_t *)"EBS:(27437,0)",                (uint8_t *)"EBS:(27437,0)"},    0}, //EBSKNORR
/* 554*/{0x0B,  27693,  0, {(uint8_t *)"EBS:(27693,0)",                (uint8_t *)"EBS:(27693,0)"},    0}, //EBSKNORR
/* 555*/{0x0B,  27949,  0, {(uint8_t *)"EBS:(27949,0)",                (uint8_t *)"EBS:(27949,0)"},    0}, //EBSKNORR
/* 556*/{0x0B,  33283,  0, {(uint8_t *)"EBS:(33283,0)",                (uint8_t *)"EBS:(33283,0)"},    0}, //EBSKNORR
/* 557*/{0x0B,  33539,  0, {(uint8_t *)"EBS:(33539,0)",                (uint8_t *)"EBS:(33539,0)"},    0}, //EBSKNORR
/* 558*/{0x0B,  33795,  0, {(uint8_t *)"EBS:(33795,0)",                (uint8_t *)"EBS:(33795,0)"},    0}, //EBSKNORR
/* 559*/{0x0B,  34051,  0, {(uint8_t *)"EBS:(34051,0)",                (uint8_t *)"EBS:(34051,0)"},    0}, //EBSKNORR
/* 560*/{0x0B,  34307,  0, {(uint8_t *)"EBS:(34307,0)",                (uint8_t *)"EBS:(34307,0)"},    0}, //EBSKNORR
/* 561*/{0x0B,  34563,  0, {(uint8_t *)"EBS:(34563,0)",                (uint8_t *)"EBS:(34563,0)"},    0}, //EBSKNORR
/* 562*/{0x0B,  34819,  0, {(uint8_t *)"EBS:(34819,0)",                (uint8_t *)"EBS:(34819,0)"},    0}, //EBSKNORR
/* 563*/{0x0B,  35075,  0, {(uint8_t *)"EBS:(35075,0)",                (uint8_t *)"EBS:(35075,0)"},    0}, //EBSKNORR
/* 564*/{0x0B,  35331,  0, {(uint8_t *)"EBS:(35331,0)",                (uint8_t *)"EBS:(35331,0)"},    0}, //EBSKNORR
/* 565*/{0x0B,  35587,  0, {(uint8_t *)"EBS:(35587,0)",                (uint8_t *)"EBS:(35587,0)"},    0}, //EBSKNORR
/* 566*/{0x0B,  33287,  0, {(uint8_t *)"EBS:(33287,0)",                (uint8_t *)"EBS:(33287,0)"},    0}, //EBSKNORR
/* 567*/{0x0B,  33543,  0, {(uint8_t *)"EBS:(33543,0)",                (uint8_t *)"EBS:(33543,0)"},    0}, //EBSKNORR
/* 568*/{0x0B,  33799,  0, {(uint8_t *)"EBS:(33799,0)",                (uint8_t *)"EBS:(33799,0)"},    0}, //EBSKNORR
/* 569*/{0x0B,  34055,  0, {(uint8_t *)"EBS:(34055,0)",                (uint8_t *)"EBS:(34055,0)"},    0}, //EBSKNORR
/* 570*/{0x0B,  34311,  0, {(uint8_t *)"EBS:(34311,0)",                (uint8_t *)"EBS:(34311,0)"},    0}, //EBSKNORR
/* 571*/{0x0B,  34567,  0, {(uint8_t *)"EBS:(34567,0)",                (uint8_t *)"EBS:(34567,0)"},    0}, //EBSKNORR
/* 572*/{0x0B,  34823,  0, {(uint8_t *)"EBS:(34823,0)",                (uint8_t *)"EBS:(34823,0)"},    0}, //EBSKNORR
/* 573*/{0x0B,  35079,  0, {(uint8_t *)"EBS:(35079,0)",                (uint8_t *)"EBS:(35079,0)"},    0}, //EBSKNORR
/* 574*/{0x0B,  35335,  0, {(uint8_t *)"EBS:(35335,0)",                (uint8_t *)"EBS:(35335,0)"},    0}, //EBSKNORR
/* 575*/{0x0B,  35591,  0, {(uint8_t *)"EBS:(35591,0)",                (uint8_t *)"EBS:(35591,0)"},    0}, //EBSKNORR
/* 576*/{0x0B,  33289,  0, {(uint8_t *)"EBS:(33289,0)",                (uint8_t *)"EBS:(33289,0)"},    0}, //EBSKNORR
/* 577*/{0x0B,  33545,  0, {(uint8_t *)"EBS:(33545,0)",                (uint8_t *)"EBS:(33545,0)"},    0}, //EBSKNORR
/* 578*/{0x0B,  33801,  0, {(uint8_t *)"EBS:(33801,0)",                (uint8_t *)"EBS:(33801,0)"},    0}, //EBSKNORR
/* 579*/{0x0B,  34057,  0, {(uint8_t *)"EBS:(34057,0)",                (uint8_t *)"EBS:(34057,0)"},    0}, //EBSKNORR
/* 580*/{0x0B,  34313,  0, {(uint8_t *)"EBS:(34313,0)",                (uint8_t *)"EBS:(34313,0)"},    0}, //EBSKNORR
/* 581*/{0x0B,  34569,  0, {(uint8_t *)"EBS:(34569,0)",                (uint8_t *)"EBS:(34569,0)"},    0}, //EBSKNORR
/* 582*/{0x0B,  34825,  0, {(uint8_t *)"EBS:(34825,0)",                (uint8_t *)"EBS:(34825,0)"},    0}, //EBSKNORR
/* 583*/{0x0B,  35081,  0, {(uint8_t *)"EBS:(35081,0)",                (uint8_t *)"EBS:(35081,0)"},    0}, //EBSKNORR
/* 584*/{0x0B,  35337,  0, {(uint8_t *)"EBS:(35337,0)",                (uint8_t *)"EBS:(35337,0)"},    0}, //EBSKNORR
/* 585*/{0x0B,  35593,  0, {(uint8_t *)"EBS:(35593,0)",                (uint8_t *)"EBS:(35593,0)"},    0}, //EBSKNORR
/* 586*/{0x0B,  33325,  0, {(uint8_t *)"EBS:(33325,0)",                (uint8_t *)"EBS:(33325,0)"},    0}, //EBSKNORR
/* 587*/{0x0B,  33581,  0, {(uint8_t *)"EBS:(33581,0)",                (uint8_t *)"EBS:(33581,0)"},    0}, //EBSKNORR
/* 588*/{0x0B,  33837,  0, {(uint8_t *)"EBS:(33837,0)",                (uint8_t *)"EBS:(33837,0)"},    0}, //EBSKNORR
/* 589*/{0x0B,  34093,  0, {(uint8_t *)"EBS:(34093,0)",                (uint8_t *)"EBS:(34093,0)"},    0}, //EBSKNORR
/* 590*/{0x0B,  34349,  0, {(uint8_t *)"EBS:(34349,0)",                (uint8_t *)"EBS:(34349,0)"},    0}, //EBSKNORR
/* 591*/{0x0B,  34605,  0, {(uint8_t *)"EBS:(34605,0)",                (uint8_t *)"EBS:(34605,0)"},    0}, //EBSKNORR
/* 592*/{0x0B,  34861,  0, {(uint8_t *)"EBS:(34861,0)",                (uint8_t *)"EBS:(34861,0)"},    0}, //EBSKNORR
/* 593*/{0x0B,  35117,  0, {(uint8_t *)"EBS:(35117,0)",                (uint8_t *)"EBS:(35117,0)"},    0}, //EBSKNORR
/* 594*/{0x0B,  35373,  0, {(uint8_t *)"EBS:(35373,0)",                (uint8_t *)"EBS:(35373,0)"},    0}, //EBSKNORR
/* 595*/{0x0B,  35629,  0, {(uint8_t *)"EBS:(35629,0)",                (uint8_t *)"EBS:(35629,0)"},    0}, //EBSKNORR
/* 596*/{0x0B,  33430,  0, {(uint8_t *)"EBS:(33430,0)",                (uint8_t *)"EBS:(33430,0)"},    0}, //EBSKNORR
/* 597*/{0x0B,  33686,  0, {(uint8_t *)"EBS:(33686,0)",                (uint8_t *)"EBS:(33686,0)"},    0}, //EBSKNORR
/* 598*/{0x0B,  33942,  0, {(uint8_t *)"EBS:(33942,0)",                (uint8_t *)"EBS:(33942,0)"},    0}, //EBSKNORR
/* 599*/{0x0B,  34198,  0, {(uint8_t *)"EBS:(34198,0)",                (uint8_t *)"EBS:(34198,0)"},    0}, //EBSKNORR
/* 600*/{0x0B,  34454,  0, {(uint8_t *)"EBS:(34454,0)",                (uint8_t *)"EBS:(34454,0)"},    0}, //EBSKNORR
/* 601*/{0x0B,  34710,  0, {(uint8_t *)"EBS:(34710,0)",                (uint8_t *)"EBS:(34710,0)"},    0}, //EBSKNORR
/* 602*/{0x0B,  34966,  0, {(uint8_t *)"EBS:(34966,0)",                (uint8_t *)"EBS:(34966,0)"},    0}, //EBSKNORR
/* 603*/{0x0B,  35222,  0, {(uint8_t *)"EBS:(35222,0)",                (uint8_t *)"EBS:(35222,0)"},    0}, //EBSKNORR
/* 604*/{0x0B,  35478,  0, {(uint8_t *)"EBS:(35478,0)",                (uint8_t *)"EBS:(35478,0)"},    0}, //EBSKNORR
/* 605*/{0x0B,  35734,  0, {(uint8_t *)"EBS:(35734,0)",                (uint8_t *)"EBS:(35734,0)"},    0}, //EBSKNORR
/* 606*/{0x0B,  33431,  0, {(uint8_t *)"EBS:(33431,0)",                (uint8_t *)"EBS:(33431,0)"},    0}, //EBSKNORR
/* 607*/{0x0B,  33687,  0, {(uint8_t *)"EBS:(33687,0)",                (uint8_t *)"EBS:(33687,0)"},    0}, //EBSKNORR
/* 608*/{0x0B,  33943,  0, {(uint8_t *)"EBS:(33943,0)",                (uint8_t *)"EBS:(33943,0)"},    0}, //EBSKNORR
/* 609*/{0x0B,  34199,  0, {(uint8_t *)"EBS:(34199,0)",                (uint8_t *)"EBS:(34199,0)"},    0}, //EBSKNORR
/* 610*/{0x0B,  34455,  0, {(uint8_t *)"EBS:(34455,0)",                (uint8_t *)"EBS:(34455,0)"},    0}, //EBSKNORR
/* 611*/{0x0B,  34711,  0, {(uint8_t *)"EBS:(34711,0)",                (uint8_t *)"EBS:(34711,0)"},    0}, //EBSKNORR
/* 612*/{0x0B,  34967,  0, {(uint8_t *)"EBS:(34967,0)",                (uint8_t *)"EBS:(34967,0)"},    0}, //EBSKNORR
/* 613*/{0x0B,  35223,  0, {(uint8_t *)"EBS:(35223,0)",                (uint8_t *)"EBS:(35223,0)"},    0}, //EBSKNORR
/* 614*/{0x0B,  35479,  0, {(uint8_t *)"EBS:(35479,0)",                (uint8_t *)"EBS:(35479,0)"},    0}, //EBSKNORR
/* 615*/{0x0B,  35735,  0, {(uint8_t *)"EBS:(35735,0)",                (uint8_t *)"EBS:(35735,0)"},    0}, //EBSKNORR
/* 616*/{0x0B,  33436,  0, {(uint8_t *)"EBS:(33436,0)",                (uint8_t *)"EBS:(33436,0)"},    0}, //EBSKNORR
/* 617*/{0x0B,  33692,  0, {(uint8_t *)"EBS:(33692,0)",                (uint8_t *)"EBS:(33692,0)"},    0}, //EBSKNORR
/* 618*/{0x0B,  33948,  0, {(uint8_t *)"EBS:(33948,0)",                (uint8_t *)"EBS:(33948,0)"},    0}, //EBSKNORR
/* 619*/{0x0B,  34204,  0, {(uint8_t *)"EBS:(34204,0)",                (uint8_t *)"EBS:(34204,0)"},    0}, //EBSKNORR
/* 620*/{0x0B,  34460,  0, {(uint8_t *)"EBS:(34460,0)",                (uint8_t *)"EBS:(34460,0)"},    0}, //EBSKNORR
/* 621*/{0x0B,  34716,  0, {(uint8_t *)"EBS:(34716,0)",                (uint8_t *)"EBS:(34716,0)"},    0}, //EBSKNORR
/* 622*/{0x0B,  34972,  0, {(uint8_t *)"EBS:(34972,0)",                (uint8_t *)"EBS:(34972,0)"},    0}, //EBSKNORR
/* 623*/{0x0B,  35228,  0, {(uint8_t *)"EBS:(35228,0)",                (uint8_t *)"EBS:(35228,0)"},    0}, //EBSKNORR
/* 624*/{0x0B,  35484,  0, {(uint8_t *)"EBS:(35484,0)",                (uint8_t *)"EBS:(35484,0)"},    0}, //EBSKNORR
/* 625*/{0x0B,  35740,  0, {(uint8_t *)"EBS:(35740,0)",                (uint8_t *)"EBS:(35740,0)"},    0}, //EBSKNORR
/* 626*/{0x0B,  33437,  0, {(uint8_t *)"EBS:(33437,0)",                (uint8_t *)"EBS:(33437,0)"},    0}, //EBSKNORR
/* 627*/{0x0B,  33693,  0, {(uint8_t *)"EBS:(33693,0)",                (uint8_t *)"EBS:(33693,0)"},    0}, //EBSKNORR
/* 628*/{0x0B,  33949,  0, {(uint8_t *)"EBS:(33949,0)",                (uint8_t *)"EBS:(33949,0)"},    0}, //EBSKNORR
/* 629*/{0x0B,  34205,  0, {(uint8_t *)"EBS:(34205,0)",                (uint8_t *)"EBS:(34205,0)"},    0}, //EBSKNORR
/* 630*/{0x0B,  34461,  0, {(uint8_t *)"EBS:(34461,0)",                (uint8_t *)"EBS:(34461,0)"},    0}, //EBSKNORR
/* 631*/{0x0B,  34717,  0, {(uint8_t *)"EBS:(34717,0)",                (uint8_t *)"EBS:(34717,0)"},    0}, //EBSKNORR
/* 632*/{0x0B,  34973,  0, {(uint8_t *)"EBS:(34973,0)",                (uint8_t *)"EBS:(34973,0)"},    0}, //EBSKNORR
/* 633*/{0x0B,  35229,  0, {(uint8_t *)"EBS:(35229,0)",                (uint8_t *)"EBS:(35229,0)"},    0}, //EBSKNORR
/* 634*/{0x0B,  35485,  0, {(uint8_t *)"EBS:(35485,0)",                (uint8_t *)"EBS:(35485,0)"},    0}, //EBSKNORR
/* 635*/{0x0B,  35741,  0, {(uint8_t *)"EBS:(35741,0)",                (uint8_t *)"EBS:(35741,0)"},    0}, //EBSKNORR
/* 636*/{0x0B,  33440,  0, {(uint8_t *)"EBS:(33440,0)",                (uint8_t *)"EBS:(33440,0)"},    0}, //EBSKNORR
/* 637*/{0x0B,  33696,  0, {(uint8_t *)"EBS:(33696,0)",                (uint8_t *)"EBS:(33696,0)"},    0}, //EBSKNORR
/* 638*/{0x0B,  33952,  0, {(uint8_t *)"EBS:(33952,0)",                (uint8_t *)"EBS:(33952,0)"},    0}, //EBSKNORR
/* 639*/{0x0B,  34208,  0, {(uint8_t *)"EBS:(34208,0)",                (uint8_t *)"EBS:(34208,0)"},    0}, //EBSKNORR
/* 640*/{0x0B,  34464,  0, {(uint8_t *)"EBS:(34464,0)",                (uint8_t *)"EBS:(34464,0)"},    0}, //EBSKNORR
/* 641*/{0x0B,  34720,  0, {(uint8_t *)"EBS:(34720,0)",                (uint8_t *)"EBS:(34720,0)"},    0}, //EBSKNORR
/* 642*/{0x0B,  34976,  0, {(uint8_t *)"EBS:(34976,0)",                (uint8_t *)"EBS:(34976,0)"},    0}, //EBSKNORR
/* 643*/{0x0B,  35232,  0, {(uint8_t *)"EBS:(35232,0)",                (uint8_t *)"EBS:(35232,0)"},    0}, //EBSKNORR
/* 644*/{0x0B,  35488,  0, {(uint8_t *)"EBS:(35488,0)",                (uint8_t *)"EBS:(35488,0)"},    0}, //EBSKNORR
/* 645*/{0x0B,  35744,  0, {(uint8_t *)"EBS:(35744,0)",                (uint8_t *)"EBS:(35744,0)"},    0}, //EBSKNORR
/* 646*/{0x0B,  33442,  0, {(uint8_t *)"EBS:(33442,0)",                (uint8_t *)"EBS:(33442,0)"},    0}, //EBSKNORR
/* 647*/{0x0B,  33698,  0, {(uint8_t *)"EBS:(33698,0)",                (uint8_t *)"EBS:(33698,0)"},    0}, //EBSKNORR
/* 648*/{0x0B,  33954,  0, {(uint8_t *)"EBS:(33954,0)",                (uint8_t *)"EBS:(33954,0)"},    0}, //EBSKNORR
/* 649*/{0x0B,  34210,  0, {(uint8_t *)"EBS:(34210,0)",                (uint8_t *)"EBS:(34210,0)"},    0}, //EBSKNORR
/* 650*/{0x0B,  34466,  0, {(uint8_t *)"EBS:(34466,0)",                (uint8_t *)"EBS:(34466,0)"},    0}, //EBSKNORR
/* 651*/{0x0B,  34722,  0, {(uint8_t *)"EBS:(34722,0)",                (uint8_t *)"EBS:(34722,0)"},    0}, //EBSKNORR
/* 652*/{0x0B,  34978,  0, {(uint8_t *)"EBS:(34978,0)",                (uint8_t *)"EBS:(34978,0)"},    0}, //EBSKNORR
/* 653*/{0x0B,  35234,  0, {(uint8_t *)"EBS:(35234,0)",                (uint8_t *)"EBS:(35234,0)"},    0}, //EBSKNORR
/* 654*/{0x0B,  35490,  0, {(uint8_t *)"EBS:(35490,0)",                (uint8_t *)"EBS:(35490,0)"},    0}, //EBSKNORR
/* 655*/{0x0B,  35746,  0, {(uint8_t *)"EBS:(35746,0)",                (uint8_t *)"EBS:(35746,0)"},    0}, //EBSKNORR
/* 656*/{0x0B,  35873,  0, {(uint8_t *)"EBS:(35873,0)",                (uint8_t *)"EBS:(35873,0)"},    0}, //EBSKNORR
/* 657*/{0x0B,  36129,  0, {(uint8_t *)"EBS:(36129,0)",                (uint8_t *)"EBS:(36129,0)"},    0}, //EBSKNORR
/* 658*/{0x0B,  36385,  0, {(uint8_t *)"EBS:(36385,0)",                (uint8_t *)"EBS:(36385,0)"},    0}, //EBSKNORR
/* 659*/{0x0B,  36641,  0, {(uint8_t *)"EBS:(36641,0)",                (uint8_t *)"EBS:(36641,0)"},    0}, //EBSKNORR
/* 660*/{0x0B,  36897,  0, {(uint8_t *)"EBS:(36897,0)",                (uint8_t *)"EBS:(36897,0)"},    0}, //EBSKNORR
/* 661*/{0x0B,  37153,  0, {(uint8_t *)"EBS:(37153,0)",                (uint8_t *)"EBS:(37153,0)"},    0}, //EBSKNORR
/* 662*/{0x0B,  37409,  0, {(uint8_t *)"EBS:(37409,0)",                (uint8_t *)"EBS:(37409,0)"},    0}, //EBSKNORR
/* 663*/{0x0B,  37665,  0, {(uint8_t *)"EBS:(37665,0)",                (uint8_t *)"EBS:(37665,0)"},    0}, //EBSKNORR
/* 664*/{0x0B,  37921,  0, {(uint8_t *)"EBS:(37921,0)",                (uint8_t *)"EBS:(37921,0)"},    0}, //EBSKNORR
/* 665*/{0x0B,  38177,  0, {(uint8_t *)"EBS:(38177,0)",                (uint8_t *)"EBS:(38177,0)"},    0}, //EBSKNORR
/* 666*/{0x0B,  35874,  0, {(uint8_t *)"EBS:(35874,0)",                (uint8_t *)"EBS:(35874,0)"},    0}, //EBSKNORR
/* 667*/{0x0B,  36130,  0, {(uint8_t *)"EBS:(36130,0)",                (uint8_t *)"EBS:(36130,0)"},    0}, //EBSKNORR
/* 668*/{0x0B,  36386,  0, {(uint8_t *)"EBS:(36386,0)",                (uint8_t *)"EBS:(36386,0)"},    0}, //EBSKNORR
/* 669*/{0x0B,  36642,  0, {(uint8_t *)"EBS:(36642,0)",                (uint8_t *)"EBS:(36642,0)"},    0}, //EBSKNORR
/* 670*/{0x0B,  36898,  0, {(uint8_t *)"EBS:(36898,0)",                (uint8_t *)"EBS:(36898,0)"},    0}, //EBSKNORR
/* 671*/{0x0B,  37154,  0, {(uint8_t *)"EBS:(37154,0)",                (uint8_t *)"EBS:(37154,0)"},    0}, //EBSKNORR
/* 672*/{0x0B,  37410,  0, {(uint8_t *)"EBS:(37410,0)",                (uint8_t *)"EBS:(37410,0)"},    0}, //EBSKNORR
/* 673*/{0x0B,  37666,  0, {(uint8_t *)"EBS:(37666,0)",                (uint8_t *)"EBS:(37666,0)"},    0}, //EBSKNORR
/* 674*/{0x0B,  37922,  0, {(uint8_t *)"EBS:(37922,0)",                (uint8_t *)"EBS:(37922,0)"},    0}, //EBSKNORR
/* 675*/{0x0B,  38178,  0, {(uint8_t *)"EBS:(38178,0)",                (uint8_t *)"EBS:(38178,0)"},    0}, //EBSKNORR
/* 676*/{0x0B,  35875,  0, {(uint8_t *)"EBS:(35875,0)",                (uint8_t *)"EBS:(35875,0)"},    0}, //EBSKNORR
/* 677*/{0x0B,  36131,  0, {(uint8_t *)"EBS:(36131,0)",                (uint8_t *)"EBS:(36131,0)"},    0}, //EBSKNORR
/* 678*/{0x0B,  36387,  0, {(uint8_t *)"EBS:(36387,0)",                (uint8_t *)"EBS:(36387,0)"},    0}, //EBSKNORR
/* 679*/{0x0B,  36643,  0, {(uint8_t *)"EBS:(36643,0)",                (uint8_t *)"EBS:(36643,0)"},    0}, //EBSKNORR
/* 680*/{0x0B,  36899,  0, {(uint8_t *)"EBS:(36899,0)",                (uint8_t *)"EBS:(36899,0)"},    0}, //EBSKNORR
/* 681*/{0x0B,  37155,  0, {(uint8_t *)"EBS:(37155,0)",                (uint8_t *)"EBS:(37155,0)"},    0}, //EBSKNORR
/* 682*/{0x0B,  37411,  0, {(uint8_t *)"EBS:(37411,0)",                (uint8_t *)"EBS:(37411,0)"},    0}, //EBSKNORR
/* 683*/{0x0B,  37667,  0, {(uint8_t *)"EBS:(37667,0)",                (uint8_t *)"EBS:(37667,0)"},    0}, //EBSKNORR
/* 684*/{0x0B,  37923,  0, {(uint8_t *)"EBS:(37923,0)",                (uint8_t *)"EBS:(37923,0)"},    0}, //EBSKNORR
/* 685*/{0x0B,  38179,  0, {(uint8_t *)"EBS:(38179,0)",                (uint8_t *)"EBS:(38179,0)"},    0}, //EBSKNORR
/* 686*/{0x0B,  38410,  0, {(uint8_t *)"EBS:(38410,0)",                (uint8_t *)"EBS:(38410,0)"},    0}, //EBSKNORR
/* 687*/{0x0B,  38666,  0, {(uint8_t *)"EBS:(38666,0)",                (uint8_t *)"EBS:(38666,0)"},    0}, //EBSKNORR
/* 688*/{0x0B,  38922,  0, {(uint8_t *)"EBS:(38922,0)",                (uint8_t *)"EBS:(38922,0)"},    0}, //EBSKNORR
/* 689*/{0x0B,  39178,  0, {(uint8_t *)"EBS:(39178,0)",                (uint8_t *)"EBS:(39178,0)"},    0}, //EBSKNORR
/* 690*/{0x0B,  39434,  0, {(uint8_t *)"EBS:(39434,0)",                (uint8_t *)"EBS:(39434,0)"},    0}, //EBSKNORR
/* 691*/{0x0B,  39690,  0, {(uint8_t *)"EBS:(39690,0)",                (uint8_t *)"EBS:(39690,0)"},    0}, //EBSKNORR
/* 692*/{0x0B,  39946,  0, {(uint8_t *)"EBS:(39946,0)",                (uint8_t *)"EBS:(39946,0)"},    0}, //EBSKNORR
/* 693*/{0x0B,  40202,  0, {(uint8_t *)"EBS:(40202,0)",                (uint8_t *)"EBS:(40202,0)"},    0}, //EBSKNORR
/* 694*/{0x0B,  40458,  0, {(uint8_t *)"EBS:(40458,0)",                (uint8_t *)"EBS:(40458,0)"},    0}, //EBSKNORR
/* 695*/{0x0B,  40714,  0, {(uint8_t *)"EBS:(40714,0)",                (uint8_t *)"EBS:(40714,0)"},    0}, //EBSKNORR
/* 696*/{0x0B,  38411,  0, {(uint8_t *)"EBS:(38411,0)",                (uint8_t *)"EBS:(38411,0)"},    0}, //EBSKNORR
/* 697*/{0x0B,  38667,  0, {(uint8_t *)"EBS:(38667,0)",                (uint8_t *)"EBS:(38667,0)"},    0}, //EBSKNORR
/* 698*/{0x0B,  38923,  0, {(uint8_t *)"EBS:(38923,0)",                (uint8_t *)"EBS:(38923,0)"},    0}, //EBSKNORR
/* 699*/{0x0B,  39179,  0, {(uint8_t *)"EBS:(39179,0)",                (uint8_t *)"EBS:(39179,0)"},    0}, //EBSKNORR
/* 700*/{0x0B,  39435,  0, {(uint8_t *)"EBS:(39435,0)",                (uint8_t *)"EBS:(39435,0)"},    0}, //EBSKNORR
/* 701*/{0x0B,  39691,  0, {(uint8_t *)"EBS:(39691,0)",                (uint8_t *)"EBS:(39691,0)"},    0}, //EBSKNORR
/* 702*/{0x0B,  39947,  0, {(uint8_t *)"EBS:(39947,0)",                (uint8_t *)"EBS:(39947,0)"},    0}, //EBSKNORR
/* 703*/{0x0B,  40203,  0, {(uint8_t *)"EBS:(40203,0)",                (uint8_t *)"EBS:(40203,0)"},    0}, //EBSKNORR
/* 704*/{0x0B,  40459,  0, {(uint8_t *)"EBS:(40459,0)",                (uint8_t *)"EBS:(40459,0)"},    0}, //EBSKNORR
/* 705*/{0x0B,  40715,  0, {(uint8_t *)"EBS:(40715,0)",                (uint8_t *)"EBS:(40715,0)"},    0}, //EBSKNORR
/* 706*/{0x0B,  38413,  0, {(uint8_t *)"EBS:(38413,0)",                (uint8_t *)"EBS:(38413,0)"},    0}, //EBSKNORR
/* 707*/{0x0B,  38669,  0, {(uint8_t *)"EBS:(38669,0)",                (uint8_t *)"EBS:(38669,0)"},    0}, //EBSKNORR
/* 708*/{0x0B,  38925,  0, {(uint8_t *)"EBS:(38925,0)",                (uint8_t *)"EBS:(38925,0)"},    0}, //EBSKNORR
/* 709*/{0x0B,  39181,  0, {(uint8_t *)"EBS:(39181,0)",                (uint8_t *)"EBS:(39181,0)"},    0}, //EBSKNORR
/* 710*/{0x0B,  39437,  0, {(uint8_t *)"EBS:(39437,0)",                (uint8_t *)"EBS:(39437,0)"},    0}, //EBSKNORR
/* 711*/{0x0B,  39693,  0, {(uint8_t *)"EBS:(39693,0)",                (uint8_t *)"EBS:(39693,0)"},    0}, //EBSKNORR
/* 712*/{0x0B,  39949,  0, {(uint8_t *)"EBS:(39949,0)",                (uint8_t *)"EBS:(39949,0)"},    0}, //EBSKNORR
/* 713*/{0x0B,  40205,  0, {(uint8_t *)"EBS:(40205,0)",                (uint8_t *)"EBS:(40205,0)"},    0}, //EBSKNORR
/* 714*/{0x0B,  40461,  0, {(uint8_t *)"EBS:(40461,0)",                (uint8_t *)"EBS:(40461,0)"},    0}, //EBSKNORR
/* 715*/{0x0B,  40717,  0, {(uint8_t *)"EBS:(40717,0)",                (uint8_t *)"EBS:(40717,0)"},    0}, //EBSKNORR
/* 716*/{0x0B,  38414,  0, {(uint8_t *)"EBS:(38414,0)",                (uint8_t *)"EBS:(38414,0)"},    0}, //EBSKNORR
/* 717*/{0x0B,  38670,  0, {(uint8_t *)"EBS:(38670,0)",                (uint8_t *)"EBS:(38670,0)"},    0}, //EBSKNORR
/* 718*/{0x0B,  38926,  0, {(uint8_t *)"EBS:(38926,0)",                (uint8_t *)"EBS:(38926,0)"},    0}, //EBSKNORR
/* 719*/{0x0B,  39182,  0, {(uint8_t *)"EBS:(39182,0)",                (uint8_t *)"EBS:(39182,0)"},    0}, //EBSKNORR
/* 720*/{0x0B,  39438,  0, {(uint8_t *)"EBS:(39438,0)",                (uint8_t *)"EBS:(39438,0)"},    0}, //EBSKNORR
/* 721*/{0x0B,  39694,  0, {(uint8_t *)"EBS:(39694,0)",                (uint8_t *)"EBS:(39694,0)"},    0}, //EBSKNORR
/* 722*/{0x0B,  39950,  0, {(uint8_t *)"EBS:(39950,0)",                (uint8_t *)"EBS:(39950,0)"},    0}, //EBSKNORR
/* 723*/{0x0B,  40206,  0, {(uint8_t *)"EBS:(40206,0)",                (uint8_t *)"EBS:(40206,0)"},    0}, //EBSKNORR
/* 724*/{0x0B,  40462,  0, {(uint8_t *)"EBS:(40462,0)",                (uint8_t *)"EBS:(40462,0)"},    0}, //EBSKNORR
/* 725*/{0x0B,  40718,  0, {(uint8_t *)"EBS:(40718,0)",                (uint8_t *)"EBS:(40718,0)"},    0}, //EBSKNORR
/* 726*/{0x0B,  38570,  0, {(uint8_t *)"EBS:(38570,0)",                (uint8_t *)"EBS:(38570,0)"},    0}, //EBSKNORR
/* 727*/{0x0B,  38571,  0, {(uint8_t *)"EBS:(38571,0)",                (uint8_t *)"EBS:(38571,0)"},    0}, //EBSKNORR
/* 728*/{0x0B,  38572,  0, {(uint8_t *)"EBS:(38572,0)",                (uint8_t *)"EBS:(38572,0)"},    0}, //EBSKNORR
/* 729*/{0x0B,  38573,  0, {(uint8_t *)"EBS:(38573,0)",                (uint8_t *)"EBS:(38573,0)"},    0}, //EBSKNORR
/* 730*/{0x0B,  38574,  0, {(uint8_t *)"EBS:(38574,0)",                (uint8_t *)"EBS:(38574,0)"},    0}, //EBSKNORR
/* 731*/{0x0B,  38575,  0, {(uint8_t *)"EBS:(38575,0)",                (uint8_t *)"EBS:(38575,0)"},    0}, //EBSKNORR
/* 732*/{0x0B,  38576,  0, {(uint8_t *)"EBS:(38576,0)",                (uint8_t *)"EBS:(38576,0)"},    0}, //EBSKNORR
/* 733*/{0x0B,  38577,  0, {(uint8_t *)"EBS:(38577,0)",                (uint8_t *)"EBS:(38577,0)"},    0}, //EBSKNORR
/* 734*/{0x0B,  38826,  0, {(uint8_t *)"EBS:(38826,0)",                (uint8_t *)"EBS:(38826,0)"},    0}, //EBSKNORR
/* 735*/{0x0B,  38827,  0, {(uint8_t *)"EBS:(38827,0)",                (uint8_t *)"EBS:(38827,0)"},    0}, //EBSKNORR
/* 736*/{0x0B,  38828,  0, {(uint8_t *)"EBS:(38828,0)",                (uint8_t *)"EBS:(38828,0)"},    0}, //EBSKNORR
/* 737*/{0x0B,  38829,  0, {(uint8_t *)"EBS:(38829,0)",                (uint8_t *)"EBS:(38829,0)"},    0}, //EBSKNORR
/* 738*/{0x0B,  38830,  0, {(uint8_t *)"EBS:(38830,0)",                (uint8_t *)"EBS:(38830,0)"},    0}, //EBSKNORR
/* 739*/{0x0B,  38831,  0, {(uint8_t *)"EBS:(38831,0)",                (uint8_t *)"EBS:(38831,0)"},    0}, //EBSKNORR
/* 740*/{0x0B,  38832,  0, {(uint8_t *)"EBS:(38832,0)",                (uint8_t *)"EBS:(38832,0)"},    0}, //EBSKNORR
/* 741*/{0x0B,  38833,  0, {(uint8_t *)"EBS:(38833,0)",                (uint8_t *)"EBS:(38833,0)"},    0}, //EBSKNORR
/* 742*/{0x0B,  39082,  0, {(uint8_t *)"EBS:(39082,0)",                (uint8_t *)"EBS:(39082,0)"},    0}, //EBSKNORR
/* 743*/{0x0B,  39083,  0, {(uint8_t *)"EBS:(39083,0)",                (uint8_t *)"EBS:(39083,0)"},    0}, //EBSKNORR
/* 744*/{0x0B,  39084,  0, {(uint8_t *)"EBS:(39084,0)",                (uint8_t *)"EBS:(39084,0)"},    0}, //EBSKNORR
/* 745*/{0x0B,  39085,  0, {(uint8_t *)"EBS:(39085,0)",                (uint8_t *)"EBS:(39085,0)"},    0}, //EBSKNORR
/* 746*/{0x0B,  39086,  0, {(uint8_t *)"EBS:(39086,0)",                (uint8_t *)"EBS:(39086,0)"},    0}, //EBSKNORR
/* 747*/{0x0B,  39087,  0, {(uint8_t *)"EBS:(39087,0)",                (uint8_t *)"EBS:(39087,0)"},    0}, //EBSKNORR
/* 748*/{0x0B,  39088,  0, {(uint8_t *)"EBS:(39088,0)",                (uint8_t *)"EBS:(39088,0)"},    0}, //EBSKNORR
/* 749*/{0x0B,  39089,  0, {(uint8_t *)"EBS:(39089,0)",                (uint8_t *)"EBS:(39089,0)"},    0}, //EBSKNORR
/* 750*/{0x0B,  39338,  0, {(uint8_t *)"EBS:(39338,0)",                (uint8_t *)"EBS:(39338,0)"},    0}, //EBSKNORR
/* 751*/{0x0B,  39339,  0, {(uint8_t *)"EBS:(39339,0)",                (uint8_t *)"EBS:(39339,0)"},    0}, //EBSKNORR
/* 752*/{0x0B,  39340,  0, {(uint8_t *)"EBS:(39340,0)",                (uint8_t *)"EBS:(39340,0)"},    0}, //EBSKNORR
/* 753*/{0x0B,  39341,  0, {(uint8_t *)"EBS:(39341,0)",                (uint8_t *)"EBS:(39341,0)"},    0}, //EBSKNORR
/* 754*/{0x0B,  39342,  0, {(uint8_t *)"EBS:(39342,0)",                (uint8_t *)"EBS:(39342,0)"},    0}, //EBSKNORR
/* 755*/{0x0B,  39343,  0, {(uint8_t *)"EBS:(39343,0)",                (uint8_t *)"EBS:(39343,0)"},    0}, //EBSKNORR
/* 756*/{0x0B,  39344,  0, {(uint8_t *)"EBS:(39344,0)",                (uint8_t *)"EBS:(39344,0)"},    0}, //EBSKNORR
/* 757*/{0x0B,  39345,  0, {(uint8_t *)"EBS:(39345,0)",                (uint8_t *)"EBS:(39345,0)"},    0}, //EBSKNORR
/* 758*/{0x0B,  39594,  0, {(uint8_t *)"EBS:(39594,0)",                (uint8_t *)"EBS:(39594,0)"},    0}, //EBSKNORR
/* 759*/{0x0B,  39595,  0, {(uint8_t *)"EBS:(39595,0)",                (uint8_t *)"EBS:(39595,0)"},    0}, //EBSKNORR
/* 760*/{0x0B,  39596,  0, {(uint8_t *)"EBS:(39596,0)",                (uint8_t *)"EBS:(39596,0)"},    0}, //EBSKNORR
/* 761*/{0x0B,  39597,  0, {(uint8_t *)"EBS:(39597,0)",                (uint8_t *)"EBS:(39597,0)"},    0}, //EBSKNORR
/* 762*/{0x0B,  39598,  0, {(uint8_t *)"EBS:(39598,0)",                (uint8_t *)"EBS:(39598,0)"},    0}, //EBSKNORR
/* 763*/{0x0B,  39599,  0, {(uint8_t *)"EBS:(39599,0)",                (uint8_t *)"EBS:(39599,0)"},    0}, //EBSKNORR
/* 764*/{0x0B,  39600,  0, {(uint8_t *)"EBS:(39600,0)",                (uint8_t *)"EBS:(39600,0)"},    0}, //EBSKNORR
/* 765*/{0x0B,  39601,  0, {(uint8_t *)"EBS:(39601,0)",                (uint8_t *)"EBS:(39601,0)"},    0}, //EBSKNORR
/* 766*/{0x0B,  39850,  0, {(uint8_t *)"EBS:(39850,0)",                (uint8_t *)"EBS:(39850,0)"},    0}, //EBSKNORR
/* 767*/{0x0B,  39851,  0, {(uint8_t *)"EBS:(39851,0)",                (uint8_t *)"EBS:(39851,0)"},    0}, //EBSKNORR
/* 768*/{0x0B,  39852,  0, {(uint8_t *)"EBS:(39852,0)",                (uint8_t *)"EBS:(39852,0)"},    0}, //EBSKNORR
/* 769*/{0x0B,  39853,  0, {(uint8_t *)"EBS:(39853,0)",                (uint8_t *)"EBS:(39853,0)"},    0}, //EBSKNORR
/* 770*/{0x0B,  39854,  0, {(uint8_t *)"EBS:(39854,0)",                (uint8_t *)"EBS:(39854,0)"},    0}, //EBSKNORR
/* 771*/{0x0B,  39855,  0, {(uint8_t *)"EBS:(39855,0)",                (uint8_t *)"EBS:(39855,0)"},    0}, //EBSKNORR
/* 772*/{0x0B,  39856,  0, {(uint8_t *)"EBS:(39856,0)",                (uint8_t *)"EBS:(39856,0)"},    0}, //EBSKNORR
/* 773*/{0x0B,  39857,  0, {(uint8_t *)"EBS:(39857,0)",                (uint8_t *)"EBS:(39857,0)"},    0}, //EBSKNORR
/* 774*/{0x0B,  40106,  0, {(uint8_t *)"EBS:(40106,0)",                (uint8_t *)"EBS:(40106,0)"},    0}, //EBSKNORR
/* 775*/{0x0B,  40107,  0, {(uint8_t *)"EBS:(40107,0)",                (uint8_t *)"EBS:(40107,0)"},    0}, //EBSKNORR
/* 776*/{0x0B,  40108,  0, {(uint8_t *)"EBS:(40108,0)",                (uint8_t *)"EBS:(40108,0)"},    0}, //EBSKNORR
/* 777*/{0x0B,  40109,  0, {(uint8_t *)"EBS:(40109,0)",                (uint8_t *)"EBS:(40109,0)"},    0}, //EBSKNORR
/* 778*/{0x0B,  40110,  0, {(uint8_t *)"EBS:(40110,0)",                (uint8_t *)"EBS:(40110,0)"},    0}, //EBSKNORR
/* 779*/{0x0B,  40111,  0, {(uint8_t *)"EBS:(40111,0)",                (uint8_t *)"EBS:(40111,0)"},    0}, //EBSKNORR
/* 780*/{0x0B,  40112,  0, {(uint8_t *)"EBS:(40112,0)",                (uint8_t *)"EBS:(40112,0)"},    0}, //EBSKNORR
/* 781*/{0x0B,  40113,  0, {(uint8_t *)"EBS:(40113,0)",                (uint8_t *)"EBS:(40113,0)"},    0}, //EBSKNORR
/* 782*/{0x0B,  40362,  0, {(uint8_t *)"EBS:(40362,0)",                (uint8_t *)"EBS:(40362,0)"},    0}, //EBSKNORR
/* 783*/{0x0B,  40363,  0, {(uint8_t *)"EBS:(40363,0)",                (uint8_t *)"EBS:(40363,0)"},    0}, //EBSKNORR
/* 784*/{0x0B,  40364,  0, {(uint8_t *)"EBS:(40364,0)",                (uint8_t *)"EBS:(40364,0)"},    0}, //EBSKNORR
/* 785*/{0x0B,  40365,  0, {(uint8_t *)"EBS:(40365,0)",                (uint8_t *)"EBS:(40365,0)"},    0}, //EBSKNORR
/* 786*/{0x0B,  40366,  0, {(uint8_t *)"EBS:(40366,0)",                (uint8_t *)"EBS:(40366,0)"},    0}, //EBSKNORR
/* 787*/{0x0B,  40367,  0, {(uint8_t *)"EBS:(40367,0)",                (uint8_t *)"EBS:(40367,0)"},    0}, //EBSKNORR
/* 788*/{0x0B,  40368,  0, {(uint8_t *)"EBS:(40368,0)",                (uint8_t *)"EBS:(40368,0)"},    0}, //EBSKNORR
/* 789*/{0x0B,  40369,  0, {(uint8_t *)"EBS:(40369,0)",                (uint8_t *)"EBS:(40369,0)"},    0}, //EBSKNORR
/* 790*/{0x0B,  40618,  0, {(uint8_t *)"EBS:(40618,0)",                (uint8_t *)"EBS:(40618,0)"},    0}, //EBSKNORR
/* 791*/{0x0B,  40619,  0, {(uint8_t *)"EBS:(40619,0)",                (uint8_t *)"EBS:(40619,0)"},    0}, //EBSKNORR
/* 792*/{0x0B,  40620,  0, {(uint8_t *)"EBS:(40620,0)",                (uint8_t *)"EBS:(40620,0)"},    0}, //EBSKNORR
/* 793*/{0x0B,  40621,  0, {(uint8_t *)"EBS:(40621,0)",                (uint8_t *)"EBS:(40621,0)"},    0}, //EBSKNORR
/* 794*/{0x0B,  40622,  0, {(uint8_t *)"EBS:(40622,0)",                (uint8_t *)"EBS:(40622,0)"},    0}, //EBSKNORR
/* 795*/{0x0B,  40623,  0, {(uint8_t *)"EBS:(40623,0)",                (uint8_t *)"EBS:(40623,0)"},    0}, //EBSKNORR
/* 796*/{0x0B,  40624,  0, {(uint8_t *)"EBS:(40624,0)",                (uint8_t *)"EBS:(40624,0)"},    0}, //EBSKNORR
/* 797*/{0x0B,  40625,  0, {(uint8_t *)"EBS:(40625,0)",                (uint8_t *)"EBS:(40625,0)"},    0}, //EBSKNORR
/* 798*/{0x0B,  40874,  0, {(uint8_t *)"EBS:(40874,0)",                (uint8_t *)"EBS:(40874,0)"},    0}, //EBSKNORR
/* 799*/{0x0B,  40875,  0, {(uint8_t *)"EBS:(40875,0)",                (uint8_t *)"EBS:(40875,0)"},    0}, //EBSKNORR
/* 800*/{0x0B,  40876,  0, {(uint8_t *)"EBS:(40876,0)",                (uint8_t *)"EBS:(40876,0)"},    0}, //EBSKNORR
/* 801*/{0x0B,  40877,  0, {(uint8_t *)"EBS:(40877,0)",                (uint8_t *)"EBS:(40877,0)"},    0}, //EBSKNORR
/* 802*/{0x0B,  40878,  0, {(uint8_t *)"EBS:(40878,0)",                (uint8_t *)"EBS:(40878,0)"},    0}, //EBSKNORR
/* 803*/{0x0B,  40879,  0, {(uint8_t *)"EBS:(40879,0)",                (uint8_t *)"EBS:(40879,0)"},    0}, //EBSKNORR
/* 804*/{0x0B,  40880,  0, {(uint8_t *)"EBS:(40880,0)",                (uint8_t *)"EBS:(40880,0)"},    0}, //EBSKNORR
/* 805*/{0x0B,  40881,  0, {(uint8_t *)"EBS:(40881,0)",                (uint8_t *)"EBS:(40881,0)"},    0}, //EBSKNORR
/* 806*/{0x0B,  40982,  0, {(uint8_t *)"EBS:(40982,0)",                (uint8_t *)"EBS:(40982,0)"},    0}, //EBSKNORR
/* 807*/{0x0B,  41238,  0, {(uint8_t *)"EBS:(41238,0)",                (uint8_t *)"EBS:(41238,0)"},    0}, //EBSKNORR
/* 808*/{0x0B,  41494,  0, {(uint8_t *)"EBS:(41494,0)",                (uint8_t *)"EBS:(41494,0)"},    0}, //EBSKNORR
/* 809*/{0x0B,  41750,  0, {(uint8_t *)"EBS:(41750,0)",                (uint8_t *)"EBS:(41750,0)"},    0}, //EBSKNORR
/* 810*/{0x0B,  42006,  0, {(uint8_t *)"EBS:(42006,0)",                (uint8_t *)"EBS:(42006,0)"},    0}, //EBSKNORR
/* 811*/{0x0B,  42262,  0, {(uint8_t *)"EBS:(42262,0)",                (uint8_t *)"EBS:(42262,0)"},    0}, //EBSKNORR
/* 812*/{0x0B,  42518,  0, {(uint8_t *)"EBS:(42518,0)",                (uint8_t *)"EBS:(42518,0)"},    0}, //EBSKNORR
/* 813*/{0x0B,  42774,  0, {(uint8_t *)"EBS:(42774,0)",                (uint8_t *)"EBS:(42774,0)"},    0}, //EBSKNORR
/* 814*/{0x0B,  43030,  0, {(uint8_t *)"EBS:(43030,0)",                (uint8_t *)"EBS:(43030,0)"},    0}, //EBSKNORR
/* 815*/{0x0B,  43286,  0, {(uint8_t *)"EBS:(43286,0)",                (uint8_t *)"EBS:(43286,0)"},    0}, //EBSKNORR
/* 816*/{0x0B,  40990,  0, {(uint8_t *)"EBS:(40990,0)",                (uint8_t *)"EBS:(40990,0)"},    0}, //EBSKNORR
/* 817*/{0x0B,  41246,  0, {(uint8_t *)"EBS:(41246,0)",                (uint8_t *)"EBS:(41246,0)"},    0}, //EBSKNORR
/* 818*/{0x0B,  41502,  0, {(uint8_t *)"EBS:(41502,0)",                (uint8_t *)"EBS:(41502,0)"},    0}, //EBSKNORR
/* 819*/{0x0B,  41758,  0, {(uint8_t *)"EBS:(41758,0)",                (uint8_t *)"EBS:(41758,0)"},    0}, //EBSKNORR
/* 820*/{0x0B,  42014,  0, {(uint8_t *)"EBS:(42014,0)",                (uint8_t *)"EBS:(42014,0)"},    0}, //EBSKNORR
/* 821*/{0x0B,  42270,  0, {(uint8_t *)"EBS:(42270,0)",                (uint8_t *)"EBS:(42270,0)"},    0}, //EBSKNORR
/* 822*/{0x0B,  42526,  0, {(uint8_t *)"EBS:(42526,0)",                (uint8_t *)"EBS:(42526,0)"},    0}, //EBSKNORR
/* 823*/{0x0B,  42782,  0, {(uint8_t *)"EBS:(42782,0)",                (uint8_t *)"EBS:(42782,0)"},    0}, //EBSKNORR
/* 824*/{0x0B,  43038,  0, {(uint8_t *)"EBS:(43038,0)",                (uint8_t *)"EBS:(43038,0)"},    0}, //EBSKNORR
/* 825*/{0x0B,  43294,  0, {(uint8_t *)"EBS:(43294,0)",                (uint8_t *)"EBS:(43294,0)"},    0}, //EBSKNORR
/* 826*/{0x0B,  40992,  0, {(uint8_t *)"EBS:(40992,0)",                (uint8_t *)"EBS:(40992,0)"},    0}, //EBSKNORR
/* 827*/{0x0B,  41248,  0, {(uint8_t *)"EBS:(41248,0)",                (uint8_t *)"EBS:(41248,0)"},    0}, //EBSKNORR
/* 828*/{0x0B,  41504,  0, {(uint8_t *)"EBS:(41504,0)",                (uint8_t *)"EBS:(41504,0)"},    0}, //EBSKNORR
/* 829*/{0x0B,  41760,  0, {(uint8_t *)"EBS:(41760,0)",                (uint8_t *)"EBS:(41760,0)"},    0}, //EBSKNORR
/* 830*/{0x0B,  42016,  0, {(uint8_t *)"EBS:(42016,0)",                (uint8_t *)"EBS:(42016,0)"},    0}, //EBSKNORR
/* 831*/{0x0B,  42272,  0, {(uint8_t *)"EBS:(42272,0)",                (uint8_t *)"EBS:(42272,0)"},    0}, //EBSKNORR
/* 832*/{0x0B,  42528,  0, {(uint8_t *)"EBS:(42528,0)",                (uint8_t *)"EBS:(42528,0)"},    0}, //EBSKNORR
/* 833*/{0x0B,  42784,  0, {(uint8_t *)"EBS:(42784,0)",                (uint8_t *)"EBS:(42784,0)"},    0}, //EBSKNORR
/* 834*/{0x0B,  43040,  0, {(uint8_t *)"EBS:(43040,0)",                (uint8_t *)"EBS:(43040,0)"},    0}, //EBSKNORR
/* 835*/{0x0B,  43296,  0, {(uint8_t *)"EBS:(43296,0)",                (uint8_t *)"EBS:(43296,0)"},    0}, //EBSKNORR
/* 836*/{0x0B,  40993,  0, {(uint8_t *)"EBS:(40993,0)",                (uint8_t *)"EBS:(40993,0)"},    0}, //EBSKNORR
/* 837*/{0x0B,  41249,  0, {(uint8_t *)"EBS:(41249,0)",                (uint8_t *)"EBS:(41249,0)"},    0}, //EBSKNORR
/* 838*/{0x0B,  41505,  0, {(uint8_t *)"EBS:(41505,0)",                (uint8_t *)"EBS:(41505,0)"},    0}, //EBSKNORR
/* 839*/{0x0B,  41761,  0, {(uint8_t *)"EBS:(41761,0)",                (uint8_t *)"EBS:(41761,0)"},    0}, //EBSKNORR
/* 840*/{0x0B,  42017,  0, {(uint8_t *)"EBS:(42017,0)",                (uint8_t *)"EBS:(42017,0)"},    0}, //EBSKNORR
/* 841*/{0x0B,  42273,  0, {(uint8_t *)"EBS:(42273,0)",                (uint8_t *)"EBS:(42273,0)"},    0}, //EBSKNORR
/* 842*/{0x0B,  42529,  0, {(uint8_t *)"EBS:(42529,0)",                (uint8_t *)"EBS:(42529,0)"},    0}, //EBSKNORR
/* 843*/{0x0B,  42785,  0, {(uint8_t *)"EBS:(42785,0)",                (uint8_t *)"EBS:(42785,0)"},    0}, //EBSKNORR
/* 844*/{0x0B,  43041,  0, {(uint8_t *)"EBS:(43041,0)",                (uint8_t *)"EBS:(43041,0)"},    0}, //EBSKNORR
/* 845*/{0x0B,  43297,  0, {(uint8_t *)"EBS:(43297,0)",                (uint8_t *)"EBS:(43297,0)"},    0}, //EBSKNORR
/* 846*/{0x0B,  41003,  0, {(uint8_t *)"EBS:(41003,0)",                (uint8_t *)"EBS:(41003,0)"},    0}, //EBSKNORR
/* 847*/{0x0B,  41259,  0, {(uint8_t *)"EBS:(41259,0)",                (uint8_t *)"EBS:(41259,0)"},    0}, //EBSKNORR
/* 848*/{0x0B,  41515,  0, {(uint8_t *)"EBS:(41515,0)",                (uint8_t *)"EBS:(41515,0)"},    0}, //EBSKNORR
/* 849*/{0x0B,  41771,  0, {(uint8_t *)"EBS:(41771,0)",                (uint8_t *)"EBS:(41771,0)"},    0}, //EBSKNORR
/* 850*/{0x0B,  42027,  0, {(uint8_t *)"EBS:(42027,0)",                (uint8_t *)"EBS:(42027,0)"},    0}, //EBSKNORR
/* 851*/{0x0B,  42283,  0, {(uint8_t *)"EBS:(42283,0)",                (uint8_t *)"EBS:(42283,0)"},    0}, //EBSKNORR
/* 852*/{0x0B,  42539,  0, {(uint8_t *)"EBS:(42539,0)",                (uint8_t *)"EBS:(42539,0)"},    0}, //EBSKNORR
/* 853*/{0x0B,  42795,  0, {(uint8_t *)"EBS:(42795,0)",                (uint8_t *)"EBS:(42795,0)"},    0}, //EBSKNORR
/* 854*/{0x0B,  43051,  0, {(uint8_t *)"EBS:(43051,0)",                (uint8_t *)"EBS:(43051,0)"},    0}, //EBSKNORR
/* 855*/{0x0B,  43307,  0, {(uint8_t *)"EBS:(43307,0)",                (uint8_t *)"EBS:(43307,0)"},    0}, //EBSKNORR
/* 856*/{0x0B,  41004,  0, {(uint8_t *)"EBS:(41004,0)",                (uint8_t *)"EBS:(41004,0)"},    0}, //EBSKNORR
/* 857*/{0x0B,  41260,  0, {(uint8_t *)"EBS:(41260,0)",                (uint8_t *)"EBS:(41260,0)"},    0}, //EBSKNORR
/* 858*/{0x0B,  41516,  0, {(uint8_t *)"EBS:(41516,0)",                (uint8_t *)"EBS:(41516,0)"},    0}, //EBSKNORR
/* 859*/{0x0B,  41772,  0, {(uint8_t *)"EBS:(41772,0)",                (uint8_t *)"EBS:(41772,0)"},    0}, //EBSKNORR
/* 860*/{0x0B,  42028,  0, {(uint8_t *)"EBS:(42028,0)",                (uint8_t *)"EBS:(42028,0)"},    0}, //EBSKNORR
/* 861*/{0x0B,  42284,  0, {(uint8_t *)"EBS:(42284,0)",                (uint8_t *)"EBS:(42284,0)"},    0}, //EBSKNORR
/* 862*/{0x0B,  42540,  0, {(uint8_t *)"EBS:(42540,0)",                (uint8_t *)"EBS:(42540,0)"},    0}, //EBSKNORR
/* 863*/{0x0B,  42796,  0, {(uint8_t *)"EBS:(42796,0)",                (uint8_t *)"EBS:(42796,0)"},    0}, //EBSKNORR
/* 864*/{0x0B,  43052,  0, {(uint8_t *)"EBS:(43052,0)",                (uint8_t *)"EBS:(43052,0)"},    0}, //EBSKNORR
/* 865*/{0x0B,  43308,  0, {(uint8_t *)"EBS:(43308,0)",                (uint8_t *)"EBS:(43308,0)"},    0}, //EBSKNORR
/* 866*/{0x0B,  43542,  0, {(uint8_t *)"EBS:(43542,0)",                (uint8_t *)"EBS:(43542,0)"},    0}, //EBSKNORR
/* 867*/{0x0B,  43798,  0, {(uint8_t *)"EBS:(43798,0)",                (uint8_t *)"EBS:(43798,0)"},    0}, //EBSKNORR
/* 868*/{0x0B,  44054,  0, {(uint8_t *)"EBS:(44054,0)",                (uint8_t *)"EBS:(44054,0)"},    0}, //EBSKNORR
/* 869*/{0x0B,  44310,  0, {(uint8_t *)"EBS:(44310,0)",                (uint8_t *)"EBS:(44310,0)"},    0}, //EBSKNORR
/* 870*/{0x0B,  44566,  0, {(uint8_t *)"EBS:(44566,0)",                (uint8_t *)"EBS:(44566,0)"},    0}, //EBSKNORR
/* 871*/{0x0B,  44822,  0, {(uint8_t *)"EBS:(44822,0)",                (uint8_t *)"EBS:(44822,0)"},    0}, //EBSKNORR
/* 872*/{0x0B,  45078,  0, {(uint8_t *)"EBS:(45078,0)",                (uint8_t *)"EBS:(45078,0)"},    0}, //EBSKNORR
/* 873*/{0x0B,  45334,  0, {(uint8_t *)"EBS:(45334,0)",                (uint8_t *)"EBS:(45334,0)"},    0}, //EBSKNORR
/* 874*/{0x0B,  45590,  0, {(uint8_t *)"EBS:(45590,0)",                (uint8_t *)"EBS:(45590,0)"},    0}, //EBSKNORR
/* 875*/{0x0B,  45846,  0, {(uint8_t *)"EBS:(45846,0)",                (uint8_t *)"EBS:(45846,0)"},    0}, //EBSKNORR
/* 876*/{0x0B,  43550,  0, {(uint8_t *)"EBS:(43550,0)",                (uint8_t *)"EBS:(43550,0)"},    0}, //EBSKNORR
/* 877*/{0x0B,  43806,  0, {(uint8_t *)"EBS:(43806,0)",                (uint8_t *)"EBS:(43806,0)"},    0}, //EBSKNORR
/* 878*/{0x0B,  44062,  0, {(uint8_t *)"EBS:(44062,0)",                (uint8_t *)"EBS:(44062,0)"},    0}, //EBSKNORR
/* 879*/{0x0B,  44318,  0, {(uint8_t *)"EBS:(44318,0)",                (uint8_t *)"EBS:(44318,0)"},    0}, //EBSKNORR
/* 880*/{0x0B,  44574,  0, {(uint8_t *)"EBS:(44574,0)",                (uint8_t *)"EBS:(44574,0)"},    0}, //EBSKNORR
/* 881*/{0x0B,  44830,  0, {(uint8_t *)"EBS:(44830,0)",                (uint8_t *)"EBS:(44830,0)"},    0}, //EBSKNORR
/* 882*/{0x0B,  45086,  0, {(uint8_t *)"EBS:(45086,0)",                (uint8_t *)"EBS:(45086,0)"},    0}, //EBSKNORR
/* 883*/{0x0B,  45342,  0, {(uint8_t *)"EBS:(45342,0)",                (uint8_t *)"EBS:(45342,0)"},    0}, //EBSKNORR
/* 884*/{0x0B,  45598,  0, {(uint8_t *)"EBS:(45598,0)",                (uint8_t *)"EBS:(45598,0)"},    0}, //EBSKNORR
/* 885*/{0x0B,  45854,  0, {(uint8_t *)"EBS:(45854,0)",                (uint8_t *)"EBS:(45854,0)"},    0}, //EBSKNORR
/* 886*/{0x0B,  43552,  0, {(uint8_t *)"EBS:(43552,0)",                (uint8_t *)"EBS:(43552,0)"},    0}, //EBSKNORR
/* 887*/{0x0B,  43808,  0, {(uint8_t *)"EBS:(43808,0)",                (uint8_t *)"EBS:(43808,0)"},    0}, //EBSKNORR
/* 888*/{0x0B,  44064,  0, {(uint8_t *)"EBS:(44064,0)",                (uint8_t *)"EBS:(44064,0)"},    0}, //EBSKNORR
/* 889*/{0x0B,  44320,  0, {(uint8_t *)"EBS:(44320,0)",                (uint8_t *)"EBS:(44320,0)"},    0}, //EBSKNORR
/* 890*/{0x0B,  44576,  0, {(uint8_t *)"EBS:(44576,0)",                (uint8_t *)"EBS:(44576,0)"},    0}, //EBSKNORR
/* 891*/{0x0B,  44832,  0, {(uint8_t *)"EBS:(44832,0)",                (uint8_t *)"EBS:(44832,0)"},    0}, //EBSKNORR
/* 892*/{0x0B,  45088,  0, {(uint8_t *)"EBS:(45088,0)",                (uint8_t *)"EBS:(45088,0)"},    0}, //EBSKNORR
/* 893*/{0x0B,  45344,  0, {(uint8_t *)"EBS:(45344,0)",                (uint8_t *)"EBS:(45344,0)"},    0}, //EBSKNORR
/* 894*/{0x0B,  45600,  0, {(uint8_t *)"EBS:(45600,0)",                (uint8_t *)"EBS:(45600,0)"},    0}, //EBSKNORR
/* 895*/{0x0B,  45856,  0, {(uint8_t *)"EBS:(45856,0)",                (uint8_t *)"EBS:(45856,0)"},    0}, //EBSKNORR
/* 896*/{0x0B,  43553,  0, {(uint8_t *)"EBS:(43553,0)",                (uint8_t *)"EBS:(43553,0)"},    0}, //EBSKNORR
/* 897*/{0x0B,  43809,  0, {(uint8_t *)"EBS:(43809,0)",                (uint8_t *)"EBS:(43809,0)"},    0}, //EBSKNORR
/* 898*/{0x0B,  44065,  0, {(uint8_t *)"EBS:(44065,0)",                (uint8_t *)"EBS:(44065,0)"},    0}, //EBSKNORR
/* 899*/{0x0B,  44321,  0, {(uint8_t *)"EBS:(44321,0)",                (uint8_t *)"EBS:(44321,0)"},    0}, //EBSKNORR
/* 900*/{0x0B,  44577,  0, {(uint8_t *)"EBS:(44577,0)",                (uint8_t *)"EBS:(44577,0)"},    0}, //EBSKNORR
/* 901*/{0x0B,  44833,  0, {(uint8_t *)"EBS:(44833,0)",                (uint8_t *)"EBS:(44833,0)"},    0}, //EBSKNORR
/* 902*/{0x0B,  45089,  0, {(uint8_t *)"EBS:(45089,0)",                (uint8_t *)"EBS:(45089,0)"},    0}, //EBSKNORR
/* 903*/{0x0B,  45345,  0, {(uint8_t *)"EBS:(45345,0)",                (uint8_t *)"EBS:(45345,0)"},    0}, //EBSKNORR
/* 904*/{0x0B,  45601,  0, {(uint8_t *)"EBS:(45601,0)",                (uint8_t *)"EBS:(45601,0)"},    0}, //EBSKNORR
/* 905*/{0x0B,  45857,  0, {(uint8_t *)"EBS:(45857,0)",                (uint8_t *)"EBS:(45857,0)"},    0}, //EBSKNORR
/* 906*/{0x0B,  43563,  0, {(uint8_t *)"EBS:(43563,0)",                (uint8_t *)"EBS:(43563,0)"},    0}, //EBSKNORR
/* 907*/{0x0B,  43819,  0, {(uint8_t *)"EBS:(43819,0)",                (uint8_t *)"EBS:(43819,0)"},    0}, //EBSKNORR
/* 908*/{0x0B,  44075,  0, {(uint8_t *)"EBS:(44075,0)",                (uint8_t *)"EBS:(44075,0)"},    0}, //EBSKNORR
/* 909*/{0x0B,  44331,  0, {(uint8_t *)"EBS:(44331,0)",                (uint8_t *)"EBS:(44331,0)"},    0}, //EBSKNORR
/* 910*/{0x0B,  44587,  0, {(uint8_t *)"EBS:(44587,0)",                (uint8_t *)"EBS:(44587,0)"},    0}, //EBSKNORR
/* 911*/{0x0B,  44843,  0, {(uint8_t *)"EBS:(44843,0)",                (uint8_t *)"EBS:(44843,0)"},    0}, //EBSKNORR
/* 912*/{0x0B,  45099,  0, {(uint8_t *)"EBS:(45099,0)",                (uint8_t *)"EBS:(45099,0)"},    0}, //EBSKNORR
/* 913*/{0x0B,  45355,  0, {(uint8_t *)"EBS:(45355,0)",                (uint8_t *)"EBS:(45355,0)"},    0}, //EBSKNORR
/* 914*/{0x0B,  45611,  0, {(uint8_t *)"EBS:(45611,0)",                (uint8_t *)"EBS:(45611,0)"},    0}, //EBSKNORR
/* 915*/{0x0B,  45867,  0, {(uint8_t *)"EBS:(45867,0)",                (uint8_t *)"EBS:(45867,0)"},    0}, //EBSKNORR
/* 916*/{0x0B,  43564,  0, {(uint8_t *)"EBS:(43564,0)",                (uint8_t *)"EBS:(43564,0)"},    0}, //EBSKNORR
/* 917*/{0x0B,  43820,  0, {(uint8_t *)"EBS:(43820,0)",                (uint8_t *)"EBS:(43820,0)"},    0}, //EBSKNORR
/* 918*/{0x0B,  44076,  0, {(uint8_t *)"EBS:(44076,0)",                (uint8_t *)"EBS:(44076,0)"},    0}, //EBSKNORR
/* 919*/{0x0B,  44332,  0, {(uint8_t *)"EBS:(44332,0)",                (uint8_t *)"EBS:(44332,0)"},    0}, //EBSKNORR
/* 920*/{0x0B,  44588,  0, {(uint8_t *)"EBS:(44588,0)",                (uint8_t *)"EBS:(44588,0)"},    0}, //EBSKNORR
/* 921*/{0x0B,  44844,  0, {(uint8_t *)"EBS:(44844,0)",                (uint8_t *)"EBS:(44844,0)"},    0}, //EBSKNORR
/* 922*/{0x0B,  45100,  0, {(uint8_t *)"EBS:(45100,0)",                (uint8_t *)"EBS:(45100,0)"},    0}, //EBSKNORR
/* 923*/{0x0B,  45356,  0, {(uint8_t *)"EBS:(45356,0)",                (uint8_t *)"EBS:(45356,0)"},    0}, //EBSKNORR
/* 924*/{0x0B,  45612,  0, {(uint8_t *)"EBS:(45612,0)",                (uint8_t *)"EBS:(45612,0)"},    0}, //EBSKNORR
/* 925*/{0x0B,  45868,  0, {(uint8_t *)"EBS:(45868,0)",                (uint8_t *)"EBS:(45868,0)"},    0}, //EBSKNORR
/* 926*/{0x0B,  46102,  0, {(uint8_t *)"EBS:(46102,0)",                (uint8_t *)"EBS:(46102,0)"},    0}, //EBSKNORR
/* 927*/{0x0B,  46358,  0, {(uint8_t *)"EBS:(46358,0)",                (uint8_t *)"EBS:(46358,0)"},    0}, //EBSKNORR
/* 928*/{0x0B,  46614,  0, {(uint8_t *)"EBS:(46614,0)",                (uint8_t *)"EBS:(46614,0)"},    0}, //EBSKNORR
/* 929*/{0x0B,  46870,  0, {(uint8_t *)"EBS:(46870,0)",                (uint8_t *)"EBS:(46870,0)"},    0}, //EBSKNORR
/* 930*/{0x0B,  47126,  0, {(uint8_t *)"EBS:(47126,0)",                (uint8_t *)"EBS:(47126,0)"},    0}, //EBSKNORR
/* 931*/{0x0B,  47382,  0, {(uint8_t *)"EBS:(47382,0)",                (uint8_t *)"EBS:(47382,0)"},    0}, //EBSKNORR
/* 932*/{0x0B,  47638,  0, {(uint8_t *)"EBS:(47638,0)",                (uint8_t *)"EBS:(47638,0)"},    0}, //EBSKNORR
/* 933*/{0x0B,  47894,  0, {(uint8_t *)"EBS:(47894,0)",                (uint8_t *)"EBS:(47894,0)"},    0}, //EBSKNORR
/* 934*/{0x0B,  48150,  0, {(uint8_t *)"EBS:(48150,0)",                (uint8_t *)"EBS:(48150,0)"},    0}, //EBSKNORR
/* 935*/{0x0B,  48406,  0, {(uint8_t *)"EBS:(48406,0)",                (uint8_t *)"EBS:(48406,0)"},    0}, //EBSKNORR
/* 936*/{0x0B,  46110,  0, {(uint8_t *)"EBS:(46110,0)",                (uint8_t *)"EBS:(46110,0)"},    0}, //EBSKNORR
/* 937*/{0x0B,  46366,  0, {(uint8_t *)"EBS:(46366,0)",                (uint8_t *)"EBS:(46366,0)"},    0}, //EBSKNORR
/* 938*/{0x0B,  46622,  0, {(uint8_t *)"EBS:(46622,0)",                (uint8_t *)"EBS:(46622,0)"},    0}, //EBSKNORR
/* 939*/{0x0B,  46878,  0, {(uint8_t *)"EBS:(46878,0)",                (uint8_t *)"EBS:(46878,0)"},    0}, //EBSKNORR
/* 940*/{0x0B,  47134,  0, {(uint8_t *)"EBS:(47134,0)",                (uint8_t *)"EBS:(47134,0)"},    0}, //EBSKNORR
/* 941*/{0x0B,  47390,  0, {(uint8_t *)"EBS:(47390,0)",                (uint8_t *)"EBS:(47390,0)"},    0}, //EBSKNORR
/* 942*/{0x0B,  47646,  0, {(uint8_t *)"EBS:(47646,0)",                (uint8_t *)"EBS:(47646,0)"},    0}, //EBSKNORR
/* 943*/{0x0B,  47902,  0, {(uint8_t *)"EBS:(47902,0)",                (uint8_t *)"EBS:(47902,0)"},    0}, //EBSKNORR
/* 944*/{0x0B,  48158,  0, {(uint8_t *)"EBS:(48158,0)",                (uint8_t *)"EBS:(48158,0)"},    0}, //EBSKNORR
/* 945*/{0x0B,  48414,  0, {(uint8_t *)"EBS:(48414,0)",                (uint8_t *)"EBS:(48414,0)"},    0}, //EBSKNORR
/* 946*/{0x0B,  46112,  0, {(uint8_t *)"EBS:(46112,0)",                (uint8_t *)"EBS:(46112,0)"},    0}, //EBSKNORR
/* 947*/{0x0B,  46368,  0, {(uint8_t *)"EBS:(46368,0)",                (uint8_t *)"EBS:(46368,0)"},    0}, //EBSKNORR
/* 948*/{0x0B,  46624,  0, {(uint8_t *)"EBS:(46624,0)",                (uint8_t *)"EBS:(46624,0)"},    0}, //EBSKNORR
/* 949*/{0x0B,  46880,  0, {(uint8_t *)"EBS:(46880,0)",                (uint8_t *)"EBS:(46880,0)"},    0}, //EBSKNORR
/* 950*/{0x0B,  47136,  0, {(uint8_t *)"EBS:(47136,0)",                (uint8_t *)"EBS:(47136,0)"},    0}, //EBSKNORR
/* 951*/{0x0B,  47392,  0, {(uint8_t *)"EBS:(47392,0)",                (uint8_t *)"EBS:(47392,0)"},    0}, //EBSKNORR
/* 952*/{0x0B,  47648,  0, {(uint8_t *)"EBS:(47648,0)",                (uint8_t *)"EBS:(47648,0)"},    0}, //EBSKNORR
/* 953*/{0x0B,  47904,  0, {(uint8_t *)"EBS:(47904,0)",                (uint8_t *)"EBS:(47904,0)"},    0}, //EBSKNORR
/* 954*/{0x0B,  48160,  0, {(uint8_t *)"EBS:(48160,0)",                (uint8_t *)"EBS:(48160,0)"},    0}, //EBSKNORR
/* 955*/{0x0B,  48416,  0, {(uint8_t *)"EBS:(48416,0)",                (uint8_t *)"EBS:(48416,0)"},    0}, //EBSKNORR
/* 956*/{0x0B,  46113,  0, {(uint8_t *)"EBS:(46113,0)",                (uint8_t *)"EBS:(46113,0)"},    0}, //EBSKNORR
/* 957*/{0x0B,  46369,  0, {(uint8_t *)"EBS:(46369,0)",                (uint8_t *)"EBS:(46369,0)"},    0}, //EBSKNORR
/* 958*/{0x0B,  46625,  0, {(uint8_t *)"EBS:(46625,0)",                (uint8_t *)"EBS:(46625,0)"},    0}, //EBSKNORR
/* 959*/{0x0B,  46881,  0, {(uint8_t *)"EBS:(46881,0)",                (uint8_t *)"EBS:(46881,0)"},    0}, //EBSKNORR
/* 960*/{0x0B,  47137,  0, {(uint8_t *)"EBS:(47137,0)",                (uint8_t *)"EBS:(47137,0)"},    0}, //EBSKNORR
/* 961*/{0x0B,  47393,  0, {(uint8_t *)"EBS:(47393,0)",                (uint8_t *)"EBS:(47393,0)"},    0}, //EBSKNORR
/* 962*/{0x0B,  47649,  0, {(uint8_t *)"EBS:(47649,0)",                (uint8_t *)"EBS:(47649,0)"},    0}, //EBSKNORR
/* 963*/{0x0B,  47905,  0, {(uint8_t *)"EBS:(47905,0)",                (uint8_t *)"EBS:(47905,0)"},    0}, //EBSKNORR
/* 964*/{0x0B,  48161,  0, {(uint8_t *)"EBS:(48161,0)",                (uint8_t *)"EBS:(48161,0)"},    0}, //EBSKNORR
/* 965*/{0x0B,  48417,  0, {(uint8_t *)"EBS:(48417,0)",                (uint8_t *)"EBS:(48417,0)"},    0}, //EBSKNORR
/* 966*/{0x0B,  46123,  0, {(uint8_t *)"EBS:(46123,0)",                (uint8_t *)"EBS:(46123,0)"},    0}, //EBSKNORR
/* 967*/{0x0B,  46379,  0, {(uint8_t *)"EBS:(46379,0)",                (uint8_t *)"EBS:(46379,0)"},    0}, //EBSKNORR
/* 968*/{0x0B,  46635,  0, {(uint8_t *)"EBS:(46635,0)",                (uint8_t *)"EBS:(46635,0)"},    0}, //EBSKNORR
/* 969*/{0x0B,  46891,  0, {(uint8_t *)"EBS:(46891,0)",                (uint8_t *)"EBS:(46891,0)"},    0}, //EBSKNORR
/* 970*/{0x0B,  47147,  0, {(uint8_t *)"EBS:(47147,0)",                (uint8_t *)"EBS:(47147,0)"},    0}, //EBSKNORR
/* 971*/{0x0B,  47403,  0, {(uint8_t *)"EBS:(47403,0)",                (uint8_t *)"EBS:(47403,0)"},    0}, //EBSKNORR
/* 972*/{0x0B,  47659,  0, {(uint8_t *)"EBS:(47659,0)",                (uint8_t *)"EBS:(47659,0)"},    0}, //EBSKNORR
/* 973*/{0x0B,  47915,  0, {(uint8_t *)"EBS:(47915,0)",                (uint8_t *)"EBS:(47915,0)"},    0}, //EBSKNORR
/* 974*/{0x0B,  48171,  0, {(uint8_t *)"EBS:(48171,0)",                (uint8_t *)"EBS:(48171,0)"},    0}, //EBSKNORR
/* 975*/{0x0B,  48427,  0, {(uint8_t *)"EBS:(48427,0)",                (uint8_t *)"EBS:(48427,0)"},    0}, //EBSKNORR
/* 976*/{0x0B,  48662,  0, {(uint8_t *)"EBS:(48662,0)",                (uint8_t *)"EBS:(48662,0)"},    0}, //EBSKNORR
/* 977*/{0x0B,  48918,  0, {(uint8_t *)"EBS:(48918,0)",                (uint8_t *)"EBS:(48918,0)"},    0}, //EBSKNORR
/* 978*/{0x0B,  49174,  0, {(uint8_t *)"EBS:(49174,0)",                (uint8_t *)"EBS:(49174,0)"},    0}, //EBSKNORR
/* 979*/{0x0B,  49430,  0, {(uint8_t *)"EBS:(49430,0)",                (uint8_t *)"EBS:(49430,0)"},    0}, //EBSKNORR
/* 980*/{0x0B,  49686,  0, {(uint8_t *)"EBS:(49686,0)",                (uint8_t *)"EBS:(49686,0)"},    0}, //EBSKNORR
/* 981*/{0x0B,  49942,  0, {(uint8_t *)"EBS:(49942,0)",                (uint8_t *)"EBS:(49942,0)"},    0}, //EBSKNORR
/* 982*/{0x0B,  50198,  0, {(uint8_t *)"EBS:(50198,0)",                (uint8_t *)"EBS:(50198,0)"},    0}, //EBSKNORR
/* 983*/{0x0B,  50454,  0, {(uint8_t *)"EBS:(50454,0)",                (uint8_t *)"EBS:(50454,0)"},    0}, //EBSKNORR
/* 984*/{0x0B,  50710,  0, {(uint8_t *)"EBS:(50710,0)",                (uint8_t *)"EBS:(50710,0)"},    0}, //EBSKNORR
/* 985*/{0x0B,  50966,  0, {(uint8_t *)"EBS:(50966,0)",                (uint8_t *)"EBS:(50966,0)"},    0}, //EBSKNORR
/* 986*/{0x0B,  48663,  0, {(uint8_t *)"EBS:(48663,0)",                (uint8_t *)"EBS:(48663,0)"},    0}, //EBSKNORR
/* 987*/{0x0B,  48919,  0, {(uint8_t *)"EBS:(48919,0)",                (uint8_t *)"EBS:(48919,0)"},    0}, //EBSKNORR
/* 988*/{0x0B,  49175,  0, {(uint8_t *)"EBS:(49175,0)",                (uint8_t *)"EBS:(49175,0)"},    0}, //EBSKNORR
/* 989*/{0x0B,  49431,  0, {(uint8_t *)"EBS:(49431,0)",                (uint8_t *)"EBS:(49431,0)"},    0}, //EBSKNORR
/* 990*/{0x0B,  49687,  0, {(uint8_t *)"EBS:(49687,0)",                (uint8_t *)"EBS:(49687,0)"},    0}, //EBSKNORR
/* 991*/{0x0B,  49943,  0, {(uint8_t *)"EBS:(49943,0)",                (uint8_t *)"EBS:(49943,0)"},    0}, //EBSKNORR
/* 992*/{0x0B,  50199,  0, {(uint8_t *)"EBS:(50199,0)",                (uint8_t *)"EBS:(50199,0)"},    0}, //EBSKNORR
/* 993*/{0x0B,  50455,  0, {(uint8_t *)"EBS:(50455,0)",                (uint8_t *)"EBS:(50455,0)"},    0}, //EBSKNORR
/* 994*/{0x0B,  50711,  0, {(uint8_t *)"EBS:(50711,0)",                (uint8_t *)"EBS:(50711,0)"},    0}, //EBSKNORR
/* 995*/{0x0B,  50967,  0, {(uint8_t *)"EBS:(50967,0)",                (uint8_t *)"EBS:(50967,0)"},    0}, //EBSKNORR
/* 996*/{0x0B,  48667,  0, {(uint8_t *)"EBS:(48667,0)",                (uint8_t *)"EBS:(48667,0)"},    0}, //EBSKNORR
/* 997*/{0x0B,  48923,  0, {(uint8_t *)"EBS:(48923,0)",                (uint8_t *)"EBS:(48923,0)"},    0}, //EBSKNORR
/* 998*/{0x0B,  49179,  0, {(uint8_t *)"EBS:(49179,0)",                (uint8_t *)"EBS:(49179,0)"},    0}, //EBSKNORR
/* 999*/{0x0B,  49435,  0, {(uint8_t *)"EBS:(49435,0)",                (uint8_t *)"EBS:(49435,0)"},    0}, //EBSKNORR
/*1000*/{0x0B,  49691,  0, {(uint8_t *)"EBS:(49691,0)",                (uint8_t *)"EBS:(49691,0)"},    0}, //EBSKNORR
/*1001*/{0x0B,  49947,  0, {(uint8_t *)"EBS:(49947,0)",                (uint8_t *)"EBS:(49947,0)"},    0}, //EBSKNORR
/*1002*/{0x0B,  50203,  0, {(uint8_t *)"EBS:(50203,0)",                (uint8_t *)"EBS:(50203,0)"},    0}, //EBSKNORR
/*1003*/{0x0B,  50459,  0, {(uint8_t *)"EBS:(50459,0)",                (uint8_t *)"EBS:(50459,0)"},    0}, //EBSKNORR
/*1004*/{0x0B,  50715,  0, {(uint8_t *)"EBS:(50715,0)",                (uint8_t *)"EBS:(50715,0)"},    0}, //EBSKNORR
/*1005*/{0x0B,  50971,  0, {(uint8_t *)"EBS:(50971,0)",                (uint8_t *)"EBS:(50971,0)"},    0}, //EBSKNORR
/*1006*/{0x0B,  48668,  0, {(uint8_t *)"EBS:(48668,0)",                (uint8_t *)"EBS:(48668,0)"},    0}, //EBSKNORR
/*1007*/{0x0B,  48924,  0, {(uint8_t *)"EBS:(48924,0)",                (uint8_t *)"EBS:(48924,0)"},    0}, //EBSKNORR
/*1008*/{0x0B,  49180,  0, {(uint8_t *)"EBS:(49180,0)",                (uint8_t *)"EBS:(49180,0)"},    0}, //EBSKNORR
/*1009*/{0x0B,  49436,  0, {(uint8_t *)"EBS:(49436,0)",                (uint8_t *)"EBS:(49436,0)"},    0}, //EBSKNORR
/*1010*/{0x0B,  49692,  0, {(uint8_t *)"EBS:(49692,0)",                (uint8_t *)"EBS:(49692,0)"},    0}, //EBSKNORR
/*1011*/{0x0B,  49948,  0, {(uint8_t *)"EBS:(49948,0)",                (uint8_t *)"EBS:(49948,0)"},    0}, //EBSKNORR
/*1012*/{0x0B,  50204,  0, {(uint8_t *)"EBS:(50204,0)",                (uint8_t *)"EBS:(50204,0)"},    0}, //EBSKNORR
/*1013*/{0x0B,  50460,  0, {(uint8_t *)"EBS:(50460,0)",                (uint8_t *)"EBS:(50460,0)"},    0}, //EBSKNORR
/*1014*/{0x0B,  50716,  0, {(uint8_t *)"EBS:(50716,0)",                (uint8_t *)"EBS:(50716,0)"},    0}, //EBSKNORR
/*1015*/{0x0B,  50972,  0, {(uint8_t *)"EBS:(50972,0)",                (uint8_t *)"EBS:(50972,0)"},    0}, //EBSKNORR
/*1016*/{0x0B,  51260,  0, {(uint8_t *)"EBS:(51260,0)",                (uint8_t *)"EBS:(51260,0)"},    0}, //EBSKNORR
/*1017*/{0x0B,  51516,  0, {(uint8_t *)"EBS:(51516,0)",                (uint8_t *)"EBS:(51516,0)"},    0}, //EBSKNORR
/*1018*/{0x0B,  51772,  0, {(uint8_t *)"EBS:(51772,0)",                (uint8_t *)"EBS:(51772,0)"},    0}, //EBSKNORR
/*1019*/{0x0B,  52028,  0, {(uint8_t *)"EBS:(52028,0)",                (uint8_t *)"EBS:(52028,0)"},    0}, //EBSKNORR
/*1020*/{0x0B,  52284,  0, {(uint8_t *)"EBS:(52284,0)",                (uint8_t *)"EBS:(52284,0)"},    0}, //EBSKNORR
/*1021*/{0x0B,  52540,  0, {(uint8_t *)"EBS:(52540,0)",                (uint8_t *)"EBS:(52540,0)"},    0}, //EBSKNORR
/*1022*/{0x0B,  52796,  0, {(uint8_t *)"EBS:(52796,0)",                (uint8_t *)"EBS:(52796,0)"},    0}, //EBSKNORR
/*1023*/{0x0B,  53052,  0, {(uint8_t *)"EBS:(53052,0)",                (uint8_t *)"EBS:(53052,0)"},    0}, //EBSKNORR
/*1024*/{0x0B,  53308,  0, {(uint8_t *)"EBS:(53308,0)",                (uint8_t *)"EBS:(53308,0)"},    0}, //EBSKNORR
/*1025*/{0x0B,  53564,  0, {(uint8_t *)"EBS:(53564,0)",                (uint8_t *)"EBS:(53564,0)"},    0}, //EBSKNORR
/*1026*/{0x0B,  51261,  0, {(uint8_t *)"EBS:(51261,0)",                (uint8_t *)"EBS:(51261,0)"},    0}, //EBSKNORR
/*1027*/{0x0B,  51517,  0, {(uint8_t *)"EBS:(51517,0)",                (uint8_t *)"EBS:(51517,0)"},    0}, //EBSKNORR
/*1028*/{0x0B,  51773,  0, {(uint8_t *)"EBS:(51773,0)",                (uint8_t *)"EBS:(51773,0)"},    0}, //EBSKNORR
/*1029*/{0x0B,  52029,  0, {(uint8_t *)"EBS:(52029,0)",                (uint8_t *)"EBS:(52029,0)"},    0}, //EBSKNORR
/*1030*/{0x0B,  52285,  0, {(uint8_t *)"EBS:(52285,0)",                (uint8_t *)"EBS:(52285,0)"},    0}, //EBSKNORR
/*1031*/{0x0B,  52541,  0, {(uint8_t *)"EBS:(52541,0)",                (uint8_t *)"EBS:(52541,0)"},    0}, //EBSKNORR
/*1032*/{0x0B,  52797,  0, {(uint8_t *)"EBS:(52797,0)",                (uint8_t *)"EBS:(52797,0)"},    0}, //EBSKNORR
/*1033*/{0x0B,  53053,  0, {(uint8_t *)"EBS:(53053,0)",                (uint8_t *)"EBS:(53053,0)"},    0}, //EBSKNORR
/*1034*/{0x0B,  53309,  0, {(uint8_t *)"EBS:(53309,0)",                (uint8_t *)"EBS:(53309,0)"},    0}, //EBSKNORR
/*1035*/{0x0B,  53565,  0, {(uint8_t *)"EBS:(53565,0)",                (uint8_t *)"EBS:(53565,0)"},    0}, //EBSKNORR
/*1036*/{0x0B,  51262,  0, {(uint8_t *)"EBS:(51262,0)",                (uint8_t *)"EBS:(51262,0)"},    0}, //EBSKNORR
/*1037*/{0x0B,  51518,  0, {(uint8_t *)"EBS:(51518,0)",                (uint8_t *)"EBS:(51518,0)"},    0}, //EBSKNORR
/*1038*/{0x0B,  51774,  0, {(uint8_t *)"EBS:(51774,0)",                (uint8_t *)"EBS:(51774,0)"},    0}, //EBSKNORR
/*1039*/{0x0B,  52030,  0, {(uint8_t *)"EBS:(52030,0)",                (uint8_t *)"EBS:(52030,0)"},    0}, //EBSKNORR
/*1040*/{0x0B,  52286,  0, {(uint8_t *)"EBS:(52286,0)",                (uint8_t *)"EBS:(52286,0)"},    0}, //EBSKNORR
/*1041*/{0x0B,  52542,  0, {(uint8_t *)"EBS:(52542,0)",                (uint8_t *)"EBS:(52542,0)"},    0}, //EBSKNORR
/*1042*/{0x0B,  52798,  0, {(uint8_t *)"EBS:(52798,0)",                (uint8_t *)"EBS:(52798,0)"},    0}, //EBSKNORR
/*1043*/{0x0B,  53054,  0, {(uint8_t *)"EBS:(53054,0)",                (uint8_t *)"EBS:(53054,0)"},    0}, //EBSKNORR
/*1044*/{0x0B,  53310,  0, {(uint8_t *)"EBS:(53310,0)",                (uint8_t *)"EBS:(53310,0)"},    0}, //EBSKNORR
/*1045*/{0x0B,  53566,  0, {(uint8_t *)"EBS:(53566,0)",                (uint8_t *)"EBS:(53566,0)"},    0}, //EBSKNORR
/*1046*/{0x0B,  51263,  0, {(uint8_t *)"EBS:(51263,0)",                (uint8_t *)"EBS:(51263,0)"},    0}, //EBSKNORR
/*1047*/{0x0B,  51519,  0, {(uint8_t *)"EBS:(51519,0)",                (uint8_t *)"EBS:(51519,0)"},    0}, //EBSKNORR
/*1048*/{0x0B,  51775,  0, {(uint8_t *)"EBS:(51775,0)",                (uint8_t *)"EBS:(51775,0)"},    0}, //EBSKNORR
/*1049*/{0x0B,  52031,  0, {(uint8_t *)"EBS:(52031,0)",                (uint8_t *)"EBS:(52031,0)"},    0}, //EBSKNORR
/*1050*/{0x0B,  52287,  0, {(uint8_t *)"EBS:(52287,0)",                (uint8_t *)"EBS:(52287,0)"},    0}, //EBSKNORR
/*1051*/{0x0B,  52543,  0, {(uint8_t *)"EBS:(52543,0)",                (uint8_t *)"EBS:(52543,0)"},    0}, //EBSKNORR
/*1052*/{0x0B,  52799,  0, {(uint8_t *)"EBS:(52799,0)",                (uint8_t *)"EBS:(52799,0)"},    0}, //EBSKNORR
/*1053*/{0x0B,  53055,  0, {(uint8_t *)"EBS:(53055,0)",                (uint8_t *)"EBS:(53055,0)"},    0}, //EBSKNORR
/*1054*/{0x0B,  53311,  0, {(uint8_t *)"EBS:(53311,0)",                (uint8_t *)"EBS:(53311,0)"},    0}, //EBSKNORR
/*1055*/{0x0B,  53567,  0, {(uint8_t *)"EBS:(53567,0)",                (uint8_t *)"EBS:(53567,0)"},    0}, //EBSKNORR
/*1056*/{0x0B,  51266,  0, {(uint8_t *)"EBS:(51266,0)",                (uint8_t *)"EBS:(51266,0)"},    0}, //EBSKNORR
/*1057*/{0x0B,  51522,  0, {(uint8_t *)"EBS:(51522,0)",                (uint8_t *)"EBS:(51522,0)"},    0}, //EBSKNORR
/*1058*/{0x0B,  51778,  0, {(uint8_t *)"EBS:(51778,0)",                (uint8_t *)"EBS:(51778,0)"},    0}, //EBSKNORR
/*1059*/{0x0B,  52034,  0, {(uint8_t *)"EBS:(52034,0)",                (uint8_t *)"EBS:(52034,0)"},    0}, //EBSKNORR
/*1060*/{0x0B,  52290,  0, {(uint8_t *)"EBS:(52290,0)",                (uint8_t *)"EBS:(52290,0)"},    0}, //EBSKNORR
/*1061*/{0x0B,  52546,  0, {(uint8_t *)"EBS:(52546,0)",                (uint8_t *)"EBS:(52546,0)"},    0}, //EBSKNORR
/*1062*/{0x0B,  52802,  0, {(uint8_t *)"EBS:(52802,0)",                (uint8_t *)"EBS:(52802,0)"},    0}, //EBSKNORR
/*1063*/{0x0B,  53058,  0, {(uint8_t *)"EBS:(53058,0)",                (uint8_t *)"EBS:(53058,0)"},    0}, //EBSKNORR
/*1064*/{0x0B,  53314,  0, {(uint8_t *)"EBS:(53314,0)",                (uint8_t *)"EBS:(53314,0)"},    0}, //EBSKNORR
/*1065*/{0x0B,  53570,  0, {(uint8_t *)"EBS:(53570,0)",                (uint8_t *)"EBS:(53570,0)"},    0}, //EBSKNORR
/*1066*/{0x0B,  51267,  0, {(uint8_t *)"EBS:(51267,0)",                (uint8_t *)"EBS:(51267,0)"},    0}, //EBSKNORR
/*1067*/{0x0B,  51523,  0, {(uint8_t *)"EBS:(51523,0)",                (uint8_t *)"EBS:(51523,0)"},    0}, //EBSKNORR
/*1068*/{0x0B,  51779,  0, {(uint8_t *)"EBS:(51779,0)",                (uint8_t *)"EBS:(51779,0)"},    0}, //EBSKNORR
/*1069*/{0x0B,  52035,  0, {(uint8_t *)"EBS:(52035,0)",                (uint8_t *)"EBS:(52035,0)"},    0}, //EBSKNORR
/*1070*/{0x0B,  52291,  0, {(uint8_t *)"EBS:(52291,0)",                (uint8_t *)"EBS:(52291,0)"},    0}, //EBSKNORR
/*1071*/{0x0B,  52547,  0, {(uint8_t *)"EBS:(52547,0)",                (uint8_t *)"EBS:(52547,0)"},    0}, //EBSKNORR
/*1072*/{0x0B,  52803,  0, {(uint8_t *)"EBS:(52803,0)",                (uint8_t *)"EBS:(52803,0)"},    0}, //EBSKNORR
/*1073*/{0x0B,  53059,  0, {(uint8_t *)"EBS:(53059,0)",                (uint8_t *)"EBS:(53059,0)"},    0}, //EBSKNORR
/*1074*/{0x0B,  53315,  0, {(uint8_t *)"EBS:(53315,0)",                (uint8_t *)"EBS:(53315,0)"},    0}, //EBSKNORR
/*1075*/{0x0B,  53571,  0, {(uint8_t *)"EBS:(53571,0)",                (uint8_t *)"EBS:(53571,0)"},    0}, //EBSKNORR
/*1076*/{0x0B,  51268,  0, {(uint8_t *)"EBS:(51268,0)",                (uint8_t *)"EBS:(51268,0)"},    0}, //EBSKNORR
/*1077*/{0x0B,  51524,  0, {(uint8_t *)"EBS:(51524,0)",                (uint8_t *)"EBS:(51524,0)"},    0}, //EBSKNORR
/*1078*/{0x0B,  51780,  0, {(uint8_t *)"EBS:(51780,0)",                (uint8_t *)"EBS:(51780,0)"},    0}, //EBSKNORR
/*1079*/{0x0B,  52036,  0, {(uint8_t *)"EBS:(52036,0)",                (uint8_t *)"EBS:(52036,0)"},    0}, //EBSKNORR
/*1080*/{0x0B,  52292,  0, {(uint8_t *)"EBS:(52292,0)",                (uint8_t *)"EBS:(52292,0)"},    0}, //EBSKNORR
/*1081*/{0x0B,  52548,  0, {(uint8_t *)"EBS:(52548,0)",                (uint8_t *)"EBS:(52548,0)"},    0}, //EBSKNORR
/*1082*/{0x0B,  52804,  0, {(uint8_t *)"EBS:(52804,0)",                (uint8_t *)"EBS:(52804,0)"},    0}, //EBSKNORR
/*1083*/{0x0B,  53060,  0, {(uint8_t *)"EBS:(53060,0)",                (uint8_t *)"EBS:(53060,0)"},    0}, //EBSKNORR
/*1084*/{0x0B,  53316,  0, {(uint8_t *)"EBS:(53316,0)",                (uint8_t *)"EBS:(53316,0)"},    0}, //EBSKNORR
/*1085*/{0x0B,  53572,  0, {(uint8_t *)"EBS:(53572,0)",                (uint8_t *)"EBS:(53572,0)"},    0}, //EBSKNORR
/*1086*/{0x0B,  51269,  0, {(uint8_t *)"EBS:(51269,0)",                (uint8_t *)"EBS:(51269,0)"},    0}, //EBSKNORR
/*1087*/{0x0B,  51525,  0, {(uint8_t *)"EBS:(51525,0)",                (uint8_t *)"EBS:(51525,0)"},    0}, //EBSKNORR
/*1088*/{0x0B,  51781,  0, {(uint8_t *)"EBS:(51781,0)",                (uint8_t *)"EBS:(51781,0)"},    0}, //EBSKNORR
/*1089*/{0x0B,  52037,  0, {(uint8_t *)"EBS:(52037,0)",                (uint8_t *)"EBS:(52037,0)"},    0}, //EBSKNORR
/*1090*/{0x0B,  52293,  0, {(uint8_t *)"EBS:(52293,0)",                (uint8_t *)"EBS:(52293,0)"},    0}, //EBSKNORR
/*1091*/{0x0B,  52549,  0, {(uint8_t *)"EBS:(52549,0)",                (uint8_t *)"EBS:(52549,0)"},    0}, //EBSKNORR
/*1092*/{0x0B,  52805,  0, {(uint8_t *)"EBS:(52805,0)",                (uint8_t *)"EBS:(52805,0)"},    0}, //EBSKNORR
/*1093*/{0x0B,  53061,  0, {(uint8_t *)"EBS:(53061,0)",                (uint8_t *)"EBS:(53061,0)"},    0}, //EBSKNORR
/*1094*/{0x0B,  53317,  0, {(uint8_t *)"EBS:(53317,0)",                (uint8_t *)"EBS:(53317,0)"},    0}, //EBSKNORR
/*1095*/{0x0B,  53573,  0, {(uint8_t *)"EBS:(53573,0)",                (uint8_t *)"EBS:(53573,0)"},    0}, //EBSKNORR
/*1096*/{0x0B,  51270,  0, {(uint8_t *)"EBS:(51270,0)",                (uint8_t *)"EBS:(51270,0)"},    0}, //EBSKNORR
/*1097*/{0x0B,  51526,  0, {(uint8_t *)"EBS:(51526,0)",                (uint8_t *)"EBS:(51526,0)"},    0}, //EBSKNORR
/*1098*/{0x0B,  51782,  0, {(uint8_t *)"EBS:(51782,0)",                (uint8_t *)"EBS:(51782,0)"},    0}, //EBSKNORR
/*1099*/{0x0B,  52038,  0, {(uint8_t *)"EBS:(52038,0)",                (uint8_t *)"EBS:(52038,0)"},    0}, //EBSKNORR
/*1100*/{0x0B,  52294,  0, {(uint8_t *)"EBS:(52294,0)",                (uint8_t *)"EBS:(52294,0)"},    0}, //EBSKNORR
/*1101*/{0x0B,  52550,  0, {(uint8_t *)"EBS:(52550,0)",                (uint8_t *)"EBS:(52550,0)"},    0}, //EBSKNORR
/*1102*/{0x0B,  52806,  0, {(uint8_t *)"EBS:(52806,0)",                (uint8_t *)"EBS:(52806,0)"},    0}, //EBSKNORR
/*1103*/{0x0B,  53062,  0, {(uint8_t *)"EBS:(53062,0)",                (uint8_t *)"EBS:(53062,0)"},    0}, //EBSKNORR
/*1104*/{0x0B,  53318,  0, {(uint8_t *)"EBS:(53318,0)",                (uint8_t *)"EBS:(53318,0)"},    0}, //EBSKNORR
/*1105*/{0x0B,  53574,  0, {(uint8_t *)"EBS:(53574,0)",                (uint8_t *)"EBS:(53574,0)"},    0}, //EBSKNORR
/*1106*/{0x0B,  51271,  0, {(uint8_t *)"EBS:(51271,0)",                (uint8_t *)"EBS:(51271,0)"},    0}, //EBSKNORR
/*1107*/{0x0B,  51527,  0, {(uint8_t *)"EBS:(51527,0)",                (uint8_t *)"EBS:(51527,0)"},    0}, //EBSKNORR
/*1108*/{0x0B,  51783,  0, {(uint8_t *)"EBS:(51783,0)",                (uint8_t *)"EBS:(51783,0)"},    0}, //EBSKNORR
/*1109*/{0x0B,  52039,  0, {(uint8_t *)"EBS:(52039,0)",                (uint8_t *)"EBS:(52039,0)"},    0}, //EBSKNORR
/*1110*/{0x0B,  52295,  0, {(uint8_t *)"EBS:(52295,0)",                (uint8_t *)"EBS:(52295,0)"},    0}, //EBSKNORR
/*1111*/{0x0B,  52551,  0, {(uint8_t *)"EBS:(52551,0)",                (uint8_t *)"EBS:(52551,0)"},    0}, //EBSKNORR
/*1112*/{0x0B,  52807,  0, {(uint8_t *)"EBS:(52807,0)",                (uint8_t *)"EBS:(52807,0)"},    0}, //EBSKNORR
/*1113*/{0x0B,  53063,  0, {(uint8_t *)"EBS:(53063,0)",                (uint8_t *)"EBS:(53063,0)"},    0}, //EBSKNORR
/*1114*/{0x0B,  53319,  0, {(uint8_t *)"EBS:(53319,0)",                (uint8_t *)"EBS:(53319,0)"},    0}, //EBSKNORR
/*1115*/{0x0B,  53575,  0, {(uint8_t *)"EBS:(53575,0)",                (uint8_t *)"EBS:(53575,0)"},    0}, //EBSKNORR
/*1116*/{0x0B,  65025,  0, {(uint8_t *)"EBS:(65025,0)",                (uint8_t *)"EBS:(65025,0)"},    0}, //EBSKNORR
/*1117*/{0x0B,  65026,  0, {(uint8_t *)"EBS:(65026,0)",                (uint8_t *)"EBS:(65026,0)"},    0}, //EBSKNORR
/*1118*/{0x0B,  65113,  0, {(uint8_t *)"EBS:(65113,0)",                (uint8_t *)"EBS:(65113,0)"},    0}, //EBSKNORR
/*1119*/{0x0B,  65229,  0, {(uint8_t *)"EBS:(65229,0)",                (uint8_t *)"EBS:(65229,0)"},    0}, //EBSKNORR
/*1120*/{0x0B,  24832,  0, {(uint8_t *)"EBS:(24832,0)",                (uint8_t *)"EBS:(24832,0)"},    0}, //EBSKNORR
/*1121*/{0x0B,  24864,  0, {(uint8_t *)"EBS:(24864,0)",                (uint8_t *)"EBS:(24864,0)"},    0}, //EBSKNORR
/*1122*/{0x0B,  13012,  0, {(uint8_t *)"EBS:SAS传感器未标定(13012,0)",   (uint8_t *)"EBS:(13012,0)"},    0}, //EBSKNORR
/*1123*/{0x0B,  13268,  0, {(uint8_t *)"EBS:SAS传感器未标定(13268,0)",   (uint8_t *)"EBS:(13268,0)"},    0}, //EBSKNORR
/*1124*/{0x0B,  13270,  0, {(uint8_t *)"EBS:SAS传感器未标定(13270,0)",   (uint8_t *)"EBS:(13270,0)"},    0}, //EBSKNORR
/*1125*/{0x0B,  13281,  0, {(uint8_t *)"EBS:SAS传感器未标定(13281,0)",   (uint8_t *)"EBS:(13281,0)"},    0}, //EBSKNORR
/*1126*/{0x0B,  13282,  0, {(uint8_t *)"EBS:SAS传感器未标定(13282,0)",   (uint8_t *)"EBS:(13282,0)"},    0}, //EBSKNORR
/*1127*/{0x0B,  13793,  0, {(uint8_t *)"EBS:ESC传感器未标定(13793,0)",   (uint8_t *)"EBS:(13793,0)"},    0}, //EBSKNORR
/*1128*/{0x0B,  13795,  0, {(uint8_t *)"EBS:ESC传感器未标定(13795,0)",   (uint8_t *)"EBS:(13795,0)"},    0}, //EBSKNORR
/*1129*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1130*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1131*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1132*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1133*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1134*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1135*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1136*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1137*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1138*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1139*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1140*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1141*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1142*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1143*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1144*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1145*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1146*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1147*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1148*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1149*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1150*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1151*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1152*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1153*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1154*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1155*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1156*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1157*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1158*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1159*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1160*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1161*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1162*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1163*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1164*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1165*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1166*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1167*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1168*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1169*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1170*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1171*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1172*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1173*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1174*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1175*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1176*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1177*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1178*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1179*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1180*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1181*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1182*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1183*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1184*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1185*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1186*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1187*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1188*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1189*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1190*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1191*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1192*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1193*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1194*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1195*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1196*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1197*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1198*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1199*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1200*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1201*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1202*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1203*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1204*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1205*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1206*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR
/*1207*/{0x0B,0xFFFFF,0xFF, {(uint8_t *)"",                (uint8_t *)""},    0}, //EBSKNORR

/*1208*/{0x32, 518100,  5, {(uint8_t *)"BCM:位置灯继电器或线路故障(518100,5)",     (uint8_t *)"BCM:(518100,5)"},  0}, //BCM
/*1209*/{0x32, 518100,  6, {(uint8_t *)"BCM:位置灯继电器或线路故障(518100,6)",     (uint8_t *)"BCM:(518100,6)"},  0}, //BCM
/*1210*/{0x32, 518101,  5, {(uint8_t *)"BCM:远光灯继电器或线路故障(518101,5)",     (uint8_t *)"BCM:(518101,5)"},  0}, //BCM
/*1211*/{0x32, 518101,  6, {(uint8_t *)"BCM:远光灯继电器或线路故障(518101,6)",     (uint8_t *)"BCM:(518101,6)"},  0}, //BCM
/*1212*/{0x32, 518102,  5, {(uint8_t *)"BCM:辅助远光灯继电器或线路故障(518102,5)", (uint8_t *)"BCM:(518102,5)"},  0}, //BCM
/*1213*/{0x32, 518102,  6, {(uint8_t *)"BCM:辅助远光灯继电器或线路故障(518102,6)", (uint8_t *)"BCM:(518102,6)"},  0}, //BCM
/*1214*/{0x32, 518103,  5, {(uint8_t *)"BCM:近光灯继电器或线路故障(518103,5)",     (uint8_t *)"BCM:(518103,5)"},  0}, //BCM
/*1215*/{0x32, 518103,  6, {(uint8_t *)"BCM:近光灯继电器或线路故障(518103,6)",     (uint8_t *)"BCM:(518103,6)"},  0}, //BCM
/*1216*/{0x32, 518104,  5, {(uint8_t *)"BCM:前雾灯继电器或线路故障(518104,5)",     (uint8_t *)"BCM:(518104,5)"},  0}, //BCM
/*1217*/{0x32, 518104,  6, {(uint8_t *)"BCM:前雾灯继电器或线路故障(518104,6)",     (uint8_t *)"BCM:(518104,6)"},  0}, //BCM
/*1218*/{0x32, 518105,  6, {(uint8_t *)"BCM:昼间行车灯或线路故障(518105,6)",       (uint8_t *)"BCM:(518105,6)"},  0}, //BCM
/*1219*/{0x32, 518106,  5, {(uint8_t *)"BCM:主车左前转向灯或线路故障(518106,5)",   (uint8_t *)"BCM:(518106,5)"},  0}, //BCM
/*1220*/{0x32, 518106,  6, {(uint8_t *)"BCM:主车左前转向灯或线路故障(518106,6)",   (uint8_t *)"BCM:(518106,6)"},  0}, //BCM
/*1221*/{0x32, 518107,  5, {(uint8_t *)"BCM:主车右前转向灯或线路故障(518107,5)",   (uint8_t *)"BCM:(518107,5)"},  0}, //BCM
/*1222*/{0x32, 518107,  6, {(uint8_t *)"BCM:主车右前转向灯或线路故障(518107,6)",   (uint8_t *)"BCM:(518107,6)"},  0}, //BCM
/*1223*/{0x32, 518108,  5, {(uint8_t *)"BCM:主车左侧转向灯或线路故障(518108,5)",   (uint8_t *)"BCM:(518108,5)"},  0}, //BCM
/*1224*/{0x32, 518108,  6, {(uint8_t *)"BCM:主车左侧转向灯或线路故障(518108,6)",   (uint8_t *)"BCM:(518108,6)"},  0}, //BCM
/*1225*/{0x32, 518108, 13, {(uint8_t *)"BCM:主车左侧转向灯或线路故障(518108,13)",  (uint8_t *)"BCM:(518108,13)"}, 0}, //BCM
/*1226*/{0x32, 518109,  5, {(uint8_t *)"BCM:主车右侧转向灯或线路故障(518109,5)",   (uint8_t *)"BCM:(518109,5)"},  0}, //BCM
/*1227*/{0x32, 518109,  6, {(uint8_t *)"BCM:主车右侧转向灯或线路故障(518109,6)",   (uint8_t *)"BCM:(518109,6)"},  0}, //BCM
/*1228*/{0x32, 518109, 13, {(uint8_t *)"BCM:主车右侧转向灯或线路故障(518109,13)",  (uint8_t *)"BCM:(518109,13)"}, 0}, //BCM
/*1229*/{0x32, 518110,  5, {(uint8_t *)"BCM:主车左后转向灯或线路故障(518110,5)",   (uint8_t *)"BCM:(518110,5)"},  0}, //BCM
/*1230*/{0x32, 518110,  6, {(uint8_t *)"BCM:主车左后转向灯或线路故障(518110,6)",   (uint8_t *)"BCM:(518110,6)"},  0}, //BCM
/*1231*/{0x32, 518110, 13, {(uint8_t *)"BCM:主车左后转向灯或线路故障(518110,13)",  (uint8_t *)"BCM:(518110,13)"}, 0}, //BCM
/*1232*/{0x32, 518111,  5, {(uint8_t *)"BCM:主车右后转向灯或线路故障(518111,5)",   (uint8_t *)"BCM:(518111,5)"},  0}, //BCM
/*1233*/{0x32, 518111,  6, {(uint8_t *)"BCM:主车右后转向灯或线路故障(518111,6)",   (uint8_t *)"BCM:(518111,6)"},  0}, //BCM
/*1234*/{0x32, 518111, 13, {(uint8_t *)"BCM:主车右后转向灯或线路故障(518111,13)",  (uint8_t *)"BCM:(518111,13)"}, 0}, //BCM
/*1235*/{0x32, 518112,  5, {(uint8_t *)"BCM:主车制动灯或线路故障(518112,5)",       (uint8_t *)"BCM:(518112,5)"},  0}, //BCM
/*1236*/{0x32, 518112,  6, {(uint8_t *)"BCM:主车制动灯或线路故障(518112,6)",       (uint8_t *)"BCM:(518112,6)"},  0}, //BCM
/*1237*/{0x32, 518112, 13, {(uint8_t *)"BCM:主车制动灯或线路故障(518112,13)",      (uint8_t *)"BCM:(518112,13)"}, 0}, //BCM
/*1238*/{0x32, 518113,  5, {(uint8_t *)"BCM:主车倒车灯或线路故障(518113,5)",       (uint8_t *)"BCM:(518113,5)"},  0}, //BCM
/*1239*/{0x32, 518113,  6, {(uint8_t *)"BCM:主车倒车灯或线路故障(518113,6)",       (uint8_t *)"BCM:(518113,6)"},  0}, //BCM
/*1240*/{0x32, 518113, 13, {(uint8_t *)"BCM:主车倒车灯或线路故障(518113,13)",      (uint8_t *)"BCM:(518113,13)"}, 0}, //BCM
/*1241*/{0x32, 518114,  5, {(uint8_t *)"BCM:主车后雾灯或线路故障(518114,5)",       (uint8_t *)"BCM:(518114,5)"},  0}, //BCM
/*1242*/{0x32, 518114,  6, {(uint8_t *)"BCM:主车后雾灯或线路故障(518114,6)",       (uint8_t *)"BCM:(518114,6)"},  0}, //BCM
/*1243*/{0x32, 518114, 13, {(uint8_t *)"BCM:主车后雾灯或线路故障(518114,13)",      (uint8_t *)"BCM:(518114,13)"}, 0}, //BCM
/*1244*/{0x32, 518115,  5, {(uint8_t *)"BCM:主车后位置灯或线路故障(518115,5)",     (uint8_t *)"BCM:(518115,5)"},  0}, //BCM
/*1245*/{0x32, 518115,  6, {(uint8_t *)"BCM:主车后位置灯或线路故障(518115,6)",     (uint8_t *)"BCM:(518115,6)"},  0}, //BCM
/*1246*/{0x32, 518115, 13, {(uint8_t *)"BCM:主车后位置灯或线路故障(518115,13)",    (uint8_t *)"BCM:(518115,13)"}, 0}, //BCM
/*1247*/{0x32, 518116,  5, {(uint8_t *)"BCM:挂车左转向灯或线路故障(518116,5)",     (uint8_t *)"BCM:(518116,5)"},  0}, //BCM
/*1248*/{0x32, 518116,  6, {(uint8_t *)"BCM:挂车左转向灯或线路故障(518116,6)",     (uint8_t *)"BCM:(518116,6)"},  0}, //BCM
/*1249*/{0x32, 518116, 13, {(uint8_t *)"BCM:挂车左转向灯或线路故障(518116,13)",    (uint8_t *)"BCM:(518116,13)"}, 0}, //BCM
/*1250*/{0x32, 518117,  5, {(uint8_t *)"BCM:挂车右转向灯或线路故障(518117,5)",     (uint8_t *)"BCM:(518117,5)"},  0}, //BCM
/*1251*/{0x32, 518117,  6, {(uint8_t *)"BCM:挂车右转向灯或线路故障(518117,6)",     (uint8_t *)"BCM:(518117,6)"},  0}, //BCM
/*1252*/{0x32, 518117, 13, {(uint8_t *)"BCM:挂车右转向灯或线路故障(518117,13)",    (uint8_t *)"BCM:(518117,13)"}, 0}, //BCM
/*1253*/{0x32, 518118,  5, {(uint8_t *)"BCM:挂车制动灯或线路故障(518118,5)",       (uint8_t *)"BCM:(518118,5)"},  0}, //BCM
/*1254*/{0x32, 518118,  6, {(uint8_t *)"BCM:挂车制动灯或线路故障(518118,6)",       (uint8_t *)"BCM:(518118,6)"},  0}, //BCM
/*1255*/{0x32, 518118, 13, {(uint8_t *)"BCM:挂车制动灯或线路故障(518118,13)",      (uint8_t *)"BCM:(518118,13)"}, 0}, //BCM
/*1256*/{0x32, 518119,  5, {(uint8_t *)"BCM:挂车制动灯或线路故障(518119,5)",       (uint8_t *)"BCM:(518119,5)"},  0}, //BCM
/*1257*/{0x32, 518119,  6, {(uint8_t *)"BCM:挂车倒车灯或线路故障(518119,6)",       (uint8_t *)"BCM:(518119,6)"},  0}, //BCM
/*1258*/{0x32, 518119, 13, {(uint8_t *)"BCM:挂车倒车灯或线路故障(518119,13)",      (uint8_t *)"BCM:(518119,13)"}, 0}, //BCM
/*1259*/{0x32, 518120,  5, {(uint8_t *)"BCM:挂车倒车灯或线路故障(518120,5)",       (uint8_t *)"BCM:(518120,5)"},  0}, //BCM
/*1260*/{0x32, 518120,  6, {(uint8_t *)"BCM:挂车后雾灯或线路故障(518120,6)",       (uint8_t *)"BCM:(518120,6)"},  0}, //BCM
/*1261*/{0x32, 518120, 13, {(uint8_t *)"BCM:挂车后雾灯或线路故障(518120,13)",      (uint8_t *)"BCM:(518120,13)"}, 0}, //BCM
/*1262*/{0x32, 518121,  5, {(uint8_t *)"BCM:雨刮高速继电器或线路故障(518121,5)",   (uint8_t *)"BCM:(518121,5)"},  0}, //BCM
/*1263*/{0x32, 518121,  6, {(uint8_t *)"BCM:雨刮高速继电器或线路故障(518121,6)",   (uint8_t *)"BCM:(518121,6)"},  0}, //BCM
/*1264*/{0x32, 518122,  5, {(uint8_t *)"BCM:雨刮低速继电器或线路故障(518122,5)",   (uint8_t *)"BCM:(518122,5)"},  0}, //BCM
/*1265*/{0x32, 518122,  6, {(uint8_t *)"BCM:雨刮低速继电器或线路故障(518122,6)",   (uint8_t *)"BCM:(518122,6)"},  0}, //BCM
/*1266*/{0x32, 518123,  5, {(uint8_t *)"BCM:洗涤电机或线路故障(518123,5)",         (uint8_t *)"BCM:(518123,5)"},  0}, //BCM
/*1267*/{0x32, 518123,  6, {(uint8_t *)"BCM:洗涤电机或线路故障(518123,6)",         (uint8_t *)"BCM:(518123,6)"},  0}, //BCM
/*1268*/{0x32, 518123, 13, {(uint8_t *)"BCM:洗涤电机或线路故障(518123,13)",        (uint8_t *)"BCM:(518123,13)"}, 0}, //BCM
/*1269*/{0x32, 518124,  6, {(uint8_t *)"BCM:危险报警指示灯或线路故障(518124,6)",   (uint8_t *)"BCM:(518124,6)"},  0}, //BCM
/*1270*/{0x32, 518125,  6, {(uint8_t *)"BCM:灯光旋钮背光灯或线路故障(518125,6)",   (uint8_t *)"BCM:(518125,6)"},  0}, //BCM
/*1271*/{0x32, 518126,  5, {(uint8_t *)"BCM:电源1故障(518126,5)",                  (uint8_t *)"BCM:(518126,5)"},  0}, //BCM
/*1272*/{0x32, 518127,  5, {(uint8_t *)"BCM:电源2故障(518127,5)",                  (uint8_t *)"BCM:(518127,5)"},  0}, //BCM
/*1273*/{0x32, 518128,  5, {(uint8_t *)"BCM:电源3故障(518128,5)",                  (uint8_t *)"BCM:(518128,5)"},  0}, //BCM
/*1274*/{0x32, 518129,  5, {(uint8_t *)"BCM:电源4故障(518129,5)",                  (uint8_t *)"BCM:(518129,5)"},  0}, //BCM
/*1275*/{0x32, 518131,  3, {(uint8_t *)"BCM:传感器电源故障(518131,3)",             (uint8_t *)"BCM:(518131,3)"},  0}, //BCM
/*1276*/{0x32, 518131,  4, {(uint8_t *)"BCM:传感器电源故障(518131,4)",             (uint8_t *)"BCM:(518131,4)"},  0}, //BCM
/*1277*/{0x32, 518136,  5, {(uint8_t *)"BCM:气喇叭电磁阀或线路故障(518136,5)",     (uint8_t *)"BCM:(518136,5)"},  0}, //BCM
/*1278*/{0x32, 518136,  6, {(uint8_t *)"BCM:气喇叭电磁阀或线路故障(518136,6)",     (uint8_t *)"BCM:(518136,6)"},  0}, //BCM
/*1279*/{0x32, 518137,  5, {(uint8_t *)"BCM:电喇叭继电器或线路故障(518137,5)",     (uint8_t *)"BCM:(518137,5)"},  0}, //BCM
/*1280*/{0x32, 518137,  6, {(uint8_t *)"BCM:电喇叭继电器或线路故障(518137,6)",     (uint8_t *)"BCM:(518137,6)"},  0}, //BCM
/*1281*/{0x32, 518138,  6, {(uint8_t *)"BCM:阅读灯或线路故障(518138,6)",           (uint8_t *)"BCM:(518138,6)"},  0}, //BCM
/*1282*/{0x32, 518139,  5, {(uint8_t *)"BCM:后照灯继电器或线路故障(518139,5)",     (uint8_t *)"BCM:(518139,5)"},  0}, //BCM
/*1283*/{0x32, 518139,  6, {(uint8_t *)"BCM:后照灯继电器或线路故障(518139,6)",     (uint8_t *)"BCM:(518139,6)"},  0}, //BCM
/*1284*/{0x32, 518140,  5, {(uint8_t *)"BCM:轮间差速电磁阀或线路故障(518140,5)",   (uint8_t *)"BCM:(518140,5)"},  0}, //BCM
/*1285*/{0x32, 518140,  6, {(uint8_t *)"BCM:轮间差速电磁阀或线路故障(518140,6)",   (uint8_t *)"BCM:(518140,6)"},  0}, //BCM
/*1286*/{0x32, 518141,  5, {(uint8_t *)"BCM:轴间差速电磁阀或线路故障(518141,5)",   (uint8_t *)"BCM:(518141,5)"},  0}, //BCM
/*1287*/{0x32, 518141,  6, {(uint8_t *)"BCM:轴间差速电磁阀或线路故障(518141,6)",   (uint8_t *)"BCM:(518141,6)"},  0}, //BCM
/*1288*/{0x32, 518142,  5, {(uint8_t *)"BCM:取力电磁阀或线路故障(518142,5)",       (uint8_t *)"BCM:(518142,5)"},  0}, //BCM
/*1289*/{0x32, 518142,  6, {(uint8_t *)"BCM:取力电磁阀或线路故障(518142,6)",       (uint8_t *)"BCM:(518142,6)"},  0}, //BCM
/*1290*/{0x32, 518148,  3, {(uint8_t *)"BCM:预留传感器信号电压高(518148,3)",       (uint8_t *)"BCM:(518148,3)"},  0}, //BCM
/*1291*/{0x32, 518148,  4, {(uint8_t *)"BCM:预留传感器信号电压低(518148,4)",       (uint8_t *)"BCM:(518148,4)"},  0}, //BCM
/*1292*/{0x32, 518151,  0, {(uint8_t *)"BCM:电源电压过高(518151,0)",               (uint8_t *)"BCM:(518151,0)"},  0}, //BCM
/*1293*/{0x32, 518151,  1, {(uint8_t *)"BCM:电源电压过低(518151,1)",               (uint8_t *)"BCM:(518151,1)"},  0}, //BCM
/*1294*/{0xEC, 518001,  5, {(uint8_t *)"DCM:司机侧车窗电机或线路故障(518001,5)",           (uint8_t *)"DCM:(518001,5)"}, 0}, //DCM
/*1295*/{0xEC, 518001,  6, {(uint8_t *)"DCM:司机侧车窗电机或线路故障(518001,6)",           (uint8_t *)"DCM:(518001,6)"}, 0}, //DCM
/*1296*/{0xEC, 518002,  5, {(uint8_t *)"DCM:司机侧门锁电机或线路故障(518002,5)",           (uint8_t *)"DCM:(518002,5)"}, 0}, //DCM
/*1297*/{0xEC, 518002,  6, {(uint8_t *)"DCM:司机侧门锁电机或线路故障(518002,6)",           (uint8_t *)"DCM:(518002,6)"}, 0}, //DCM
/*1298*/{0xEC, 518003,  5, {(uint8_t *)"DCM:司机侧后视镜上下调节电机或线路故障(518003,5)", (uint8_t *)"DCM:(518003,5)"}, 0}, //DCM
/*1299*/{0xEC, 518003,  6, {(uint8_t *)"DCM:司机侧后视镜上下调节电机或线路故障(518003,6)", (uint8_t *)"DCM:(518003,6)"}, 0}, //DCM
/*1300*/{0xEC, 518004,  5, {(uint8_t *)"DCM:司机侧后视镜左右调节电机或线路故障(518004,5)", (uint8_t *)"DCM:(518004,5)"}, 0}, //DCM
/*1301*/{0xEC, 518004,  6, {(uint8_t *)"DCM:司机侧后视镜左右调节电机或线路故障(518004,6)", (uint8_t *)"DCM:(518004,6)"}, 0}, //DCM
/*1302*/{0xEC, 518005,  5, {(uint8_t *)"DCM:司机侧后视镜加热器或线路故障(518005,5)",       (uint8_t *)"DCM:(518005,5)"}, 0}, //DCM
/*1303*/{0xEC, 518005,  6, {(uint8_t *)"DCM:司机侧后视镜加热器或线路故障(518005,6)",       (uint8_t *)"DCM:(518005,6)"}, 0}, //DCM
/*1304*/{0xEC, 518006,  5, {(uint8_t *)"DCM:乘客侧车窗电机或线路故障(518006,5)",           (uint8_t *)"DCM:(518006,5)"}, 0}, //DCM
/*1305*/{0xEC, 518006,  6, {(uint8_t *)"DCM:乘客侧车窗电机或线路故障(518006,6)",           (uint8_t *)"DCM:(518006,6)"}, 0}, //DCM
/*1306*/{0xEC, 518007,  5, {(uint8_t *)"DCM:乘客侧门锁电机或线路故障(518007,5)",           (uint8_t *)"DCM:(518007,5)"}, 0}, //DCM
/*1307*/{0xEC, 518007,  6, {(uint8_t *)"DCM:乘客侧门锁电机或线路故障(518007,6)",           (uint8_t *)"DCM:(518007,6)"}, 0}, //DCM
/*1308*/{0xEC, 518008,  5, {(uint8_t *)"DCM:乘客侧后视镜上下调节电机或线路故障(518008,5)", (uint8_t *)"DCM:(518008,5)"}, 0}, //DCM
/*1309*/{0xEC, 518008,  6, {(uint8_t *)"DCM:乘客侧后视镜上下调节电机或线路故障(518008,6)", (uint8_t *)"DCM:(518008,6)"}, 0}, //DCM
/*1310*/{0xEC, 518009,  5, {(uint8_t *)"DCM:乘客侧后视镜左右调节电机或线路故障(518009,5)", (uint8_t *)"DCM:(518009,5)"}, 0}, //DCM
/*1311*/{0xEC, 518009,  6, {(uint8_t *)"DCM:乘客侧后视镜左右调节电机或线路故障(518009,6)", (uint8_t *)"DCM:(518009,6)"}, 0}, //DCM
/*1312*/{0xEC, 518010,  5, {(uint8_t *)"DCM:乘客侧后视镜加热器或线路故障(518010,5)",       (uint8_t *)"DCM:(518010,5)"}, 0}, //DCM
/*1313*/{0xEC, 518010,  6, {(uint8_t *)"DCM:乘客侧后视镜加热器或线路故障(518010,6)",       (uint8_t *)"DCM:(518010,6)"}, 0}, //DCM
/*1314*/{0xEC, 518011,  6, {(uint8_t *)"DCM:后视镜加热指示灯或线路故障(518011,6)",         (uint8_t *)"DCM:(518011,6)"}, 0}, //DCM
/*1315*/{0xEC, 518012,  4, {(uint8_t *)"DCM:电源1故障(518012,4)",                          (uint8_t *)"DCM:(518012,4)"}, 0}, //DCM
/*1316*/{0xEC, 518013,  4, {(uint8_t *)"DCM:电源2故障(518013,4)",                          (uint8_t *)"DCM:(518013,4)"}, 0}, //DCM
/*1317*/{0xEC, 518014,  4, {(uint8_t *)"DCM:电源3故障(518014,4)",                          (uint8_t *)"DCM:(518014,4)"}, 0}, //DCM
/*1318*/{0xEC, 518017,  0, {(uint8_t *)"DCM:电源电压过高(518017,0)",                       (uint8_t *)"DCM:(518017,0)"}, 0}, //DCM
/*1319*/{0xEC, 518017,  1, {(uint8_t *)"DCM:电源电压过低(518017,1)",                       (uint8_t *)"DCM:(518017,1)"}, 0}, //DCM

/*1320*/{0x17, 523000,  3, {(uint8_t *)"仪表:车速传感器电压高(523000,3)",         (uint8_t *)"IC:(523000,3)"},  0}, //仪表
/*1321*/{0x17, 523000,  4, {(uint8_t *)"仪表:车速传感器电压低(523000,4)",         (uint8_t *)"IC:(523000,4)"},  0}, //仪表
/*1322*/{0x17, 523004,  3, {(uint8_t *)"仪表:前桥回路气压传感器电压高(523004,3)", (uint8_t *)"IC:(523004,3)"},  0}, //仪表
/*1323*/{0x17, 523004,  4, {(uint8_t *)"仪表:前桥回路气压传感器电压低(523004,4)", (uint8_t *)"IC:(523004,4)"},  0}, //仪表
/*1324*/{0x17, 523005,  3, {(uint8_t *)"仪表:后桥回路气压传感器电压高(523005,3)", (uint8_t *)"IC:(523005,3)"},  0}, //仪表
/*1325*/{0x17, 523005,  4, {(uint8_t *)"仪表:后桥回路气压传感器电压低(523005,4)", (uint8_t *)"IC:(523005,4)"},  0}, //仪表
/*1326*/{0x17, 523007, 12, {(uint8_t *)"仪表:内部故障(523007,12)",                (uint8_t *)"IC:(523007,12)"}, 0}, //仪表
/*1327*/{0x17, 523034,  8, {(uint8_t *)"仪表:内部故障(523034,8)",                 (uint8_t *)"IC:(523034,8)"},  0}, //仪表
/*1328*/{0x17, 523008,  8, {(uint8_t *)"仪表:CAN1总线故障(523008,8)",             (uint8_t *)"IC:(523008,8)"},  0}, //仪表
/*1329*/{0x17, 523009,  8, {(uint8_t *)"仪表:CAN2总线故障(523009,8)",             (uint8_t *)"IC:(523009,8)"},  0}, //仪表
/*1330*/{0x17, 523010,  8, {(uint8_t *)"仪表:BCM报文超时(523010,8)",              (uint8_t *)"IC:(523010,8)"},  0}, //仪表
/*1331*/{0x17, 523020, 12, {(uint8_t *)"仪表:水温过高指示灯故障(523020,12)",      (uint8_t *)"IC:(523020,12)"}, 0}, //仪表
/*1332*/{0x17, 523022, 12, {(uint8_t *)"仪表:门开报警灯故障(523022,12)",          (uint8_t *)"IC:(523022,12)"}, 0}, //仪表
/*1333*/{0x17, 523023, 12, {(uint8_t *)"仪表:第一桥左轮摩擦片磨损(523023,12)",    (uint8_t *)"IC:(523023,12)"}, 0}, //仪表
/*1334*/{0x17, 523024, 12, {(uint8_t *)"仪表:第一桥右轮摩擦片磨损(523024,12)",    (uint8_t *)"IC:(523024,12)"}, 0}, //仪表
/*1335*/{0x17, 523025, 12, {(uint8_t *)"仪表:第二桥左轮摩擦片磨损(523025,12)",    (uint8_t *)"IC:(523025,12)"}, 0}, //仪表
/*1336*/{0x17, 523026, 12, {(uint8_t *)"仪表:第二桥右轮摩擦片磨损(523026,12)",    (uint8_t *)"IC:(523026,12)"}, 0}, //仪表
/*1337*/{0x17, 523027, 12, {(uint8_t *)"仪表:第三桥左轮摩擦片磨损(523027,12)",    (uint8_t *)"IC:(523027,12)"}, 0}, //仪表
/*1338*/{0x17, 523028, 12, {(uint8_t *)"仪表:第三桥右轮摩擦片磨损(523028,12)",    (uint8_t *)"IC:(523028,12)"}, 0}, //仪表
/*1339*/{0x17, 523029, 12, {(uint8_t *)"仪表:第四桥左轮摩擦片磨损(523029,12)",    (uint8_t *)"IC:(523029,12)"}, 0}, //仪表
/*1340*/{0x17, 523030, 12, {(uint8_t *)"仪表:第四桥右轮摩擦片磨损(523030,12)",    (uint8_t *)"IC:(523030,12)"}, 0}, //仪表
/*1341*/{0x17, 523031,  0, {(uint8_t *)"AMT:离合器磨损(523031,0)",                (uint8_t *)"AMT:(523031,0)"}, 0}, //AMT
/*1342*/{0x17, 523032,  0, {(uint8_t *)"AMT:空气压力过低(523032,0)",              (uint8_t *)"AMT:(523032,0)"}, 0}, //AMT
/*1343*/{0x17, 523033,  8, {(uint8_t *)"仪表:TPMSCAN报文超时(523033,8)",          (uint8_t *)"IC:(523033,8)"},  0}, //仪表
/*1344*/{0x17, 523036,  8, {(uint8_t *)"仪表:ABS系统失效(523036,8)",              (uint8_t *)"IC:(523036,8)"},  0}, //仪表
/*1345*/{0x17, 523037,  8, {(uint8_t *)"仪表:EBS系统失效(523037,8)",              (uint8_t *)"IC:(523037,8)"},  0}, //仪表
/*1346*/{0x17,    171,  2, {(uint8_t *)"仪表:环境温度传感器信号异常(171,2)",      (uint8_t *)"IC:(171,2)"},     0}, //仪表
/*1347*/{0x17,    171,  3, {(uint8_t *)"仪表:环境温度传感器或线路故障(171,3)",    (uint8_t *)"IC:(171,3)"},     0}, //仪表
/*1348*/{0x17,    171,  4, {(uint8_t *)"仪表:环境温度传感器电压低(171,4)",        (uint8_t *)"IC:(171,4)"},     0}, //仪表
/*1349*/{0x17,    177,  3, {(uint8_t *)"仪表:变速箱油温传感器电压高(177,3)",      (uint8_t *)"IC:(177,3)"},     0}, //仪表
/*1350*/{0x17,    177,  4, {(uint8_t *)"仪表:变速箱油温传感器电压低(177,4)",      (uint8_t *)"IC:(177,4)"},     0}, //仪表
/*1351*/{0x17, 523038, 12, {(uint8_t *)"仪表:不充电指示灯故障(523038,12)",        (uint8_t *)"IC:(523038,12)"}, 0}, //仪表
/*1352*/{0x17, 523039, 12, {(uint8_t *)"仪表:驻车制动指示灯故障(523039,12)",      (uint8_t *)"IC:(523039,12)"}, 0}, //仪表
/*1353*/{0x17, 523040, 12, {(uint8_t *)"仪表:安全带指示灯故障(523040,12)",        (uint8_t *)"IC:(523040,12)"}, 0}, //仪表
/*1354*/{0x17, 523041,  1, {(uint8_t *)"仪表:空气压力过低(523041,1)",             (uint8_t *)"IC:(523041,1)"},  0}, //仪表
/*1355*/{0x17, 523042,  8, {(uint8_t *)"仪表:AMTCAN报文超时(523042,8)",           (uint8_t *)"IC:(523042,8)"},  0}, //仪表
/*1356*/{0x17, 523043,  8, {(uint8_t *)"仪表:SCUCAN报文超时(523043,8)",           (uint8_t *)"IC:(523043,8)"},  0}, //仪表
/*1357*/{0x17, 523045,  8, {(uint8_t *)"仪表:ECASCAN报文超时(523045,8)",          (uint8_t *)"IC:(523045,8)"},  0}, //仪表
/*1358*/{0x17, 523047,  8, {(uint8_t *)"仪表:LDWSCAN报文超时(523047,8)",          (uint8_t *)"IC:(523047,8)"},  0}, //仪表
/*1359*/{0x17, 523048,  8, {(uint8_t *)"仪表:AEBSCAN报文超时(523048,8)",          (uint8_t *)"IC:(523048,8)"},  0}, //仪表

/*1360*/{0x17, 523051,  8, {(uint8_t *)"LDWS:车道偏离系统标定未完成",     (uint8_t *)"LDWS:calibration not completed"}, 0}, //LDWS
/*1361*/{0x17, 523052,  8, {(uint8_t *)"FCWS:前方碰撞系统故障",           (uint8_t *)"FCWS:System failure"}, 0}, //FCWS
/*1362*/{0x17, 523053,  8, {(uint8_t *)"FCWS:前方碰撞系统前视相机未标定", (uint8_t *)"FCWS:Forward-looking camera not calibrated"}, 0}, //FCWS
/*1363*/{0x17, 523054,  8, {(uint8_t *)"FCWS:前方碰撞系统前视相机故障",   (uint8_t *)"FCWS:Forward-looking Camera Failure"}, 0}, //FCWS

/*1364*/{0x33, 520001,  9, {(uint8_t *)"TPMS:左前胎压传感器信号丢失(520001,9)",     (uint8_t *)"TPMS:(520001,9)"},  0}, //TPMS
/*1365*/{0x33, 520002,  9, {(uint8_t *)"TPMS:右前胎压传感器信号丢失(520002,9)",     (uint8_t *)"TPMS:(520002,9)"},  0}, //TPMS
/*1366*/{0x33, 520003,  9, {(uint8_t *)"TPMS:二轴左外胎压传感器信号丢失(520003,9)", (uint8_t *)"TPMS:(520003,9)"},  0}, //TPMS
/*1367*/{0x33, 520004,  9, {(uint8_t *)"TPMS:二轴左内胎压传感器信号丢失(520004,9)", (uint8_t *)"TPMS:(520004,9)"},  0}, //TPMS
/*1368*/{0x33, 520005,  9, {(uint8_t *)"TPMS:二轴右内胎压传感器信号丢失(520005,9)", (uint8_t *)"TPMS:(520005,9)"},  0}, //TPMS
/*1369*/{0x33, 520006,  9, {(uint8_t *)"TPMS:二轴右外胎压传感器信号丢失(520006,9)", (uint8_t *)"TPMS:(520006,9)"},  0}, //TPMS
/*1370*/{0x33, 520007,  9, {(uint8_t *)"TPMS:三轴左外胎压传感器信号丢失(520007,9)", (uint8_t *)"TPMS:(520007,9)"},  0}, //TPMS
/*1371*/{0x33, 520008,  9, {(uint8_t *)"TPMS:三轴左内胎压传感器信号丢失(520008,9)", (uint8_t *)"TPMS:(520008,9)"},  0}, //TPMS
/*1372*/{0x33, 520009,  9, {(uint8_t *)"TPMS:三轴右内胎压传感器信号丢失(520009,9)", (uint8_t *)"TPMS:(520009,9)"},  0}, //TPMS
/*1373*/{0x33, 520010,  9, {(uint8_t *)"TPMS:三轴右外胎压传感器信号丢失(520010,9)", (uint8_t *)"TPMS:(520010,9)"},  0}, //TPMS
/*1374*/{0x33, 520011,  9, {(uint8_t *)"TPMS:四轴左外胎压传感器信号丢失(520011,9)", (uint8_t *)"TPMS:(520011,9)"},  0}, //TPMS
/*1375*/{0x33, 520012,  9, {(uint8_t *)"TPMS:四轴左内胎压传感器信号丢失(520012,9)", (uint8_t *)"TPMS:(520012,9)"},  0}, //TPMS
/*1376*/{0x33, 520013,  9, {(uint8_t *)"TPMS:四轴右内胎压传感器信号丢失(520013,9)", (uint8_t *)"TPMS:(520013,9)"},  0}, //TPMS
/*1377*/{0x33, 520014,  9, {(uint8_t *)"TPMS:四轴右外胎压传感器信号丢失(520014,9)", (uint8_t *)"TPMS:(520014,9)"},  0}, //TPMS
/*1378*/{0x33,   3509, 24, {(uint8_t *)"TPMS:左前胎压传感器电量低(3509,24)",        (uint8_t *)"TPMS:(3509,24)"},   0}, //TPMS
/*1379*/{0x33,   3510, 24, {(uint8_t *)"TPMS:右前胎压传感器电量低(3510,24)",        (uint8_t *)"TPMS:(3510,24)"},   0}, //TPMS
/*1380*/{0x33,   3511, 24, {(uint8_t *)"TPMS:二轴左外胎压传感器电量低(3511,24)",    (uint8_t *)"TPMS:(3511,24)"},   0}, //TPMS
/*1381*/{0x33,   3512, 24, {(uint8_t *)"TPMS:二轴左内胎压传感器电量低(3512,24)",    (uint8_t *)"TPMS:(3512,24)"},   0}, //TPMS
/*1382*/{0x33,   3513, 24, {(uint8_t *)"TPMS:二轴右内胎压传感器电量低(3513,24)",    (uint8_t *)"TPMS:(3513,24)"},   0}, //TPMS
/*1383*/{0x33,   3514, 24, {(uint8_t *)"TPMS:二轴右外胎压传感器电量低(3514,24)",    (uint8_t *)"TPMS:(3514,24)"},   0}, //TPMS
/*1384*/{0x33,   5125, 24, {(uint8_t *)"TPMS:三轴左外胎压传感器电量低(5125,24)",    (uint8_t *)"TPMS:(5125,24)"},   0}, //TPMS
/*1385*/{0x33,   5126, 24, {(uint8_t *)"TPMS:三轴左内胎压传感器电量低(5126,24)",    (uint8_t *)"TPMS:(5126,24)"},   0}, //TPMS
/*1386*/{0x33,   5127, 24, {(uint8_t *)"TPMS:三轴右内胎压传感器电量低(5127,24)",    (uint8_t *)"TPMS:(5127,24)"},   0}, //TPMS
/*1387*/{0x33,   5128, 24, {(uint8_t *)"TPMS:三轴右外胎压传感器电量低(5128,24)",    (uint8_t *)"TPMS:(5128,24)"},   0}, //TPMS
/*1388*/{0x33,   5129, 24, {(uint8_t *)"TPMS:四轴左外胎压传感器电量低(5129,24)",    (uint8_t *)"TPMS:(5129,24)"},   0}, //TPMS
/*1389*/{0x33,   5130, 24, {(uint8_t *)"TPMS:四轴左内胎压传感器电量低(5130,24)",    (uint8_t *)"TPMS:(5130,24)"},   0}, //TPMS
/*1390*/{0x33,   5131, 24, {(uint8_t *)"TPMS:四轴右内胎压传感器电量低(5131,24)",    (uint8_t *)"TPMS:(5131,24)"},   0}, //TPMS
/*1391*/{0x33,   5132, 24, {(uint8_t *)"TPMS:四轴右外胎压传感器电量低(5132,24)",    (uint8_t *)"TPMS:(5132,24)"},   0}, //TPMS
/*1392*/{0x33,   5133, 24, {(uint8_t *)"TPMS:备胎胎压传感器电量低(5133,24)",        (uint8_t *)"TPMS:(5133,24)"},   0}, //TPMS
/*1393*/{0x33, 519001,  9, {(uint8_t *)"TPMS:接收器18信号丢失(519001,9)",           (uint8_t *)"TPMS:(519001,9)"},  0}, //TPMS
/*1394*/{0x33, 519002, 10, {(uint8_t *)"TPMS:接收器27信号丢失(519002,10)",          (uint8_t *)"TPMS:(519002,10)"}, 0}, //TPMS
/*1395*/{0x33, 519003, 11, {(uint8_t *)"TPMS:接收器29信号丢失(519003,11)",          (uint8_t *)"TPMS:(519003,11)"}, 0}, //TPMS
/*1396*/{0x33, 518005, 11, {(uint8_t *)"TPMS:接收器配置错误(518005,11)",            (uint8_t *)"TPMS:(518005,11)"}, 0}, //TPMS
/*1397*/{0x33,    168,  4, {(uint8_t *)"TPMS:控制器电压过低(168,4)",                (uint8_t *)"TPMS:(168,4)"},     0}, //TPMS
/*1398*/{0x33,    168,  3, {(uint8_t *)"TPMS:控制器电压过高(168,3)",                (uint8_t *)"TPMS:(168,3)"},     0}, //TPMS
/*1399*/{0x33, 518002,  9, {(uint8_t *)"TPMS:ON档CAN信号超时(518002,9)",            (uint8_t *)"TPMS:(518002,9)"},  0}, //TPMS
/*1400*/{0x33,    171,  9, {(uint8_t *)"TPMS:环境温度CAN报文超时(171,9)",           (uint8_t *)"TPMS:(171,9)"},     0}, //TPMS
/*1401*/{0x41,     66,  9, {(uint8_t *)"HJYX:系统未标定(66,9)",         (uint8_t *)"HJYX:(66,9)"},  0}, //HJYX
/*1402*/{0x41,     67, 12, {(uint8_t *)"HJYX:前摄像头故障(67,12)",      (uint8_t *)"HJYX:(67,12)"}, 0}, //HJYX
/*1403*/{0x41,     68, 12, {(uint8_t *)"HJYX:左前摄像头故障(68,12)",    (uint8_t *)"HJYX:(68,12)"}, 0}, //HJYX
/*1404*/{0x41,     69, 12, {(uint8_t *)"HJYX:左后摄像头故障(69,12)",    (uint8_t *)"HJYX:(69,12)"}, 0}, //HJYX
/*1405*/{0x41,     70, 12, {(uint8_t *)"HJYX:右前摄像头故障(70,12)",    (uint8_t *)"HJYX:(70,12)"}, 0}, //HJYX
/*1406*/{0x41,     71, 12, {(uint8_t *)"HJYX:右后摄像头故障(71,12)",    (uint8_t *)"HJYX:(71,12)"}, 0}, //HJYX
/*1407*/{0x41,     72, 12, {(uint8_t *)"HJYX:主机故障(72,12)",          (uint8_t *)"HJYX:(72,12)"}, 0}, //HJYX
/*1408*/{0x41,     73, 12, {(uint8_t *)"HJYX:SD卡异常(73,12)",          (uint8_t *)"HJYX:(73,12)"}, 0}, //HJYX
/*1409*/{0xE7,     91,  5, {(uint8_t *)"疲劳驾驶:摄像头开路故障(91,5)", (uint8_t *)"Fatigue Driving:(91,5)"}, 0}, //疲劳驾驶
/*1410*/{0xE7,     92,  6, {(uint8_t *)"疲劳驾驶:摄像头短路故障(92,6)", (uint8_t *)"Fatigue Driving:(92,6)"}, 0}, //疲劳驾驶
/*1411*/{0xE7,     93,  5, {(uint8_t *)"疲劳驾驶:红外灯开路故障(93,5)", (uint8_t *)"Fatigue Driving:(93,5)"}, 0}, //疲劳驾驶
/*1412*/{0xE7,     94,  6, {(uint8_t *)"疲劳驾驶:红外灯短路故障(94,6)", (uint8_t *)"Fatigue Driving:(94,6)"}, 0}, //疲劳驾驶
/*1413*/{0x31,0xFFFFF,0xFF /*    168, 16 */, {(uint8_t *)"HCU:蓄电池电压信号超上限(168,16)",           (uint8_t *)"HCU:(168,16)"},   0}, //HCU
/*1414*/{0x31,    168, 18, {(uint8_t *)"HCU:蓄电池电压信号超下限(168,18)",           (uint8_t *)"HCU:(168,18)"},   0}, //HCU
/*1415*/{0x31,0xFFFFF,0xFF /*    168,  2 */, {(uint8_t *)"HCU:蓄电池电压信号不合理(168,2)",            (uint8_t *)"HCU:(168,2)"},    0}, //HCU
/*1416*/{0x31,0xFFFFF,0xFF /*    169, 16 */, {(uint8_t *)"HCU:DC/DC输出电压信号超上限(169,16)",        (uint8_t *)"HCU:(169,16)"},   0}, //HCU
/*1417*/{0x31,0xFFFFF,0xFF /*    169, 18 */, {(uint8_t *)"HCU:DC/DC输出电压信号超下限(169,18)",        (uint8_t *)"HCU:(169,18)"},   0}, //HCU
/*1418*/{0x31,0xFFFFF,0xFF /*    169,  2 */, {(uint8_t *)"HCU:DC/DC输出电压信号不合理(169,2)",         (uint8_t *)"HCU:(169,2)"},    0}, //HCU
/*1419*/{0x31,0xFFFFF,0xFF /*    158, 16 */, {(uint8_t *)"HCU:T15信号电压故障-过高(158,16)",           (uint8_t *)"HCU:(158,16)"},   0}, //HCU
/*1420*/{0x31,    158, 18, {(uint8_t *)"HCU:T15信号电压故障-过低(158,18)",           (uint8_t *)"HCU:(158,18)"},   0}, //HCU
/*1421*/{0x31,0xFFFFF,0xFF /*    158,  2 */, {(uint8_t *)"HCU:T15信号电压故障-合理性(158,2)",          (uint8_t *)"HCU:(158,2)"},    0}, //HCU
/*1422*/{0x31,    597,  2, {(uint8_t *)"HCU:制动灯开关故障-合理性(597,2)",           (uint8_t *)"HCU:(597,2)"},    0}, //HCU
/*1423*/{0x31,  21003, 12, {(uint8_t *)"HCU:CAN2通讯故障(21003,12)",                 (uint8_t *)"HCU:(21003,12)"}, 0}, //HCU
/*1424*/{0x31,  21004, 12, {(uint8_t *)"HCU:CAN1通讯故障(21004,12)",                 (uint8_t *)"HCU:(21004,12)"}, 0}, //HCU
/*1425*/{0x31,  21005,  4, {(uint8_t *)"HCU:ABS制动灯继电器对地短路(21005,4)",       (uint8_t *)"HCU:(21005,4)"},  0}, //HCU
/*1426*/{0x31,  21005,  3, {(uint8_t *)"HCU:ABS制动灯继电器对电源短路(21005,3)",     (uint8_t *)"HCU:(21005,3)"},  0}, //HCU
/*1427*/{0x31,0xFFFFF,0xFF /*  21005,  6 */, {(uint8_t *)"HCU:ABS制动灯继电器控制线路故障(21005,6)",   (uint8_t *)"HCU:(21005,6)"},  0}, //HCU
/*1428*/{0x31,0xFFFFF,0xFF /*  21006, 16 */, {(uint8_t *)"HCU:制动踏板传感器电源故障(21006,16)",       (uint8_t *)"HCU:(21006,16)"}, 0}, //HCU
/*1429*/{0x31,0xFFFFF,0xFF /*  21006, 18 */, {(uint8_t *)"HCU:制动踏板传感器电源故障(21006,18)",       (uint8_t *)"HCU:(21006,18)"}, 0}, //HCU
/*1430*/{0x31,  21006,  5, {(uint8_t *)"HCU:制动踏板传感器电源故障(21006,5)",        (uint8_t *)"HCU:(21006,5)"},  0}, //HCU
/*1431*/{0x31,  21006,  6, {(uint8_t *)"HCU:制动踏板传感器电源故障(21006,6)",        (uint8_t *)"HCU:(21006,6)"},  0}, //HCU
/*1432*/{0x31,  21007, 16, {(uint8_t *)"HCU:制动踏板传感器故障(21007,16)",           (uint8_t *)"HCU:(21007,16)"}, 0}, //HCU
/*1433*/{0x31,  21007, 18, {(uint8_t *)"HCU:制动踏板传感器故障(21007,18)",           (uint8_t *)"HCU:(21007,18)"}, 0}, //HCU
/*1434*/{0x31,0xFFFFF,0xFF /*  21007,  2 */, {(uint8_t *)"HCU:制动踏板传感器故障(21007,2)",            (uint8_t *)"HCU:(21007,2)"},  0}, //HCU
/*1435*/{0x31,0xFFFFF,0xFF /*  21008, 16 */, {(uint8_t *)"HCU:电子加速踏板电源故障(21008,16)",         (uint8_t *)"HCU:(21008,16)"}, 0}, //HCU
/*1436*/{0x31,0xFFFFF,0xFF /*  21008, 18 */, {(uint8_t *)"HCU:电子加速踏板电源故障(21008,18)",         (uint8_t *)"HCU:(21008,18)"}, 0}, //HCU
/*1437*/{0x31,  21008,  5, {(uint8_t *)"HCU:电子加速踏板电源故障(21008,5)",          (uint8_t *)"HCU:(21008,5)"},  0}, //HCU
/*1438*/{0x31,  21008,  6, {(uint8_t *)"HCU:电子加速踏板电源故障(21008,6)",          (uint8_t *)"HCU:(21008,6)"},  0}, //HCU
/*1439*/{0x31,     91, 16, {(uint8_t *)"HCU:电子加速踏板信号故障(91,16)",            (uint8_t *)"HCU:(91,16)"},    0}, //HCU
/*1440*/{0x31,     91, 18, {(uint8_t *)"HCU:电子加速踏板信号故障(91,18)",            (uint8_t *)"HCU:(91,18)"},    0}, //HCU
/*1441*/{0x31,0xFFFFF,0xFF /*     91,  2 */, {(uint8_t *)"HCU:电子加速踏板信号故障(91,2)",             (uint8_t *)"HCU:(91,2)"},     0}, //HCU
/*1442*/{0x31,0xFFFFF,0xFF /*  21009, 16 */, {(uint8_t *)"HCU:电子加速踏板电源故障(21009,16)",         (uint8_t *)"HCU:(21009,16)"}, 0}, //HCU
/*1443*/{0x31,0xFFFFF,0xFF /*  21009, 18 */, {(uint8_t *)"HCU:电子加速踏板电源故障(21009,18)",         (uint8_t *)"HCU:(21009,18)"}, 0}, //HCU
/*1444*/{0x31,  21009,  5, {(uint8_t *)"HCU:电子加速踏板电源故障(21009,5)",          (uint8_t *)"HCU:(21009,5)"},  0}, //HCU
/*1445*/{0x31,  21009,  6, {(uint8_t *)"HCU:电子加速踏板电源故障(21009,6)",          (uint8_t *)"HCU:(21009,6)"},  0}, //HCU
/*1446*/{0x31,     29, 16, {(uint8_t *)"HCU:电子加速踏板信号故障(29,16)",            (uint8_t *)"HCU:(29,16)"},    0}, //HCU
/*1447*/{0x31,     29, 18, {(uint8_t *)"HCU:电子加速踏板信号故障(29,18)",            (uint8_t *)"HCU:(29,18)"},    0}, //HCU
/*1448*/{0x31,0xFFFFF,0xFF /*     29,  2 */, {(uint8_t *)"HCU:电子加速踏板信号故障(29,2)",             (uint8_t *)"HCU:(29,2)"},     0}, //HCU
/*1449*/{0x31,  21012,  4, {(uint8_t *)"HCU:DCDC使能信号对地短路(21012,4)",          (uint8_t *)"HCU:(21012,4)"},  0}, //HCU
/*1450*/{0x31,  21012,  3, {(uint8_t *)"HCU:DCDC使能信号对电短路(21012,3)",          (uint8_t *)"HCU:(21012,3)"},  0}, //HCU
/*1451*/{0x31,0xFFFFF,0xFF /*  21012,  6 */, {(uint8_t *)"HCU:DCDC使能信号控制线路故障(21012,6)",      (uint8_t *)"HCU:(21012,6)"},  0}, //HCU
/*1452*/{0x31,  21013,  4, {(uint8_t *)"HCU:空调使能继电器对地短路(21013,4)",        (uint8_t *)"HCU:(21013,4)"},  0}, //HCU
/*1453*/{0x31,  21013,  3, {(uint8_t *)"HCU:空调使能继电器对电短路(21013,3)",        (uint8_t *)"HCU:(21013,3)"},  0}, //HCU
/*1454*/{0x31,0xFFFFF,0xFF /*  21013,  6 */, {(uint8_t *)"HCU:空调使能继电器控制线路故障(21013,6)",    (uint8_t *)"HCU:(21013,6)"},  0}, //HCU
/*1455*/{0x31,  21014,  4, {(uint8_t *)"HCU:PTC使能继电器对地短路(21014,4)",         (uint8_t *)"HCU:(21014,4)"},  0}, //HCU
/*1456*/{0x31,  21014,  3, {(uint8_t *)"HCU:PTC使能继电器对电短路(21014,3)",         (uint8_t *)"HCU:(21014,3)"},  0}, //HCU
/*1457*/{0x31,0xFFFFF,0xFF /*  21014,  6 */, {(uint8_t *)"HCU:PTC使能继电器控制线路故障(21014,6)",     (uint8_t *)"HCU:(21014,6)"},  0}, //HCU
/*1458*/{0x31,  21015,  4, {(uint8_t *)"HCU:紧急切断继电器对地短路(21015,4)",        (uint8_t *)"HCU:(21015,4)"},  0}, //HCU
/*1459*/{0x31,  21015,  3, {(uint8_t *)"HCU:紧急切断继电器对电短路(21015,3)",        (uint8_t *)"HCU:(21015,3)"},  0}, //HCU
/*1460*/{0x31,0xFFFFF,0xFF /*  21015,  6 */, {(uint8_t *)"HCU:紧急切断继电器控制线路故障(21015,6)",    (uint8_t *)"HCU:(21015,6)"},  0}, //HCU
/*1461*/{0x31,0xFFFFF,0xFF /*    630, 12 */, {(uint8_t *)"HCU:下电数据不能保存(630,12)",               (uint8_t *)"HCU:(630,12)"},   0}, //HCU
/*1462*/{0x31,  21016, 12, {(uint8_t *)"HCU:静态RAM检测不能通过(21016,12)",          (uint8_t *)"HCU:(21016,12)"}, 0}, //HCU
/*1463*/{0x31,0xFFFFF,0xFF /*  21017, 12 */, {(uint8_t *)"HCU:非正常复位发生(21017,12)",               (uint8_t *)"HCU:(21017,12)"}, 0}, //HCU
/*1464*/{0x31,  21018, 12, {(uint8_t *)"HCU:内部SPI通讯故障(21018,12)",              (uint8_t *)"HCU:(21018,12)"}, 0}, //HCU
/*1465*/{0x31,  21019,  4, {(uint8_t *)"HCU:PDU正极继电器使能信号对地短路(21019,4)", (uint8_t *)"HCU:(21019,4)"},  0}, //HCU
/*1466*/{0x31,  21019,  3, {(uint8_t *)"HCU:PDU正极继电器使能信号对电短路(21019,3)", (uint8_t *)"HCU:(21019,3)"},  0}, //HCU
/*1467*/{0x31,0xFFFFF,0xFF /*  21019,  6 */, {(uint8_t *)"HCU:PDU正极继电器线路故障(21019,6)",         (uint8_t *)"HCU:(21019,6)"},  0}, //HCU
/*1468*/{0x31,  21022,  4, {(uint8_t *)"HCU:倒车灯输出对地短路或者过温(21022,4)",    (uint8_t *)"HCU:(21022,4)"},  0}, //HCU
/*1469*/{0x31,  21022,  3, {(uint8_t *)"HCU:倒车灯输出对电短路或者开路(21022,3)",    (uint8_t *)"HCU:(21022,3)"},  0}, //HCU
/*1470*/{0x31,0xFFFFF,0xFF /*  21022,  6 */, {(uint8_t *)"HCU:倒车灯输出控制线路故障(21022,6)",        (uint8_t *)"HCU:(21022,6)"},  0}, //HCU
/*1471*/{0x31,0xFFFFF,0xFF /*  21056, 16 */, {(uint8_t *)"HCU:制动踏板传感器电源故障(21056,16)",       (uint8_t *)"HCU:(21056,16)"}, 0}, //HCU
/*1472*/{0x31,0xFFFFF,0xFF /*  21056, 18 */, {(uint8_t *)"HCU:制动踏板传感器电源故障(21056,18)",       (uint8_t *)"HCU:(21056,18)"}, 0}, //HCU
/*1473*/{0x31,  21056,  5, {(uint8_t *)"HCU:制动踏板传感器电源故障(21056,5)",        (uint8_t *)"HCU:(21056,5)"},  0}, //HCU
/*1474*/{0x31,  21056,  6, {(uint8_t *)"HCU:制动踏板传感器电源故障(21056,6)",        (uint8_t *)"HCU:(21056,6)"},  0}, //HCU
/*1475*/{0x31,  21067, 16, {(uint8_t *)"HCU:制动踏板传感器信号故障(21067,16)",       (uint8_t *)"HCU:(21067,16)"}, 0}, //HCU
/*1476*/{0x31,  21067, 18, {(uint8_t *)"HCU:制动踏板传感器信号故障(21067,18)",       (uint8_t *)"HCU:(21067,18)"}, 0}, //HCU
/*1477*/{0x31,0xFFFFF,0xFF /*  21067,  2 */, {(uint8_t *)"HCU:制动踏板传感器信号故障(21067,2)",        (uint8_t *)"HCU:(21067,2)"},  0}, //HCU

/*1478*/{0x82, 521400, 23, {(uint8_t *)"进站维修，通讯故障",              (uint8_t *)"TMS:(521400,23)",}, 0},
/*1479*/{0x82, 0xFFFFF,0xFF/* 522080, 12 */, {(uint8_t *)"TMS:Busoff故障(522080，12)",    (uint8_t *)"TMS:(522080,12)",}, 0},
/*1480*/{0x82, 0xFFFFF,0xFF/* 522080,  2 */, {(uint8_t *)"TMS:TMS未接收到EVECU报文(522080，2)", (uint8_t *)"TMS:(522080,2)",}, 0},
/*1481*/{0x82, 522081,  5, {(uint8_t *)"进站维修，电池水泵故障",           (uint8_t *)"TMS:(522081,5)",}, 0},
/*1482*/{0x82, 522081, 12, {(uint8_t *)"进站维修，电池水泵故障",           (uint8_t *)"TMS:(522081,12)",}, 0},
/*1483*/{0x82, 0xFFFFF,0xFF/* 522081,  3 */, {(uint8_t *)"TMS:电池水泵过压故障(522081，3)",  (uint8_t *)"TMS:(522081,3)",}, 0},
/*1484*/{0x82, 0xFFFFF,0xFF/* 522081,  4 */, {(uint8_t *)"TMS:电池水泵欠压故障(522081，4)",  (uint8_t *)"TMS:(522081,4)",}, 0},
/*1485*/{0x82, 522081,  6, {(uint8_t *)"进站维修，电池水泵故障",            (uint8_t *)"TMS:(522081,6)",}, 0},
/*1486*/{0x82, 0xFFFFF,0xFF/* 522081, 20 */, {(uint8_t *)"TMS:电池水泵过温故障(522081，20)", (uint8_t *)"TMS:(522081,20)",}, 0},
/*1487*/{0x82, 522081, 21, {(uint8_t *)"进站维修，电池水泵故障",            (uint8_t *)"TMS:(522081,21)",}, 0},
/*1488*/{0x82, 521409, 12, {(uint8_t *)"进站维修，电池水泵故障",            (uint8_t *)"TMS:(521409,12)",}, 0},
/*1489*/{0x82, 0xFFFFF,0xFF/* 521409,  6 */, {(uint8_t *)"TMS:水泵过电流(521409,6)",        (uint8_t *)"TMS:(521409,6)",}, 0},
/*1490*/{0x82, 0xFFFFF,0xFF/* 521409,  3 */, {(uint8_t *)"TMS:水泵过电压(521409,3)",        (uint8_t *)"TMS:(521409,3)",}, 0},
/*1491*/{0x82, 0xFFFFF,0xFF/* 521409,  4 */, {(uint8_t *)"TMS:水泵欠电压(521409,4)",        (uint8_t *)"TMS:(521409,4)",}, 0},
/*1492*/{0x82, 0xFFFFF,0xFF/* 521409, 16 */, {(uint8_t *)"TMS:水泵过温(521409,16)",         (uint8_t *)"TMS:(521409,16)",}, 0},
/*1493*/{0x82, 521409, 21, {(uint8_t *)"进站维修，电池水泵故障",            (uint8_t *)"TMS:(521409,21)",}, 0},
/*1494*/{0x82, 521409, 22, {(uint8_t *)"进站维修，电池水泵故障",            (uint8_t *)"TMS:(521409,22)",}, 0},
/*1495*/{0x82, 522082,  5, {(uint8_t *)"进站维修，电机水泵1水泵故障",        (uint8_t *)"TMS:(522082,5)",}, 0},
/*1496*/{0x82, 522082, 12, {(uint8_t *)"进站维修，电机水泵1水泵故障",        (uint8_t *)"TMS:(522082,12)",}, 0},
/*1497*/{0x82, 0xFFFFF,0xFF/* 522082,  3 */, {(uint8_t *)"TMS:电机水泵1过压故障(522082，3)",  (uint8_t *)"TMS:(522082,3)",}, 0},
/*1498*/{0x82, 0xFFFFF,0xFF/* 522082,  4 */, {(uint8_t *)"TMS:电机水泵1欠压故障(522082，4)",  (uint8_t *)"TMS:(522082,4)",}, 0},
/*1499*/{0x82, 522082,  6, {(uint8_t *)"进站维修，电机水泵1水泵故障",        (uint8_t *)"TMS:(522082,6)",}, 0},
/*1500*/{0x82, 0xFFFFF,0xFF/* 522082, 20 */, {(uint8_t *)"TMS:电机水泵1过温故障(522082，20)", (uint8_t *)"TMS:(522082,20)",}, 0},
/*1501*/{0x82, 522082, 21, {(uint8_t *)"进站维修，电机水泵1水泵故障",        (uint8_t *)"TMS:(522082,21)",}, 0},
/*1502*/{0x82, 522085,  5, {(uint8_t *)"进站维修，风扇故障",                (uint8_t *)"TMS:(522085,5)",}, 0},

/*1503*/{0x4D, 521950,  0, {(uint8_t *)"LSCU:输入欠压(521950,0)",             (uint8_t *)"LSCU:(521950,0)"},  0}, //LSCU
/*1504*/{0x4D, 521951,  0, {(uint8_t *)"LSCU:输入过压(521951,0)",             (uint8_t *)"LSCU:(521951,0)"},  0}, //LSCU
/*1505*/{0x4D, 521952, 12, {(uint8_t *)"LSCU:EEPROM故障(521952,12)",          (uint8_t *)"LSCU:(521952,12)"}, 0}, //LSCU
/*1506*/{0x4D, 521953,  0, {(uint8_t *)"LSCU:过流故障(521953,0)",             (uint8_t *)"LSCU:(521953,0)"},  0}, //LSCU
/*1507*/{0x4D, 521954,  0, {(uint8_t *)"LSCU:过温故障(521954,0)",             (uint8_t *)"LSCU:(521954,0)"},  0}, //LSCU
/*1508*/{0x4D, 521955,  0, {(uint8_t *)"LSCU:过载故障(521955,0)",             (uint8_t *)"LSCU:(521955,0)"},  0}, //LSCU
/*1509*/{0x4D, 521956,  8, {(uint8_t *)"LSCU:输出缺相(521956,8)",             (uint8_t *)"LSCU:(521956,8)"},  0}, //LSCU
/*1510*/{0x4D, 521957, 23, {(uint8_t *)"LSCU:CAN通讯中断故障(521957,23)",     (uint8_t *)"LSCU:(521957,23)"}, 0}, //LSCU
/*1511*/{0x4D, 521957,  2, {(uint8_t *)"LSCU:CAN通讯超时故障(521957,2)",      (uint8_t *)"LSCU:(521957,2)"},  0}, //LSCU
/*1512*/{0x4D, 521958,  0, {(uint8_t *)"LSCU:电机过载故障(521958,0)",         (uint8_t *)"LSCU:(521958,0)"},  0}, //LSCU
/*1513*/{0x4D, 521959,  0, {(uint8_t *)"LSCU:电机过温故障(521959,0)",         (uint8_t *)"LSCU:(521959,0)"},  0}, //LSCU
/*1514*/{0x2E, 521907,  2, {(uint8_t *)"HSCU:CAN通讯超时故障(521907,2)",      (uint8_t *)"HSCU:(521907,2)"},  0}, //HSCU
/*1515*/{0x2E, 521908,  0, {(uint8_t *)"HSCU:电机过载故障(521908,0)",         (uint8_t *)"HSCU:(521908,0)"},  0}, //HSCU
/*1516*/{0x05, 524000,  0, {(uint8_t *)"SCU:供电电压过高(524000,0)",          (uint8_t *)"SCU:(524000,0)"},   0}, //SCU
/*1517*/{0x05, 524000,  1, {(uint8_t *)"SCU:供电电压过低(524000,1)",          (uint8_t *)"SCU:(524000,1)"},   0}, //SCU
/*1518*/{0x05, 524001, 19, {(uint8_t *)"SCU:总线故障(524001,19)",             (uint8_t *)"SCU:(524001,19)"},  0}, //SCU
/*1519*/{0x05, 524002,  3, {(uint8_t *)"SCU:换挡旋钮开关信号异常(524002,3)",  (uint8_t *)"SCU:(524002,3)"},   0}, //SCU
/*1520*/{0x05, 524002,  4, {(uint8_t *)"SCU:换挡旋钮开关信号异常(524002,4)",  (uint8_t *)"SCU:(524002,4)"},   0}, //SCU
/*1521*/{0x05, 524003,  3, {(uint8_t *)"SCU:A/M开关信号异常(524003,3)",       (uint8_t *)"SCU:(524003,3)"},   0}, //SCU
/*1522*/{0x05, 524003,  4, {(uint8_t *)"SCU:A/M开关对地短路或卡滞(524003,4)", (uint8_t *)"SCU:(524003,4)"},   0}, //SCU
/*1523*/{0x05, 524004,  3, {(uint8_t *)"SCU:M+开关信号异常(524004,3)",        (uint8_t *)"SCU:(524004,3)"},   0}, //SCU
/*1524*/{0x05, 524005,  3, {(uint8_t *)"SCU:M-开关信号异常(524005,3)",        (uint8_t *)"SCU:(524005,3)"},   0}, //SCU
/*1525*/{0x05, 524006,  3, {(uint8_t *)"SCU:E/P开关信号异常(524006,3)",       (uint8_t *)"SCU:(524006,3)"},   0}, //SCU
/*1526*/{0x05, 524006,  4, {(uint8_t *)"SCU:E/P开关对地短路或卡滞(524006,4)", (uint8_t *)"SCU:(524006,4)"},   0}, //SCU

/*1527*/{0x17, 523055,  8, {(uint8_t *)"LDWS:车道偏离系统故障",           (uint8_t *)"LDWS:System Failure"},0}, //LDWS
/*1528*/{0x17, 523056,  8, {(uint8_t *)"LDWS:车道偏离系统前视相机未标定", (uint8_t *)"LDWS:Forward-looking camera not calibrated"},0}, //LDWS
/*1529*/{0x17, 523057,  8, {(uint8_t *)"LDWS:车道偏离系统前视相机故障",   (uint8_t *)"LDWS:Forward-looking Camera Failure"},0}, //LDWS
/*1530*/{0x17, 523058,  8, {(uint8_t *)"BSD:右盲区探测系统故障",          (uint8_t *)"BSD:System failure"},0}, //BSD
/*1531*/{0x17, 523059,  8, {(uint8_t *)"BSD:右盲区探测系统未标定",        (uint8_t *)"BSD:not calibrated"},0}, //BSD
/*1532*/{0x17, 523060,  8, {(uint8_t *)"BSD:右盲区探测系统相机故障",      (uint8_t *)"BSD:camera failure"},0}, //BSD

/*1533*/{0x31,  21007,  5, {(uint8_t *)"HCU:电源线开路或信号线短路到地(21007,5)",       (uint8_t *)"HCU:(21007,5)"},   0}, //HCU
/*1534*/{0xF6, 522040,  0, {(uint8_t *)"HMS:瓶压过高(522040,0)",                        (uint8_t *)"HMS:(522040,0)"},  0}, //HMS
/*1535*/{0xF6,0xFFFFF, 0xFF /* 522040, 16 */, {(uint8_t *)"HMS:瓶压过高(522040,16)",                       (uint8_t *)"HMS:(522040,16)"}, 0}, //HMS
/*1536*/{0xF6,0xFFFFF, 0xFF /* 522041,  1 */, {(uint8_t *)"HMS:瓶压过低(522041,1)",                        (uint8_t *)"HMS:(522041,1)"},  0}, //HMS
/*1537*/{0xF6, 522041, 18, {(uint8_t *)"氢瓶压力低，请尽快加氢", (uint8_t *)"Low H2 residue, Please add"}, /* {(uint8_t *)"HMS:瓶压过低(522041,18)",                       (uint8_t *)"HMS:(522041,18)"}, */ 0}, //HMS
/*1538*/{0xF6,0xFFFFF, 0xFF /* 522042, 16 */, {(uint8_t *)"HMS:管压过高(522042,16)",                       (uint8_t *)"HMS:(522042,16)"}, 0}, //HMS
/*1539*/{0xF6, 522042,  0, {(uint8_t *)"HMS:管压过高(522042,0)",                        (uint8_t *)"HMS:(522042,0)"},  0}, //HMS
/*1540*/{0xF6,0xFFFFF, 0xFF /* 522043, 18 */, {(uint8_t *)"HMS:管压过低(522043,18)",                       (uint8_t *)"HMS:(522043,18)"}, 0}, //HMS
/*1541*/{0xF6, 522043,  1, {(uint8_t *)"HMS:管压过低(522043,1)",                        (uint8_t *)"HMS:(522043,1)"},  0}, //HMS
/*1542*/{0xF6, 522044,  0, {(uint8_t *)"HMS:瓶温过高(522044,0)",                        (uint8_t *)"HMS:(522044,0)"},  0}, //HMS
/*1543*/{0xF6,0xFFFFF, 0xFF /* 522044, 16 */, {(uint8_t *)"HMS:瓶温过高(522044,16)",                       (uint8_t *)"HMS:(522044,16)"}, 0}, //HMS
/*1544*/{0xF6, 522045, 16, {(uint8_t *)"HMS:氢气泄露(522045,16)",                       (uint8_t *)"HMS:(522045,16)"}, 0}, //HMS
/*1545*/{0xF6, 522045, 15, {(uint8_t *)"HMS:氢气泄露(522045,15)",                       (uint8_t *)"HMS:(522045,15)"}, 0}, //HMS
/*1546*/{0xF6, 522046, 11, {(uint8_t *)"HMS:氢泄露传感器1数据异常(522046,11)",          (uint8_t *)"HMS:(522046,11)"}, 0}, //HMS
/*1547*/{0xF6, 522047, 11, {(uint8_t *)"HMS:氢泄露传感器2数据异常(522047,11)",          (uint8_t *)"HMS:(522047,11)"}, 0}, //HMS
/*1548*/{0xF6, 522048, 11, {(uint8_t *)"HMS:氢泄露传感器3数据异常(522048,11)",          (uint8_t *)"HMS:(522048,11)"}, 0}, //HMS
/*1549*/{0xF6, 522049, 11, {(uint8_t *)"HMS:氢泄露传感器4数据异常(522049,11)",          (uint8_t *)"HMS:(522049,11)"}, 0}, //HMS
/*1550*/{0xF6, 522050, 11, {(uint8_t *)"HMS:氢泄露传感器5数据异常(522050,11)",          (uint8_t *)"HMS:(522050,11)"}, 0}, //HMS
/*1551*/{0xF6,   2853, 19, {(uint8_t *)"HMS:通讯故障,收不到控制报文60s后关闭(2853,19)", (uint8_t *)"HMS:(2853,19)"},   0}, //HMS
/*1552*/{0xF6, 522051, 11, {(uint8_t *)"HMS:温度传感器1数据异常(522051,11)",            (uint8_t *)"HMS:(522051,11)"}, 0}, //HMS
/*1553*/{0xF6, 522052, 11, {(uint8_t *)"HMS:温度传感器2数据异常(522052,11)",            (uint8_t *)"HMS:(522052,11)"}, 0}, //HMS
/*1554*/{0xF6, 522053, 11, {(uint8_t *)"HMS:温度传感器3数据异常(522053,11)",            (uint8_t *)"HMS:(522053,11)"}, 0}, //HMS
/*1555*/{0xF6, 522054, 11, {(uint8_t *)"HMS:温度传感器4数据异常(522054,11)",            (uint8_t *)"HMS:(522054,11)"}, 0}, //HMS
/*1556*/{0xF6, 522055, 11, {(uint8_t *)"HMS:温度传感器5数据异常(522055,11)",            (uint8_t *)"HMS:(522055,11)"}, 0}, //HMS
/*1557*/{0xF6, 522056, 11, {(uint8_t *)"HMS:温度传感器6数据异常(522056,11)",            (uint8_t *)"HMS:(522056,11)"}, 0}, //HMS
/*1558*/{0xF6, 522057, 11, {(uint8_t *)"HMS:温度传感器7数据异常(522057,11)",            (uint8_t *)"HMS:(522057,11)"}, 0}, //HMS
/*1559*/{0xF6, 522058, 11, {(uint8_t *)"HMS:温度传感器8数据异常(522058,11)",            (uint8_t *)"HMS:(522058,11)"}, 0}, //HMS
/*1560*/{0xF6, 522059, 11, {(uint8_t *)"HMS:压力传感器1数据异常(522059,11)",            (uint8_t *)"HMS:(522059,11)"}, 0}, //HMS
/*1561*/{0xF6, 522060, 11, {(uint8_t *)"HMS:压力传感器2数据异常(522060,11)",            (uint8_t *)"HMS:(522060,11)"}, 0}, //HMS
/*1562*/{0xF6, 522061, 11, {(uint8_t *)"HMS:压力传感器3数据异常(522061,11)",            (uint8_t *)"HMS:(522061,11)"}, 0}, //HMS
/*1563*/{0xF5, 522030, 16, {(uint8_t *)"FCU:DCDC电容端过压(522030,16)",          (uint8_t *)"FCU:(522030,16)"}, 0}, //FCU
/*1564*/{0xF5, 522030, 18, {(uint8_t *)"FCU:DCDC电容端欠压(522030,18)",          (uint8_t *)"FCU:(522030,18)"}, 0}, //FCU
/*1565*/{0xF5, 522031, 16, {(uint8_t *)"FCU:DCDC电容端过流(522031,16)",          (uint8_t *)"FCU:(522031,16)"}, 0}, //FCU
/*1566*/{0xF5, 522032, 16, {(uint8_t *)"FCU:DCDC电池端过压(522032,16)",          (uint8_t *)"FCU:(522032,16)"}, 0}, //FCU
/*1567*/{0xF5, 522032, 18, {(uint8_t *)"FCU:DCDC电池端欠压(522032,18)",          (uint8_t *)"FCU:(522032,18)"}, 0}, //FCU
/*1568*/{0xF5, 522033, 16, {(uint8_t *)"FCU:DCDC电池端过流(522033,16)",          (uint8_t *)"FCU:(522033,16)"}, 0}, //FCU
/*1569*/{0xF5, 522034, 16, {(uint8_t *)"FCU:DCDC过热(522034,16)",                (uint8_t *)"FCU:(522034,16)"}, 0}, //FCU
/*1570*/{0xF5, 522035,  4, {(uint8_t *)"FCU:DCDC短路保护(522035,4)",             (uint8_t *)"FCU:(522035,4)"},  0}, //FCU
/*1571*/{0xF5,   2853, 19, {(uint8_t *)"FCU:DCDC通信丢失故障(2853,19)",          (uint8_t *)"FCU:(2853,19)"},   0}, //FCU
/*1572*/{0xF5,  11181,  0, {(uint8_t *)"FCU:输出电流超过极限值(11181,0)",        (uint8_t *)"FCU:(11181,0)"},   0}, //FCU
/*1573*/{0xF5, 522000,  0, {(uint8_t *)"FCU:氢气压力高限值(522000,0)",           (uint8_t *)"FCU:(522000,0)"},  0}, //FCU
/*1574*/{0xF5, 522000,  1, {(uint8_t *)"FCU:氢气压力低限值(522000,1)",           (uint8_t *)"FCU:(522000,1)"},  0}, //FCU
/*1575*/{0xF5, 522001,  0, {(uint8_t *)"FCU:循环水压高限值(522001,0)",           (uint8_t *)"FCU:(522001,0)"},  0}, //FCU
/*1576*/{0xF5, 522001,  1, {(uint8_t *)"FCU:循环水压低限值(522001,1)",           (uint8_t *)"FCU:(522001,1)"},  0}, //FCU
/*1577*/{0xF5, 522002,  0, {(uint8_t *)"FCU:空压高限值(522002,0)",               (uint8_t *)"FCU:(522002,0)"},  0}, //FCU
/*1578*/{0xF5, 522002,  1, {(uint8_t *)"FCU:空压低限值(522002,1)",               (uint8_t *)"FCU:(522002,1)"},  0}, //FCU
/*1579*/{0xF5,  11187,  0, {(uint8_t *)"FCU:水入温度高限值(11187,0)",            (uint8_t *)"FCU:(11187,0)"},   0}, //FCU
/*1580*/{0xF5,  11188,  0, {(uint8_t *)"FCU:水出温度高限值(11188,0)",            (uint8_t *)"FCU:(11188,0)"},   0}, //FCU
/*1581*/{0xF5,  11172,  1, {(uint8_t *)"FCU:最小单体电池电压过低报警(11172,1)",  (uint8_t *)"FCU:(11172,1)"},   0}, //FCU
/*1582*/{0xF5, 522003,  0, {(uint8_t *)"FCU:电堆电流高限值(522003,0)",           (uint8_t *)"FCU:(522003,0)"},  0}, //FCU
/*1583*/{0xF5, 522004,  1, {(uint8_t *)"FCU:电堆电压低限值(522004,1)",           (uint8_t *)"FCU:(522004,1)"},  0}, //FCU
/*1584*/{0xF5, 522005,  0, {(uint8_t *)"FCU:回流泵电流高限值(522005,0)",         (uint8_t *)"FCU:(522005,0)"},  0}, //FCU
/*1585*/{0xF5, 522006, 12, {(uint8_t *)"FCU:升压DC通讯故障(522006,12)",          (uint8_t *)"FCU:(522006,12)"}, 0}, //FCU
/*1586*/{0xF5, 522007, 12, {(uint8_t *)"FCU:VCU通讯故障(522007,12)",             (uint8_t *)"FCU:(522007,12)"}, 0}, //FCU
/*1587*/{0xF5,  11181,  6, {(uint8_t *)"FCU:输出电流超过极限值(11181,6)",        (uint8_t *)"FCU:(11181,6)"},   0}, //FCU
/*1588*/{0xF5, 522000, 16, {(uint8_t *)"FCU:氢气压力高限值(522000,16)",          (uint8_t *)"FCU:(522000,16)"}, 0}, //FCU
/*1589*/{0xF5, 522000, 18, {(uint8_t *)"FCU:氢气压力低限值(522000,18)",          (uint8_t *)"FCU:(522000,18)"}, 0}, //FCU
/*1590*/{0xF5, 522001, 16, {(uint8_t *)"FCU:循环水压高限值(522001,16)",          (uint8_t *)"FCU:(522001,16)"}, 0}, //FCU
/*1591*/{0xF5, 522001, 18, {(uint8_t *)"FCU:循环水压低限值(522001,18)",          (uint8_t *)"FCU:(522001,18)"}, 0}, //FCU
/*1592*/{0xF5, 522002, 16, {(uint8_t *)"FCU:空压高限值(522002,16)",              (uint8_t *)"FCU:(522002,16)"}, 0}, //FCU
/*1593*/{0xF5, 522002, 18, {(uint8_t *)"FCU:空压低限值(522002,18)",              (uint8_t *)"FCU:(522002,18)"}, 0}, //FCU
/*1594*/{0xF5,  11187, 16, {(uint8_t *)"FCU:水入温度高限值(11187,16)",           (uint8_t *)"FCU:(11187,16)"},  0}, //FCU
/*1595*/{0xF5,  11188, 16, {(uint8_t *)"FCU:水出温度高限值(11188,16)",           (uint8_t *)"FCU:(11188,16)"},  0}, //FCU
/*1596*/{0xF5,  11172, 18, {(uint8_t *)"FCU:最小单体电池电压过低报警(11172,18)", (uint8_t *)"FCU:(11172,18)"},  0}, //FCU
/*1597*/{0xF5, 522003, 16, {(uint8_t *)"FCU:电堆电流高限值(522003,16)",          (uint8_t *)"FCU:(522003,16)"}, 0}, //FCU
/*1598*/{0xF5, 522004, 18, {(uint8_t *)"FCU:电堆电压低限值(522004,18)",          (uint8_t *)"FCU:(522004,18)"}, 0}, //FCU
/*1599*/{0xF5, 522005, 16, {(uint8_t *)"FCU:回流泵电流高限值(522005,16)",        (uint8_t *)"FCU:(522005,16)"}, 0}, //FCU
/*1600*/{0xF5, 522008, 19, {(uint8_t *)"FCU:空压机通讯故障(522008,19)",          (uint8_t *)"FCU:(522008,19)"}, 0}, //FCU
/*1601*/{0xF5, 522009, 19, {(uint8_t *)"FCU:回流泵通讯故障(522009,19)",          (uint8_t *)"FCU:(522009,19)"}, 0}, //FCU
/*1602*/{0xF5, 522010, 19, {(uint8_t *)"FCU:巡检1通讯故障(522010,19)",           (uint8_t *)"FCU:(522010,19)"}, 0}, //FCU
/*1603*/{0xF5, 522011, 19, {(uint8_t *)"FCU:巡检2通讯故障(522011,19)",           (uint8_t *)"FCU:(522011,19)"}, 0}, //FCU
/*1604*/{0xF5, 522012, 19, {(uint8_t *)"FCU:电压电流传感器通讯故障(522012,19)",  (uint8_t *)"FCU:(522012,19)"}, 0}, //FCU
/*1605*/{0xF5, 522004, 16, {(uint8_t *)"FCU:电堆电压高(522004,16)",              (uint8_t *)"FCU:(522004,16)"}, 0}, //FCU
/*1606*/{0xF5,0xFFFFF, 0xFF /*  11181, 15 */, {(uint8_t *)"FCU:输出电流超过极限值(11181,15)",       (uint8_t *)"FCU:(11181,15)"},  0}, //FCU
/*1607*/{0xF5,0xFFFFF, 0xFF /* 522000, 15 */, {(uint8_t *)"FCU:氢气压力高限值(522000,15)",          (uint8_t *)"FCU:(522000,15)"}, 0}, //FCU
/*1608*/{0xF5,0xFFFFF, 0xFF /* 522000, 17 */, {(uint8_t *)"FCU:氢气压力低限值(522000,17)",          (uint8_t *)"FCU:(522000,17)"}, 0}, //FCU
/*1609*/{0xF5,0xFFFFF, 0xFF /* 522001, 15 */, {(uint8_t *)"FCU:循环水压高限值(522001,15)",          (uint8_t *)"FCU:(522001,15)"}, 0}, //FCU
/*1610*/{0xF5,0xFFFFF, 0xFF /* 522001, 17 */, {(uint8_t *)"FCU:循环水压低限值(522001,17)",          (uint8_t *)"FCU:(522001,17)"}, 0}, //FCU
/*1611*/{0xF5,0xFFFFF, 0xFF /* 522002, 15 */, {(uint8_t *)"FCU:空压高限值(522002,15)",              (uint8_t *)"FCU:(522002,15)"}, 0}, //FCU
/*1612*/{0xF5,0xFFFFF, 0xFF /* 522002, 17 */, {(uint8_t *)"FCU:空压低限值(522002,17)",              (uint8_t *)"FCU:(522002,17)"}, 0}, //FCU
/*1613*/{0xF5,0xFFFFF, 0xFF /*  11187, 15 */, {(uint8_t *)"FCU:水入温度高限值(11187,15)",           (uint8_t *)"FCU:(11187,15)"},  0}, //FCU
/*1614*/{0xF5,0xFFFFF, 0xFF /*  11188, 15 */, {(uint8_t *)"FCU:水出温度高限值(11188,15)",           (uint8_t *)"FCU:(11188,15)"},  0}, //FCU
/*1615*/{0xF5,0xFFFFF, 0xFF /*  11172, 17 */, {(uint8_t *)"FCU:最小单体电池电压过低报警(11172,17)", (uint8_t *)"FCU:(11172,17)"},  0}, //FCU
/*1616*/{0xF5,0xFFFFF, 0xFF /* 522003, 15 */, {(uint8_t *)"FCU:电堆电流高限值(522003,15)",          (uint8_t *)"FCU:(522003,15)"}, 0}, //FCU
/*1617*/{0xF5,0xFFFFF, 0xFF /* 522004, 17 */, {(uint8_t *)"FCU:电堆电压低限值(522004,17)",          (uint8_t *)"FCU:(522004,17)"}, 0}, //FCU
/*1618*/{0xF5,0xFFFFF, 0xFF /* 522005, 15 */, {(uint8_t *)"FCU:回流泵电流高限值(522005,15)",        (uint8_t *)"FCU:(522005,15)"}, 0}, //FCU
/*1619*/{0x03,   7670,  5, {(uint8_t *)"AMT:传感器开路或取力器无法闭合(7670,5)", (uint8_t *)"AMT:(7670,5)"},    0}, //AMT
/*1620*/{0xF4,0xFFFFF, 0xFF /* 521415,  0 */, {(uint8_t *)"BMS:从机组1一级故障(521415,0)",          (uint8_t *)"BMS:(521415,0)"},  0}, //BMS
/*1621*/{0xF4, 522138,  0, {(uint8_t *)"BMS:加热膜加热回路故障(522138,0)",       (uint8_t *)"BMS:(522138,0)"},  0}, //BMS
/*1622*/{0xF4, 522139,  1, {(uint8_t *)"请更换充电桩, 无效则联系服务站保养",     (uint8_t *)"Please replace the charging pile"}, /* {(uint8_t *)"BMS:充电绝缘阻值低(522139,1)",           (uint8_t *)"BMS:(522139,1)"} , */  0}, //BMS
/*1623*/{0xF4, 522140,  9, {(uint8_t *)"BMS:ACAN通讯故障(522140,9)",             (uint8_t *)"BMS:(522140,9)"},  0}, //BMS
/*1624*/{0xF4, 522141,  9, {(uint8_t *)"请更换充电桩, 无效则联系服务站保养",     (uint8_t *)"Please replace the charging pile"}, /* {(uint8_t *)"BMS:插枪连接信号异常(522141,9)",         (uint8_t *)"BMS:(522141,9)"} , */  0}, //BMS
/*1625*/{0xF4, 522142,  0, {(uint8_t *)"BMS:充电时放电回路检测到电流(522142,0)", (uint8_t *)"BMS:(522142,0)"},  0}, //BMS
/*1626*/{0xF4,0xFFFFF,0xFF /* 522143,  5 */, {(uint8_t *)"BMS:电子锁故障(522143,5)",               (uint8_t *)"BMS:(522143,5)"},  0}, //BMS
/*1627*/{0xF4,0xFFFFF,0xFF /* 522144,  5 */, {(uint8_t *)"BMS:火警探测器故障(522144,5)",           (uint8_t *)"BMS:(522144,5)"},  0}, //BMS
/*1628*/{0xF4, 0xFFFFF,0xFF /* 522240,  5 */, {(uint8_t *)"换电系统:TMS系统故障(522240,5)",           (uint8_t *)"PECU:(522240,5)"},  0}, //换电系统
/*1629*/{0xF4, 522241, 16, {(uint8_t *)"换电系统:换电连接器过温故障(522241,16)",   (uint8_t *)"PECU:(522241,16)"}, 0},//换电系统
/*1630*/{0xF4, 522242,  5, {(uint8_t *)"换电系统:换电连接器锁止故障(522242,5)",    (uint8_t *)"PECU:(522242,5)"},  0},//换电系统
/*1631*/{0xF4, 522243,  5, {(uint8_t *)"换电系统:换电连接器连接故障(522243,5)",    (uint8_t *)"PECU:(522243,5)"},  0},//换电系统
/*1632*/{0xF4, 522244,  0, {(uint8_t *)"换电系统:换电连接器过温故障(522244,0)",    (uint8_t *)"PECU:(522244,0)"},  0},//换电系统
/*1633*/{0xF4, 522245,  9, {(uint8_t *)"换电系统:换电控制器CAN信息超时(522245,9)", (uint8_t *)"PECU:(522245,9)"},  0},//换电系统
/*1634*/{0xEF, 521727, 16, {(uint8_t *)"MCU:输出缺相故障(521727,16)",              (uint8_t *)"MCU:(521727,16)"},  0},//MCU
/*1635*/{0xEF,0xFFFFF, 0xFF /* 521728,  3 */, {(uint8_t *)"MCU:转速偏差过大故障(521728,3)",           (uint8_t *)"MCU:(521728,3)"},   0},//MCU
/*1636*/{0xEF,0xFFFFF, 0xFF /* 521729, 16 */, {(uint8_t *)"MCU:主动放电故障(521729,16)",              (uint8_t *)"MCU:(521729,16)"},  0},//MCU
/*1637*/{0x30, 521847,  0, {(uint8_t *)"空压机:电机过载(521847,0)",                (uint8_t *)"Air Compressor:(521847,0)"}, 0},//空压机
/*1638*/{0x03, 520200,  7, {(uint8_t *)"AMT:一轴位移传感器故障(520200,7)",         (uint8_t *)"AMT:(520200,7)"},   0},//AMT
/*1639*/{0x03, 520201,  7, {(uint8_t *)"AMT:二轴位移传感器故障(520201,7)",         (uint8_t *)"AMT:(520201,7)"},   0},//AMT
/*1640*/{0x03, 520202,  7, {(uint8_t *)"AMT:三轴位移传感器故障(520202,7)",         (uint8_t *)"AMT:(520202,7)"},   0},//AMT
/*1641*/{0x03, 520203,  7, {(uint8_t *)"AMT:一轴电磁阀故障(520203,7)",             (uint8_t *)"AMT:(520203,7)"},   0},//AMT
/*1642*/{0x03, 520204,  7, {(uint8_t *)"AMT:二轴电磁阀故障(520204,7)",             (uint8_t *)"AMT:(520204,7)"},   0},//AMT
/*1643*/{0x03, 520205,  7, {(uint8_t *)"AMT:三轴电磁阀故障(520205,7)",             (uint8_t *)"AMT:(520205,7)"},   0},//AMT
/*1644*/{0x03,0xFFFFF, 0xFF /* 520206,  7 */, {(uint8_t *)"AMT:输入轴转速传感器故障(520206,7)",       (uint8_t *)"AMT:(520206,7)"},   0},//AMT
/*1645*/{0x03, 520207,  7, {(uint8_t *)"AMT:输出轴转速传感器故障(520207,7)",       (uint8_t *)"AMT:(520207,7)"},   0},//AMT
/*1646*/{0x03, 520208,  7, {(uint8_t *)"AMT:整车CAN通讯故障(520208,7)",            (uint8_t *)"AMT:(520208,7)"},   0},//AMT
/*1647*/{0x03, 520209,  7, {(uint8_t *)"AMT:电机CAN通讯故障(520209,7)",            (uint8_t *)"AMT:(520209,7)"},   0},//AMT
/*1648*/{0x03, 520213,  7, {(uint8_t *)"AMT:挂挡失败故障(520213,7)",               (uint8_t *)"AMT:(520213,7)"},   0},//AMT
/*1649*/{0xA7,   9691, 12, {(uint8_t *)"ATS:电机冷却风扇故障(9691,12)",            (uint8_t *)"ATS:(9691,12)"},    0},//ATS
/*1650*/{0xA7,  12836, 12, {(uint8_t *)"ATS:进水温度传感器故障(12836,12)",         (uint8_t *)"ATS:(12836,12)"},   0},//ATS
/*1651*/{0xA7,  12837, 12, {(uint8_t *)"ATS:出水温度传感器故障(12837,12)",         (uint8_t *)"ATS:(12837,12)"},   0},//ATS
/*1652*/{0xA7,  12836,  5, {(uint8_t *)"ATS:进水温度传感器掉线(12836,5)",          (uint8_t *)"ATS:(12836,5)"},    0},//ATS
/*1653*/{0xA7,  12837,  5, {(uint8_t *)"ATS:出水温度传感器掉线(12837,5)",          (uint8_t *)"ATS:(12837,5)"},    0},//ATS
/*1654*/{0xF5, 522004,  0, {(uint8_t *)"FCU:电堆电压高(522004,0)",                 (uint8_t *)"FCU:(522004,0)"},   0},//FCU
/*1655*/{0xF5, 522008, 12, {(uint8_t *)"FCU:空压机通讯故障(522008,12)",            (uint8_t *)"FCU:(522008,12)"},  0},//FCU
/*1656*/{0xF5, 522010, 12, {(uint8_t *)"FCU:巡检1通讯故障(522010,12)",             (uint8_t *)"FCU:(522010,12)"},  0},//FCU
/*1657*/{0xF5, 522013, 19, {(uint8_t *)"FCU:电堆散热器控制器通讯故障(522013,19)",  (uint8_t *)"FCU:(522013,19)"},  0},//FCU
/*1658*/{0xF5, 522014, 16, {(uint8_t *)"FCU:空压机控制器过温警告(522014,16)",      (uint8_t *)"FCU:(522014,16)"},  0},//FCU
/*1659*/{0xF5, 522014,  0, {(uint8_t *)"FCU:空压机控制器过温报警(522014,0)",       (uint8_t *)"FCU:(522014,0)"},   0},//FCU
/*1660*/{0xF5, 522015, 16, {(uint8_t *)"FCU:空压机过温警告(522015,16)",            (uint8_t *)"FCU:(522015,16)"},  0},//FCU
/*1661*/{0xF5, 522015,  0, {(uint8_t *)"FCU:空压机过温报警(522015,0)",             (uint8_t *)"FCU:(522015,0)"},   0},//FCU
/*1662*/{0xF5, 522029, 19, {(uint8_t *)"FCU:燃料电池系统故障(522029,19)",          (uint8_t *)"FCU:(522029,19)"},  0},//FCU
/*1663*/{0xF5, 522029, 12, {(uint8_t *)"FCU:燃料电池系统故障(522029,12)",          (uint8_t *)"FCU:(522029,12)"},  0},//FCU
/*1664*/{0xF5, 522030,  0, {(uint8_t *)"FCU:DCDC电容端过压(522030,0)",             (uint8_t *)"FCU:(522030,0)"},   0},//FCU
/*1665*/{0xF5, 522030,  1, {(uint8_t *)"FCU:DCDC电容端欠压(522030,1)",             (uint8_t *)"FCU:(522030,1)"},   0},//FCU
/*1666*/{0xF5, 522031,  0, {(uint8_t *)"FCU:DCDC电容端过流(522031,0)",             (uint8_t *)"FCU:(522031,0)"},   0},//FCU
/*1667*/{0xF5, 522032,  0, {(uint8_t *)"FCU:DCDC电池端过压(522032,0)",             (uint8_t *)"FCU:(522032,0)"},   0},//FCU
/*1668*/{0xF5, 522032,  1, {(uint8_t *)"FCU:DCDC电池端欠压(522032,1)",             (uint8_t *)"FCU:(522032,1)"},   0},//FCU
/*1669*/{0xF5, 522033,  0, {(uint8_t *)"FCU:DCDC电池端过流(522033,0)",             (uint8_t *)"FCU:(522033,0)"},   0},//FCU
/*1670*/{0xF5, 522034,  0, {(uint8_t *)"FCU:DCDC过热(522034,0)",                   (uint8_t *)"FCU:(522034,0)"},   0},//FCU
/*1671*/{0xF5,   2853, 12, {(uint8_t *)"FCU:DCDC通信丢失故障(2853,12)",            (uint8_t *)"FCU:(2853,12)"},    0},//FCU
/*1672*/{0xF6, 522044,  1, {(uint8_t *)"HMS:瓶温过低(522044,1)",                   (uint8_t *)"HMS:(522044,1)"},   0},//HMS
/*1673*/{0xF6,0xFFFFF, 0xFF /* 522044, 18 */, {(uint8_t *)"HMS:瓶温过低(522044,18)",                  (uint8_t *)"HMS:(522044,18)"},  0},//HMS
/*1674*/{0xF6, 522045,  0, {(uint8_t *)"HMS:氢气泄露(522045,0)",                   (uint8_t *)"HMS:(522045,0)"},   0},//HMS
/*1675*/{0xF6, 522079, 19, {(uint8_t *)"HMS:车载供氢系统故障(522079,19)",          (uint8_t *)"HMS:(522079,19)"},  0},//HMS
/*1676*/{0xF6, 522079, 12, {(uint8_t *)"HMS:车载供氢系统故障(522079,12)",          (uint8_t *)"HMS:(522079,12)"},  0},//HMS

/*1677*/{0xE8, 131479, 18, {(uint8_t *)"LDWS:摄像头遮挡故障(131479,18)",     (uint8_t *)"LDWS:(131479,18)"}, 0}, //月照松摄像头
/*1678*/{0xE8, 131599, 18, {(uint8_t *)"LDWS:CAN通讯故障(131599,18)",        (uint8_t *)"LDWS:(131599,18)"}, 0}, //月照松摄像头
/*1679*/{0xE8, 131659, 18, {(uint8_t *)"LDWS:ECU超温保护(131659,18)",        (uint8_t *)"LDWS:(131659,18)"}, 0}, //月照松摄像头
/*1680*/{0xE8, 132169, 18, {(uint8_t *)"LDWS:ECU内部故障(132169,18)",        (uint8_t *)"LDWS:(132169,18)"}, 0}, //月照松摄像头
/*1681*/{0xE8, 132436, 18, {(uint8_t *)"LDWS:摄像头安装数据异常(132436,18)", (uint8_t *)"LDWS:(132436,18)"}, 0}, //月照松摄像头
/*1682*/{0xE8, 132629, 18, {(uint8_t *)"LDWS:供电电压异常(132629,18)",       (uint8_t *)"LDWS:(132629,18)"}, 0}, //月照松摄像头
/*1683*/{0xE8, 132630, 18, {(uint8_t *)"LDWS:供电电压异常(132630,18)",       (uint8_t *)"LDWS:(132630,18)"}, 0}, //月照松摄像头
/*1684*/{0xE8, 132631, 18, {(uint8_t *)"LDWS:供电电压异常(132631,18)",       (uint8_t *)"LDWS:(132631,18)"}, 0}, //月照松摄像头
/*1685*/{0xE8, 132632, 18, {(uint8_t *)"LDWS:供电电压异常(132632,18)",       (uint8_t *)"LDWS:(132632,18)"}, 0}, //月照松摄像头
/*1686*/{0xE8, 132633, 18, {(uint8_t *)"LDWS:雷达供电异常(132633,18)",       (uint8_t *)"LDWS:(132633,18)"}, 0}, //月照松摄像头
/*1687*/{0xE8, 132676, 18, {(uint8_t *)"LDWS:系统软件故障(132676,18)",       (uint8_t *)"LDWS:(132676,18)"}, 0}, //月照松摄像头
/*1688*/{0xE8, 132695, 18, {(uint8_t *)"LDWS:CAN通讯故障(132695,18)",        (uint8_t *)"LDWS:(132695,18)"}, 0}, //月照松摄像头
/*1689*/{0xE8, 134038, 18, {(uint8_t *)"LDWS:系统软件故障(134038,18)",       (uint8_t *)"LDWS:(134038,18)"}, 0}, //月照松摄像头
/*1690*/{0xE8, 134636, 18, {(uint8_t *)"LDWS:CAN通讯故障(134636,18)",        (uint8_t *)"LDWS:(134636,18)"}, 0}, //月照松摄像头
/*1691*/{0xE8, 134637, 18, {(uint8_t *)"LDWS:CAN通讯故障(134637,18)",        (uint8_t *)"LDWS:(134637,18)"}, 0}, //月照松摄像头
/*1692*/{0xE8, 136327, 18, {(uint8_t *)"LDWS:CAN通讯故障(136327,18)",        (uint8_t *)"LDWS:(136327,18)"}, 0}, //月照松摄像头
/*1693*/{0xE8, 136839, 18, {(uint8_t *)"LDWS:CAN通讯故障(136839,18)",        (uint8_t *)"LDWS:(136839,18)"}, 0}, //月照松摄像头
/*1694*/{0xE8, 137089, 18, {(uint8_t *)"LDWS:CAN通讯故障(137089,18)",        (uint8_t *)"LDWS:(137089,18)"}, 0}, //月照松摄像头
/*1695*/{0xE8, 140167, 18, {(uint8_t *)"LDWS:CAN通讯故障(140167,18)",        (uint8_t *)"LDWS:(140167,18)"}, 0}, //月照松摄像头
/*1696*/{0xE8, 140679, 18, {(uint8_t *)"LDWS:CAN通讯故障(140679,18)",        (uint8_t *)"LDWS:(140679,18)"}, 0}, //月照松摄像头
/*1697*/{0xE8, 145025, 18, {(uint8_t *)"LDWS:CAN通讯故障(145025,18)",        (uint8_t *)"LDWS:(145025,18)"}, 0}, //月照松摄像头
/*1698*/{0xE8, 145287, 18, {(uint8_t *)"LDWS:CAN通讯故障(145287,18)",        (uint8_t *)"LDWS:(145287,18)"}, 0}, //月照松摄像头
/*1699*/{0xE8, 145537, 18, {(uint8_t *)"LDWS:CAN通讯故障(145537,18)",        (uint8_t *)"LDWS:(145537,18)"}, 0}, //月照松摄像头
/*1700*/{0xE8, 145793, 18, {(uint8_t *)"LDWS:CAN通讯故障(145793,18)",        (uint8_t *)"LDWS:(145793,18)"}, 0}, //月照松摄像头
/*1701*/{0xE8, 147585, 18, {(uint8_t *)"LDWS:CAN通讯故障(147585,18)",        (uint8_t *)"LDWS:(147585,18)"}, 0}, //月照松摄像头
/*1702*/{0xE8, 147841, 18, {(uint8_t *)"LDWS:CAN通讯故障(147841,18)",        (uint8_t *)"LDWS:(147841,18)"}, 0}, //月照松摄像头
/*1703*/{0xE8, 160648, 18, {(uint8_t *)"LDWS:CAN总线故障(160648,18)",        (uint8_t *)"LDWS:(160648,18)"}, 0}, //月照松摄像头

/*1704*/{0xA0, 131478, 18, {(uint8_t *)"AEBS:ECU内部故障(131478,18)",        (uint8_t *)"AEBS:(131478,18)"}, 0}, //月照松雷达
/*1705*/{0xA0, 131479, 18, {(uint8_t *)"AEBS:摄像头遮挡故障(131479,18)",     (uint8_t *)"AEBS:(131479,18)"}, 0}, //月照松雷达
/*1706*/{0xA0, 131595, 18, {(uint8_t *)"AEBS:CAN通讯故障(131595,18)",        (uint8_t *)"AEBS:(131595,18)"}, 0}, //月照松雷达
/*1707*/{0xA0, 131599, 18, {(uint8_t *)"AEBS:CAN通讯故障(131599,18)",        (uint8_t *)"AEBS:(131599,18)"}, 0}, //月照松雷达
/*1708*/{0xA0, 131659, 18, {(uint8_t *)"AEBS:ECU超温保护(131659,18)",        (uint8_t *)"AEBS:(131659,18)"}, 0}, //月照松雷达
/*1709*/{0xA0, 132169, 18, {(uint8_t *)"AEBS:ECU内部故障(132169,18)",        (uint8_t *)"AEBS:(132169,18)"}, 0}, //月照松雷达
/*1710*/{0xA0, 132436, 18, {(uint8_t *)"AEBS:摄像头安装数据异常(132436,18)", (uint8_t *)"AEBS:(132436,18)"}, 0}, //月照松雷达
/*1711*/{0xA0, 132629, 18, {(uint8_t *)"AEBS:供电电压异常(132629,18)",       (uint8_t *)"AEBS:(132629,18)"}, 0}, //月照松雷达
/*1712*/{0xA0, 132630, 18, {(uint8_t *)"AEBS:供电电压异常(132630,18)",       (uint8_t *)"AEBS:(132630,18)"}, 0}, //月照松雷达
/*1713*/{0xA0, 132631, 18, {(uint8_t *)"AEBS:供电电压异常(132631,18)",       (uint8_t *)"AEBS:(132631,18)"}, 0}, //月照松雷达
/*1714*/{0xA0, 132632, 18, {(uint8_t *)"AEBS:供电电压异常(132632,18)",       (uint8_t *)"AEBS:(132632,18)"}, 0}, //月照松雷达
/*1715*/{0xA0, 132633, 18, {(uint8_t *)"AEBS:雷达供电异常(132633,18)",       (uint8_t *)"AEBS:(132633,18)"}, 0}, //月照松雷达
/*1716*/{0xA0, 132676, 18, {(uint8_t *)"AEBS:系统软件故障(132676,18)",       (uint8_t *)"AEBS:(132676,18)"}, 0}, //月照松雷达
/*1717*/{0xA0, 132695, 18, {(uint8_t *)"AEBS:CAN通讯故障(132695,18)",        (uint8_t *)"AEBS:(132695,18)"}, 0}, //月照松雷达
/*1718*/{0xA0, 134038, 18, {(uint8_t *)"AEBS:系统软件故障(134038,18)",       (uint8_t *)"AEBS:(134038,18)"}, 0}, //月照松雷达
/*1719*/{0xA0, 136065, 18, {(uint8_t *)"AEBS:CAN通讯故障(136065,18)",        (uint8_t *)"AEBS:(136065,18)"}, 0}, //月照松雷达
/*1720*/{0xA0, 136327, 18, {(uint8_t *)"AEBS:CAN通讯故障(136327,18)",        (uint8_t *)"AEBS:(136327,18)"}, 0}, //月照松雷达
/*1721*/{0xA0, 136577, 18, {(uint8_t *)"AEBS:CAN通讯故障(136577,18)",        (uint8_t *)"AEBS:(136577,18)"}, 0}, //月照松雷达
/*1722*/{0xA0, 136839, 18, {(uint8_t *)"AEBS:CAN通讯故障(136839,18)",        (uint8_t *)"AEBS:(136839,18)"}, 0}, //月照松雷达
/*1723*/{0xA0, 137089, 18, {(uint8_t *)"AEBS:CAN通讯故障(137089,18)",        (uint8_t *)"AEBS:(137089,18)"}, 0}, //月照松雷达
/*1724*/{0xA0, 137607, 18, {(uint8_t *)"AEBS:CAN通讯故障(137607,18)",        (uint8_t *)"AEBS:(137607,18)"}, 0}, //月照松雷达
/*1725*/{0xA0, 140167, 18, {(uint8_t *)"AEBS:CAN通讯故障(140167,18)",        (uint8_t *)"AEBS:(140167,18)"}, 0}, //月照松雷达
/*1726*/{0xA0, 140417, 18, {(uint8_t *)"AEBS:CAN通讯故障(140417,18)",        (uint8_t *)"AEBS:(140417,18)"}, 0}, //月照松雷达
/*1727*/{0xA0, 140679, 18, {(uint8_t *)"AEBS:CAN通讯故障(140679,18)",        (uint8_t *)"AEBS:(140679,18)"}, 0}, //月照松雷达
/*1728*/{0xA0, 140929, 18, {(uint8_t *)"AEBS:CAN通讯故障(140929,18)",        (uint8_t *)"AEBS:(140929,18)"}, 0}, //月照松雷达
/*1729*/{0xA0, 141191, 18, {(uint8_t *)"AEBS:CAN通讯故障(141191,18)",        (uint8_t *)"AEBS:(141191,18)"}, 0}, //月照松雷达
/*1730*/{0xA0, 141447, 18, {(uint8_t *)"AEBS:CAN通讯故障(141447,18)",        (uint8_t *)"AEBS:(141447,18)"}, 0}, //月照松雷达
/*1731*/{0xA0, 141697, 18, {(uint8_t *)"AEBS:CAN通讯故障(141697,18)",        (uint8_t *)"AEBS:(141697,18)"}, 0}, //月照松雷达
/*1732*/{0xA0, 143490, 18, {(uint8_t *)"AEBS:CAN通讯故障(143490,18)",        (uint8_t *)"AEBS:(143490,18)"}, 0}, //月照松雷达
/*1733*/{0xA0, 143747, 18, {(uint8_t *)"AEBS:CAN通讯故障(143747,18)",        (uint8_t *)"AEBS:(143747,18)"}, 0}, //月照松雷达
/*1734*/{0xA0, 144001, 18, {(uint8_t *)"AEBS:CAN通讯故障(144001,18)",        (uint8_t *)"AEBS:(144001,18)"}, 0}, //月照松雷达
/*1735*/{0xA0, 144257, 18, {(uint8_t *)"AEBS:私有网络通讯故障(144257,18)",   (uint8_t *)"AEBS:(144257,18)"}, 0}, //月照松雷达
/*1736*/{0xA0, 144258, 18, {(uint8_t *)"AEBS:私有网络通讯故障(144258,18)",   (uint8_t *)"AEBS:(144258,18)"}, 0}, //月照松雷达
/*1737*/{0xA0, 144259, 18, {(uint8_t *)"AEBS:私有网络通讯故障(144259,18)",   (uint8_t *)"AEBS:(144259,18)"}, 0}, //月照松雷达
/*1738*/{0xA0, 144267, 18, {(uint8_t *)"AEBS:CAN通讯故障(144267,18)",        (uint8_t *)"AEBS:(144267,18)"}, 0}, //月照松雷达
/*1739*/{0xA0, 144775, 18, {(uint8_t *)"AEBS:私有网络通讯故障(144775,18)",   (uint8_t *)"AEBS:(144775,18)"}, 0}, //月照松雷达
/*1740*/{0xA0, 145287, 18, {(uint8_t *)"AEBS:CAN通讯故障(145287,18)",        (uint8_t *)"AEBS:(145287,18)"}, 0}, //月照松雷达
/*1741*/{0xA0, 145537, 18, {(uint8_t *)"AEBS:CAN通讯故障(145537,18)",        (uint8_t *)"AEBS:(145537,18)"}, 0}, //月照松雷达
/*1742*/{0xA0, 145793, 18, {(uint8_t *)"AEBS:CAN通讯故障(145793,18)",        (uint8_t *)"AEBS:(145793,18)"}, 0}, //月照松雷达
/*1743*/{0xA0, 146180, 18, {(uint8_t *)"AEBS:ECU内部故障(146180,18)",        (uint8_t *)"AEBS:(146180,18)"}, 0}, //月照松雷达
/*1744*/{0xA0, 147585, 18, {(uint8_t *)"AEBS:CAN通讯故障(147585,18)",        (uint8_t *)"AEBS:(147585,18)"}, 0}, //月照松雷达
/*1745*/{0xA0, 147841, 18, {(uint8_t *)"AEBS:CAN通讯故障(147841,18)",        (uint8_t *)"AEBS:(147841,18)"}, 0}, //月照松雷达
/*1746*/{0xA0, 148865, 18, {(uint8_t *)"AEBS:CAN通讯故障(148865,18)",        (uint8_t *)"AEBS:(148865,18)"}, 0}, //月照松雷达
/*1747*/{0xA0, 149121, 18, {(uint8_t *)"AEBS:CAN通讯故障(149121,18)",        (uint8_t *)"AEBS:(149121,18)"}, 0}, //月照松雷达
/*1748*/{0xA0, 149383, 18, {(uint8_t *)"AEBS:CAN通讯故障(149383,18)",        (uint8_t *)"AEBS:(149383,18)"}, 0}, //月照松雷达
/*1749*/{0xA0, 150401, 18, {(uint8_t *)"AEBS:CAN通讯故障(150401,18)",        (uint8_t *)"AEBS:(150401,18)"}, 0}, //月照松雷达
/*1750*/{0xA0, 154503, 18, {(uint8_t *)"AEBS:CAN通讯故障(154503,18)",        (uint8_t *)"AEBS:(154503,18)"}, 0}, //月照松雷达
/*1751*/{0xA0, 154753, 18, {(uint8_t *)"AEBS:CAN通讯故障(154753,18)",        (uint8_t *)"AEBS:(154753,18)"}, 0}, //月照松雷达
/*1752*/{0xA0, 160648, 18, {(uint8_t *)"AEBS:CAN总线故障(160648,18)",        (uint8_t *)"AEBS:(160648,18)"}, 0}, //月照松雷达

/*1753*/{0xE8,     70,  9, {(uint8_t *)"AEBS:CCVS报文通讯超时(70,9)",          (uint8_t *)"AEBS:(70,9)"},     0}, //Knorr摄像头
/*1754*/{0xE8,     84,  2, {(uint8_t *)"AEBS:车速信号异常(84,2)",              (uint8_t *)"AEBS:(84,2)"},     0}, //Knorr摄像头
/*1755*/{0xE8,     84,  9, {(uint8_t *)"AEBS:车速信号异常(84,9)",              (uint8_t *)"AEBS:(84,9)"},     0}, //Knorr摄像头
/*1756*/{0xE8,     84, 19, {(uint8_t *)"AEBS:轮速信号异常(84,19)",             (uint8_t *)"AEBS:(84,19)"},    0}, //Knorr摄像头
/*1757*/{0xE8,    190,  2, {(uint8_t *)"AEBS:发动机转速信号异常(190,2)",       (uint8_t *)"AEBS:(190,2)"},    0}, //Knorr摄像头
/*1758*/{0xE8,    190,  9, {(uint8_t *)"AEBS:发动机转速信号异常(190,9)",       (uint8_t *)"AEBS:(190,9)"},    0}, //Knorr摄像头
/*1759*/{0xE8,    190, 19, {(uint8_t *)"AEBS:发动机转速信号异常(190,19)",      (uint8_t *)"AEBS:(190,19)"},   0}, //Knorr摄像头
/*1760*/{0xE8,    625,  9, {(uint8_t *)"AEBS:雷达通讯故障(625,9)",             (uint8_t *)"AEBS:(625,9)"},    0}, //Knorr摄像头
/*1761*/{0xE8,    639,  9, {(uint8_t *)"AEBS:摄像头总线通讯故障(639,9)",       (uint8_t *)"AEBS:(639,9)"},    0}, //Knorr摄像头
/*1762*/{0xE8,   1121,  9, {(uint8_t *)"AEBS:EBC1报文通讯超时(1121,9)",        (uint8_t *)"AEBS:(1121,9)"},   0}, //Knorr摄像头
/*1763*/{0xE8,   1121, 19, {(uint8_t *)"AEBS:EBC1制动信号异常(1121,19)",       (uint8_t *)"AEBS:(1121,19)"},  0}, //Knorr摄像头
/*1764*/{0xE8,   1705,  3, {(uint8_t *)"AEBS:摄像头供电电压高(1705,3)",        (uint8_t *)"AEBS:(1705,3)"},   0}, //Knorr摄像头
/*1765*/{0xE8,   1705,  4, {(uint8_t *)"AEBS:摄像头供电电压低(1705,4)",        (uint8_t *)"AEBS:(1705,4)"},   0}, //Knorr摄像头
/*1766*/{0xE8,   1705,  7, {(uint8_t *)"AEBS:摄像头被遮挡(1705,7)",            (uint8_t *)"AEBS:(1705,7)"},   0}, //Knorr摄像头
/*1767*/{0xE8,   1705, 12, {(uint8_t *)"AEBS:摄像头内部故障(1705,12)",         (uint8_t *)"AEBS:(1705,12)"},  0}, //Knorr摄像头
/*1768*/{0xE8,   1705, 13, {(uint8_t *)"AEBS:摄像头标定异常(1705,13)",         (uint8_t *)"AEBS:(1705,13)"},  0}, //Knorr摄像头
/*1769*/{0xE8,   1705, 14, {(uint8_t *)"AEBS:摄像头内部故障(1705,14)",         (uint8_t *)"AEBS:(1705,14)"},  0}, //Knorr摄像头
/*1770*/{0xE8,   1705, 31, {(uint8_t *)"AEBS:摄像头温度过高(1705,31)",         (uint8_t *)"AEBS:(1705,31)"},  0}, //Knorr摄像头
/*1771*/{0xE8,   1807,  2, {(uint8_t *)"AEBS:转向角度传感器信号异常(1807,2)",  (uint8_t *)"AEBS:(1807,2)"},   0}, //Knorr摄像头
/*1772*/{0xE8,   1807,  9, {(uint8_t *)"AEBS:转向角度传感器信号异常(1807,9)",  (uint8_t *)"AEBS:(1807,9)"},   0}, //Knorr摄像头
/*1773*/{0xE8,   1807, 19, {(uint8_t *)"AEBS:转向角度传感器信号异常(1807,19)", (uint8_t *)"AEBS:(1807,19)"},  0}, //Knorr摄像头
/*1774*/{0xE8,   1808,  2, {(uint8_t *)"AEBS:横摆角度传感器信号异常(1808,2)",  (uint8_t *)"AEBS:(1808,2)"},   0}, //Knorr摄像头
/*1775*/{0xE8,   1808,  9, {(uint8_t *)"AEBS:横摆角传感器信号异常(1808,9)",    (uint8_t *)"AEBS:(1808,9)"},   0}, //Knorr摄像头
/*1776*/{0xE8,   1808, 19, {(uint8_t *)"AEBS:横摆角度传感器信号异常(1808,19)", (uint8_t *)"AEBS:(1808,19)"},  0}, //Knorr摄像头
/*1777*/{0xE8,   1809,  2, {(uint8_t *)"AEBS:加速度传感器信号异常(1809,2)",    (uint8_t *)"AEBS:(1809,2)"},   0}, //Knorr摄像头
/*1778*/{0xE8,   1809,  9, {(uint8_t *)"AEBS:加速度传感器信号异常(1809,9)",    (uint8_t *)"AEBS:(1809,9)"},   0}, //Knorr摄像头
/*1779*/{0xE8,   1809, 19, {(uint8_t *)"AEBS:横摆角度传感器故障(1809,19)",     (uint8_t *)"AEBS:(1809,19)"},  0}, //Knorr摄像头
/*1780*/{0xE8,   2863, 14, {(uint8_t *)"AEBS:雨刮信号异常(2863,14)",           (uint8_t *)"AEBS:(2863,14)"},  0}, //Knorr摄像头
/*1781*/{0xE8,   2863, 19, {(uint8_t *)"AEBS:雨刮信号异常(2863,19)",           (uint8_t *)"AEBS:(2863,19)"},  0}, //Knorr摄像头
/*1782*/{0xE8,   2874, 19, {(uint8_t *)"AEBS:灯光信号异常(2874,19)",           (uint8_t *)"AEBS:(2874,19)"},  0}, //Knorr摄像头
/*1783*/{0xE8,   2875,  9, {(uint8_t *)"AEBS:灯光信号异常(2875,9)",            (uint8_t *)"AEBS:(2875,9)"},   0}, //Knorr摄像头
/*1784*/{0xE8,   2875, 19, {(uint8_t *)"AEBS:危险警报开关信号异常(2875,19)",   (uint8_t *)"AEBS:(2875,19)"},  0}, //Knorr摄像头
/*1785*/{0xE8,   2876,  2, {(uint8_t *)"AEBS:转向开关信号异常(2876,2)",        (uint8_t *)"AEBS:(2876,2)"},   0}, //Knorr摄像头
/*1786*/{0xE8,   2876,  9, {(uint8_t *)"AEBS:转向开关信号异常(2876,9)",        (uint8_t *)"AEBS:(2876,9)"},   0}, //Knorr摄像头
/*1787*/{0xE8,   2876, 19, {(uint8_t *)"AEBS:转向开关信号异常(2876,19)",       (uint8_t *)"AEBS:(2876,19)"},  0}, //Knorr摄像头
/*1788*/{0xE8,   3564,  9, {(uint8_t *)"AEBS:LDWS开关信号异常(3564,9)",        (uint8_t *)"AEBS:(3564,9)"},   0}, //Knorr摄像头
/*1789*/{0xE8,   3564, 14, {(uint8_t *)"AEBS:FLIC报文通讯超时(3564,14)",       (uint8_t *)"AEBS:(3564,14)"},  0}, //Knorr摄像头
/*1790*/{0xE8,   3564, 19, {(uint8_t *)"AEBS:LDWS开关信号异常(3564,19)",       (uint8_t *)"AEBS:(3564,19)"},  0}, //Knorr摄像头
/*1791*/{0xE8,   4011,  9, {(uint8_t *)"AEBS:灯光信号异常(4011,9)",            (uint8_t *)"AEBS:(4011,9)"},   0}, //Knorr摄像头
/*1792*/{0xE8, 516099,  9, {(uint8_t *)"AEBS:雨刮信号异常(516099,9)",          (uint8_t *)"AEBS:(516099,9)"}, 0}, //Knorr摄像头

/*1793*/{0x2A,     91,  2, {(uint8_t *)"AEBS:油门踏板信号异常(91,2)",           (uint8_t *)"AEBS:(91,2)"},    0}, //Knorr雷达
/*1794*/{0x2A,     91,  9, {(uint8_t *)"AEBS:油门踏板信号异常(91,9)",           (uint8_t *)"AEBS:(91,9)"},    0}, //Knorr雷达
/*1795*/{0x2A,     91, 14, {(uint8_t *)"AEBS:未收到EEC2报文(91,14)",            (uint8_t *)"AEBS:(91,14)"},   0}, //Knorr雷达
/*1796*/{0x2A,     91, 19, {(uint8_t *)"AEBS:油门踏板信号异常(91,19)",          (uint8_t *)"AEBS:(91,19)"},   0}, //Knorr雷达
/*1797*/{0x2A,    190,  2, {(uint8_t *)"AEBS:发动机转速信号异常(190,2)",        (uint8_t *)"AEBS:(190,2)"},   0}, //Knorr雷达
/*1798*/{0x2A,    190,  9, {(uint8_t *)"AEBS:发动机转速信号异常(190,9)",        (uint8_t *)"AEBS:(190,9)"},   0}, //Knorr雷达
/*1799*/{0x2A,    190, 14, {(uint8_t *)"AEBS:未收到EEC1报文(190,14)",           (uint8_t *)"AEBS:(190,14)"},  0}, //Knorr雷达
/*1800*/{0x2A,    190, 19, {(uint8_t *)"AEBS:发动机转速信号异常(190,19)",       (uint8_t *)"AEBS:(190,19)"},  0}, //Knorr雷达
/*1801*/{0x2A,    521,  2, {(uint8_t *)"AEBS:制动踏板位置信号异常(521,2)",      (uint8_t *)"AEBS:(521,2)"},   0}, //Knorr雷达
/*1802*/{0x2A,    521,  9, {(uint8_t *)"AEBS:制动踏板位置信号异常(521,9)",      (uint8_t *)"AEBS:(521,9)"},   0}, //Knorr雷达
/*1803*/{0x2A,    521, 19, {(uint8_t *)"AEBS:制动踏板位置信号异常(521,19)",     (uint8_t *)"AEBS:(521,19)"},  0}, //Knorr雷达
/*1804*/{0x2A,    523,  2, {(uint8_t *)"AEBS:变速箱档位信号异常(523,2)",        (uint8_t *)"AEBS:(523,2)"},   0}, //Knorr雷达
/*1805*/{0x2A,    523,  9, {(uint8_t *)"AEBS:变速箱档位信号异常(523,9)",        (uint8_t *)"AEBS:(523,9)"},   0}, //Knorr雷达
/*1806*/{0x2A,    523, 19, {(uint8_t *)"AEBS:变速箱档位信号异常(523,19)",       (uint8_t *)"AEBS:(523,19)"},  0}, //Knorr雷达
/*1807*/{0x2A,    524, 14, {(uint8_t *)"AEBS:未收到ETC2报文(524,14)",           (uint8_t *)"AEBS:(524,14)"},  0}, //Knorr雷达
/*1808*/{0x2A,    625,  2, {(uint8_t *)"AEBS:雷达和摄像头数据融合异常(625,2)",  (uint8_t *)"AEBS:(625,2)"},   0}, //Knorr雷达
/*1809*/{0x2A,    625,  9, {(uint8_t *)"AEBS:雷达和摄像头数据融合超时(625,9)",  (uint8_t *)"AEBS:(625,9)"},   0}, //Knorr雷达
/*1810*/{0x2A,    625, 10, {(uint8_t *)"AEBS:雷达和摄像头数据融合异常(625,10)", (uint8_t *)"AEBS:(625,10)"},  0}, //Knorr雷达
/*1811*/{0x2A,    625, 13, {(uint8_t *)"AEBS:雷达和摄像头数据融合异常(625,13)", (uint8_t *)"AEBS:(625,13)"},  0}, //Knorr雷达
/*1812*/{0x2A,    625, 19, {(uint8_t *)"AEBS:雷达和摄像头数据融合异常(625,19)", (uint8_t *)"AEBS:(625,19)"},  0}, //Knorr雷达
/*1813*/{0x2A,    630, 12, {(uint8_t *)"AEBS:雷达内部故障(630,12)",             (uint8_t *)"AEBS:(630,12)"},  0}, //Knorr雷达
/*1814*/{0x2A,    630, 14, {(uint8_t *)"AEBS:雷达内部故障(630,14)",             (uint8_t *)"AEBS:(630,14)"},  0}, //Knorr雷达
/*1815*/{0x2A,    639,  9, {(uint8_t *)"AEBS:雷达内部传感器故障(639,9)",       (uint8_t *)"AEBS:(639,9)"},  0}, //Knorr雷达
/*1816*/{0x2A,    639, 19, {(uint8_t *)"AEBS:雷达总线通讯故障(639,19)",         (uint8_t *)"AEBS:(639,19)"},  0}, //Knorr雷达
/*1817*/{0x2A,    701, 14, {(uint8_t *)"AEBS:J1939信号错误(701,14)",            (uint8_t *)"AEBS:(701,14)"},  0}, //Knorr雷达
/*1818*/{0x2A,    705,  9, {(uint8_t *)"AEBS:挂车ABS故障(705,9)",               (uint8_t *)"AEBS:(705,9)"},   0}, //Knorr雷达
/*1819*/{0x2A,    705, 19, {(uint8_t *)"AEBS:挂车ABS故障(705,19)",              (uint8_t *)"AEBS:(705,19)"},  0}, //Knorr雷达
/*1820*/{0x2A,    706,  9, {(uint8_t *)"AEBS:挂车ABS故障(706,9)",               (uint8_t *)"AEBS:(706,9)"},   0}, //Knorr雷达
/*1821*/{0x2A,    706, 19, {(uint8_t *)"AEBS:挂车ABS故障(706,19)",              (uint8_t *)"AEBS:(706,19)"},  0}, //Knorr雷达
/*1822*/{0x2A,    707,  2, {(uint8_t *)"AEBS:挂车ABS故障(707,2)",               (uint8_t *)"AEBS:(707,2)"},   0}, //Knorr雷达
/*1823*/{0x2A,    707,  9, {(uint8_t *)"AEBS:挂车ABS故障(707,9)",               (uint8_t *)"AEBS:(707,9)"},   0}, //Knorr雷达
/*1824*/{0x2A,    707, 19, {(uint8_t *)"AEBS:挂车ABS故障(707,19)",              (uint8_t *)"AEBS:(707,19)"},  0}, //Knorr雷达
/*1825*/{0x2A,    767,  9, {(uint8_t *)"AEBS:ETC5信号异常(767,9)",              (uint8_t *)"AEBS:(767,9)"},   0}, //Knorr雷达
/*1826*/{0x2A,    767, 14, {(uint8_t *)"AEBS:ETC5信号异常(767,14)",             (uint8_t *)"AEBS:(767,14)"},  0}, //Knorr雷达
/*1827*/{0x2A,    767, 19, {(uint8_t *)"AEBS:ETC5信号异常(767,19)",             (uint8_t *)"AEBS:(767,19)"},  0}, //Knorr雷达
/*1828*/{0x2A,    886,  1, {(uint8_t *)"AEBS:雷达天线故障(886,1)",              (uint8_t *)"AEBS:(886,1)"},   0}, //Knorr雷达
/*1829*/{0x2A,    886,  3, {(uint8_t *)"AEBS:雷达供电电压高(886,3)",            (uint8_t *)"AEBS:(886,3)"},   0}, //Knorr雷达
/*1830*/{0x2A,    886,  4, {(uint8_t *)"AEBS:雷达供电电压低(886,4)",            (uint8_t *)"AEBS:(886,4)"},   0}, //Knorr雷达
/*1831*/{0x2A,    886,  7, {(uint8_t *)"AEBS:雷达失调(886,7)",                  (uint8_t *)"AEBS:(886,7)"},   0}, //Knorr雷达
/*1832*/{0x2A,    886,  8, {(uint8_t *)"AEBS:雷达内部故障(886,8)",              (uint8_t *)"AEBS:(886,8)"},   0}, //Knorr雷达
/*1833*/{0x2A,    886, 12, {(uint8_t *)"AEBS:雷达内部故障(886,12)",             (uint8_t *)"AEBS:(886,12)"},  0}, //Knorr雷达
/*1834*/{0x2A,    886, 14, {(uint8_t *)"AEBS:雷达内部故障(886,14)",             (uint8_t *)"AEBS:(886,14)"},  0}, //Knorr雷达
/*1835*/{0x2A,    886, 17, {(uint8_t *)"AEBS:雷达被遮挡(886,17)",               (uint8_t *)"AEBS:(886,17)"},  0}, //Knorr雷达
/*1836*/{0x2A,    886, 18, {(uint8_t *)"AEBS:内部雷达/视频融合误差(886,18)",    (uint8_t *)"AEBS:(886,18)"},  0}, //Knorr雷达
/*1837*/{0x2A,    886, 31, {(uint8_t *)"AEBS:雷达内部故障(886,31)",             (uint8_t *)"AEBS:(886,31)"},  0}, //Knorr雷达
/*1838*/{0x2A,    904,  2, {(uint8_t *)"AEBS:前桥速度信号异常(904,2)",          (uint8_t *)"AEBS:(904,2)"},   0}, //Knorr雷达
/*1839*/{0x2A,    904,  9, {(uint8_t *)"AEBS:前桥速度信号异常(904,9)",          (uint8_t *)"AEBS:(904,9)"},   0}, //Knorr雷达
/*1840*/{0x2A,    904, 14, {(uint8_t *)"AEBS:未收到EBC2报文(904,14)",           (uint8_t *)"AEBS:(904,14)"},  0}, //Knorr雷达
/*1841*/{0x2A,    904, 19, {(uint8_t *)"AEBS:前桥速度信号异常(904,9)",          (uint8_t *)"AEBS:(904,9)"},   0}, //Knorr雷达
/*1842*/{0x2A,    905,  2, {(uint8_t *)"AEBS:左前轮轮速信号异常(905,2)",        (uint8_t *)"AEBS:(905,2)"},   0}, //Knorr雷达
/*1843*/{0x2A,    905,  9, {(uint8_t *)"AEBS:左前轮轮速信号异常(905,9)",        (uint8_t *)"AEBS:(905,9)"},   0}, //Knorr雷达
/*1844*/{0x2A,    905, 19, {(uint8_t *)"AEBS:左前轮轮速信号异常(905,19)",       (uint8_t *)"AEBS:(905,19)"},  0}, //Knorr雷达
/*1845*/{0x2A,    906,  2, {(uint8_t *)"AEBS:右前轮轮速信号异常(906,2)",        (uint8_t *)"AEBS:(906,2)"},   0}, //Knorr雷达
/*1846*/{0x2A,    906,  9, {(uint8_t *)"AEBS:右前轮轮速信号异常(906,9)",        (uint8_t *)"AEBS:(906,9)"},   0}, //Knorr雷达
/*1847*/{0x2A,    906, 19, {(uint8_t *)"AEBS:右前轮轮速信号异常(906,19)",       (uint8_t *)"AEBS:(906,19)"},  0}, //Knorr雷达
/*1848*/{0x2A,    907,  2, {(uint8_t *)"AEBS:左后轮轮速信号异常(907,2)",        (uint8_t *)"AEBS:(907,2)"},   0}, //Knorr雷达
/*1849*/{0x2A,    907,  9, {(uint8_t *)"AEBS:左后轮轮速信号异常(907,9)",        (uint8_t *)"AEBS:(907,9)"},   0}, //Knorr雷达
/*1850*/{0x2A,    907, 19, {(uint8_t *)"AEBS:左后轮轮速信号异常(907,19)",       (uint8_t *)"AEBS:(907,19)"},  0}, //Knorr雷达
/*1851*/{0x2A,    908,  2, {(uint8_t *)"AEBS:右后轮轮速信号异常(908,2)",        (uint8_t *)"AEBS:(908,2)"},   0}, //Knorr雷达
/*1852*/{0x2A,    908,  9, {(uint8_t *)"AEBS:右后轮轮速信号异常(908,9)",        (uint8_t *)"AEBS:(908,9)"},   0}, //Knorr雷达
/*1853*/{0x2A,    908, 19, {(uint8_t *)"AEBS:右后轮轮速信号异常(908,19)",       (uint8_t *)"AEBS:(908,19)"},  0}, //Knorr雷达
/*1854*/{0x2A,   1069, 13, {(uint8_t *)"AEBS:车速信号异常(1069,13)",            (uint8_t *)"AEBS:(1069,13)"}, 0}, //Knorr雷达
/*1855*/{0x2A,   1121,  9, {(uint8_t *)"AEBS:EBS制动开关信号异常(1121,9)",      (uint8_t *)"AEBS:(1121,9)"},  0}, //Knorr雷达
/*1856*/{0x2A,   1121, 19, {(uint8_t *)"AEBS:EBS制动开关信号异常(1121,19)",     (uint8_t *)"AEBS:(1121,19)"}, 0}, //Knorr雷达
/*1857*/{0x2A,   1196, 19, {(uint8_t *)"AEBS:向ABS请求制动失败(1196,19)",       (uint8_t *)"AEBS:(1196,19)"}, 0}, //Knorr雷达
/*1858*/{0x2A,   1243,  2, {(uint8_t *)"AEBS:ABS未完全响应(1243,2)",            (uint8_t *)"AEBS:(1243,2)"},  0}, //Knorr雷达
/*1859*/{0x2A,   1243,  9, {(uint8_t *)"AEBS:ABS运行信号丢失(1243,9)",          (uint8_t *)"AEBS:(1243,9)"},  0}, //Knorr雷达
/*1860*/{0x2A,   1243, 14, {(uint8_t *)"AEBS:未收到EBC1报文(1243,14)",          (uint8_t *)"AEBS:(1243,14)"}, 0}, //Knorr雷达
/*1861*/{0x2A,   1243, 19, {(uint8_t *)"AEBS:ABS运行信号异常(1243,19)",         (uint8_t *)"AEBS:(1243,19)"}, 0}, //Knorr雷达
/*1862*/{0x2A,   1807,  2, {(uint8_t *)"AEBS:转向角度传感器信号异常(1807,2)",   (uint8_t *)"AEBS:(1807,2)"},  0}, //Knorr雷达
/*1863*/{0x2A,   1807,  9, {(uint8_t *)"AEBS:转向角度传感器信号异常(1807,9)",   (uint8_t *)"AEBS:(1807,9)"},  0}, //Knorr雷达
/*1864*/{0x2A,   1807, 14, {(uint8_t *)"AEBS:未收到VDC2报文(1807,14)",          (uint8_t *)"AEBS:(1807,14)"}, 0}, //Knorr雷达
/*1865*/{0x2A,   1807, 19, {(uint8_t *)"AEBS:转向角度传感器信号异常(1807,19)",  (uint8_t *)"AEBS:(1807,19)"}, 0}, //Knorr雷达
/*1866*/{0x2A,   1814,  2, {(uint8_t *)"AEBS:ABS工作信号异常(1814,2)",          (uint8_t *)"AEBS:(1814,2)"},  0}, //Knorr雷达
/*1867*/{0x2A,   1814,  9, {(uint8_t *)"AEBS:ABS工作信号异常(1814,9)",          (uint8_t *)"AEBS:(1814,9)"},  0}, //Knorr雷达
/*1868*/{0x2A,   1814, 14, {(uint8_t *)"AEBS:未收ABS工作信号(1814,14)",         (uint8_t *)"AEBS:(1814,14)"}, 0}, //Knorr雷达
/*1869*/{0x2A,   1814, 19, {(uint8_t *)"AEBS:ABS工作信号异常(1814,19)",         (uint8_t *)"AEBS:(1814,19)"}, 0}, //Knorr雷达
/*1870*/{0x2A,   2876,  2, {(uint8_t *)"AEBS:转向开关信号异常(2876,2)",         (uint8_t *)"AEBS:(2876,2)"},  0}, //Knorr雷达
/*1871*/{0x2A,   2876,  9, {(uint8_t *)"AEBS:转向开关信号异常(2876,9)",         (uint8_t *)"AEBS:(2876,9)"},  0}, //Knorr雷达
/*1872*/{0x2A,   2876, 14, {(uint8_t *)"AEBS:未收到OEL报文(2876,14)",           (uint8_t *)"AEBS:(2876,14)"}, 0}, //Knorr雷达
/*1873*/{0x2A,   2876, 19, {(uint8_t *)"AEBS:转向开关信号异常(2876,19)",        (uint8_t *)"AEBS:(2876,19)"}, 0}, //Knorr雷达
/*1874*/{0x2A,   2917,  9, {(uint8_t *)"AEBS:XBR状态信号异常(2917,9)",          (uint8_t *)"AEBS:(2917,9)"},  0}, //Knorr雷达
/*1875*/{0x2A,   2917, 19, {(uint8_t *)"AEBS:XBR状态信号异常(2917,19)",         (uint8_t *)"AEBS:(2917,19)"}, 0}, //Knorr雷达
/*1876*/{0x2A,   2919, 14, {(uint8_t *)"AEBS:未收到EBC5报文(2919,14)",          (uint8_t *)"AEBS:(2919,14)"}, 0}, //Knorr雷达
/*1877*/{0x2A,   2920,  0, {(uint8_t *)"AEBS:AEBS制动过度(2920,0)",             (uint8_t *)"AEBS:(2920,0)"},  0}, //Knorr雷达
/*1878*/{0x2A,   2921, 12, {(uint8_t *)"AEBS:内部雷达传感器错误(2921,12)",      (uint8_t *)"AEBS:(2921,12)"}, 0}, //Knorr雷达
/*1879*/{0x2A,   2953, 12, {(uint8_t *)"AEBS:雷达内部故障(2953,12)",            (uint8_t *)"AEBS:(2953,12)"}, 0}, //Knorr雷达
/*1880*/{0x2A,   5676, 14, {(uint8_t *)"AEBS:雷达内部故障(5676,14)",            (uint8_t *)"AEBS:(5676,14)"}, 0}, //Knorr雷达
/*1881*/{0x2A,   5681,  9, {(uint8_t *)"AEBS:AEBS2激活信号异常(5681,9)",        (uint8_t *)"AEBS:(5681,9)"},  0}, //Knorr雷达
/*1882*/{0x2A,   5681, 13, {(uint8_t *)"AEBS:AEBS关闭(5681,13)",                (uint8_t *)"AEBS:(5681,13)"}, 0}, //Knorr雷达
/*1883*/{0x2A,   5681, 14, {(uint8_t *)"AEBS:未收到AEBS2报文(5681,14)",         (uint8_t *)"AEBS:(5681,14)"}, 0}, //Knorr雷达
/*1884*/{0x2A,   5681, 19, {(uint8_t *)"AEBS:AEBS2激活信号异常(5681,19)",       (uint8_t *)"AEBS:(5681,19)"}, 0}, //Knorr雷达
/*1885*/{0x2A,   5683, 19, {(uint8_t *)"AEBS:AEBS2校验信号异常(5683,19)",       (uint8_t *)"AEBS:(5683,19)"}, 0}, //Knorr雷达

/*1886*/{0x82, 522085, 12, {(uint8_t *)"进站维修，风扇故障", (uint8_t *)"TMS:(522085,12)"}, 0}, //TMS
/*1887*/{0xEF, 521702, 16, {(uint8_t *)"MCU:电机转速超速报警保护(521702,16)",  (uint8_t *)"MCU:(521702,16)"}, 0}, //MCU
/*1888*/{0x30, 521848,  0, {(uint8_t *)"空压机:超长时间输出报警(521848,0)", (uint8_t *)"Air Compressor:(521848,0)"},  0}, //空压机
/*1889*/{0x30, 521848, 23, {(uint8_t *)"空压机:通讯故障(521848,23)",        (uint8_t *)"Air Compressor:(521848,23)"}, 0}, //空压机
/*1890*/{0x30, 521849,  2, {(uint8_t *)"空压机:压力开关故障(521849,2)",     (uint8_t *)"Air Compressor:(521849,2)"},  0}, //空压机
/*1891*/{0xF6, 522044,  1, {(uint8_t *)"HMS:瓶温过低(522044,1)",            (uint8_t *)"HMS:(522044,1)"},     0}, //HMS
/*1892*/{0xF6,0xFFFFF, 0xFF /* 522044, 18 */, {(uint8_t *)"HMS:瓶温过低(522044,18)",           (uint8_t *)"HMS:(522044,18)"},    0}, //HMS
/*1893*/{0xF6, 522045,  0, {(uint8_t *)"HMS:氢气泄露(522045,0)",            (uint8_t *)"HMS:(522045,0)"},     0}, //HMS
/*1894*/{0xF6, 522079, 19, {(uint8_t *)"HMS:车载供氢系统故障(522079,19)",   (uint8_t *)"HMS:(522079,19)"},    0}, //HMS
/*1895*/{0xF6, 522079, 12, {(uint8_t *)"HMS:车载供氢系统故障(522079,12)",   (uint8_t *)"HMS:(522079,12)"},    0}, //HMS

/*1896*/{0xF0,0xFFFFF, 0xFF /* 521700, 16 */, {(uint8_t *)"MCU2:母线过压保护(521700,16)",                            (uint8_t *)"MCU2:(521700,16)"}, 0}, //MCU2
/*1897*/{0xF0, 521700,  0, {(uint8_t *)"MCU2:母线过压停机,高于最高工作电压(软件保护)(521700,0)",  (uint8_t *)"MCU2:(521700,0)"},  0}, //MCU2
/*1898*/{0xF0, 521700, 22, {(uint8_t *)"MCU2:母线过压停机,高于最高工作电压(硬件保护)(521700,22)", (uint8_t *)"MCU2:(521700,22)"}, 0}, //MCU2
/*1899*/{0xF0,0xFFFFF, 0xFF /* 521700, 18 */, {(uint8_t *)"MCU2:母线欠压保护(521700,18)",                            (uint8_t *)"MCU2:(521700,18)"}, 0}, //MCU2
/*1900*/{0xF0, 521700,  1, {(uint8_t *)"MCU2:母线欠压停机,低于最低工作电压(521700,1)",            (uint8_t *)"MCU2:(521700,1)"},  0}, //MCU2
/*1901*/{0xF0, 521701,  0, {(uint8_t *)"MCU2:母线电流过流停机,软件保护(521701,0)",                (uint8_t *)"MCU2:(521701,0)"},  0}, //MCU2
/*1902*/{0xF0, 521701, 22, {(uint8_t *)"MCU2:母线电流过流停机,硬件保护(521701,22)",               (uint8_t *)"MCU2:(521701,22)"}, 0}, //MCU2
/*1903*/{0xF0, 521702,  0, {(uint8_t *)"MCU2:电机转速超速停机保护(521702,0)",                     (uint8_t *)"MCU2:(521702,0)"},  0}, //MCU2
/*1904*/{0xF0,0xFFFFF, 0xFF /* 521703, 16 */, {(uint8_t *)"MCU2:电机绕组过温保护(521703,16)",                        (uint8_t *)"MCU2:(521703,16)"}, 0}, //MCU2
/*1905*/{0xF0, 521703,  0, {(uint8_t *)"MCU2:电机绕组过温停机(521703,0)",                         (uint8_t *)"MCU2:(521703,0)"},  0}, //MCU2
/*1906*/{0xF0,0xFFFFF, 0xFF /* 521704, 16 */, {(uint8_t *)"MCU2:功率模块温度过温保护(521704,16)",                    (uint8_t *)"MCU2:(521704,16)"}, 0}, //MCU2
/*1907*/{0xF0, 521704,  0, {(uint8_t *)"MCU2:功率模块温度过温停机(521704,0)",                     (uint8_t *)"MCU2:(521704,0)"},  0}, //MCU2
/*1908*/{0xF0, 521705, 22, {(uint8_t *)"MCU2:功率模块故障(521705,22)",                            (uint8_t *)"MCU2:(521705,22)"}, 0}, //MCU2
/*1909*/{0xF0,0xFFFFF, 0xFF /* 521706, 16 */, {(uint8_t *)"MCU2:相电流过载,软件保护(521706,16)",                     (uint8_t *)"MCU2:(521706,16)"}, 0}, //MCU2
/*1910*/{0xF0, 521706,  0, {(uint8_t *)"MCU2:相电流过流,软件保护(521706,0)",                      (uint8_t *)"MCU2:(521706,0)"},  0}, //MCU2
/*1911*/{0xF0, 521706, 22, {(uint8_t *)"MCU2:相电流过流,硬件保护,最严重等级(521706,22)",          (uint8_t *)"MCU2:(521706,22)"}, 0}, //MCU2
/*1912*/{0xF0,    168,  0, {(uint8_t *)"MCU2:24V供电电源过压,高于最高工作电压(168,0)",            (uint8_t *)"MCU2:(168,0)"},     0}, //MCU2
/*1913*/{0xF0,    168,  1, {(uint8_t *)"MCU2:24V供电电源欠压,低于最低工作电压(168,1)",            (uint8_t *)"MCU2:(168,1)"},     0}, //MCU2
/*1914*/{0xF0, 521708,  2, {(uint8_t *)"MCU2:U相电流传感器零偏过大(521708,2)",                    (uint8_t *)"MCU2:(521708,2)"},  0}, //MCU2
/*1915*/{0xF0, 521708,  4, {(uint8_t *)"MCU2:U相电流传感器与地短路、断线(521708,4)",              (uint8_t *)"MCU2:(521708,4)"},  0}, //MCU2
/*1916*/{0xF0, 521708,  3, {(uint8_t *)"MCU2:U相电流传感器与电源短路(521708,3)",                  (uint8_t *)"MCU2:(521708,3)"},  0}, //MCU2
/*1917*/{0xF0, 521710,  2, {(uint8_t *)"MCU2:W相电流传感器零偏过大(521710,2)",                    (uint8_t *)"MCU2:(521710,2)"},  0}, //MCU2
/*1918*/{0xF0, 521710,  4, {(uint8_t *)"MCU2:W相电流传感器与地短路、断线(521710,4)",              (uint8_t *)"MCU2:(521710,4)"},  0}, //MCU2
/*1919*/{0xF0, 521710,  3, {(uint8_t *)"MCU2:W相电流传感器与电源短路(521710,3)",                  (uint8_t *)"MCU2:(521710,3)"},  0}, //MCU2
/*1920*/{0xF0, 521713,  2, {(uint8_t *)"MCU2:电机温度传感器断线(521713,2)",                       (uint8_t *)"MCU2:(521713,2)"},  0}, //MCU2
/*1921*/{0xF0,0xFFFFF, 0xFF /*    630, 12 */, {(uint8_t *)"MCU2:控制器软件错误(630,12)",                             (uint8_t *)"MCU2:(630,12)"},    0}, //MCU2
/*1922*/{0xF0,    639,  9, {(uint8_t *)"MCU2:CAN通讯数据不连续或收不到,丢帧(639,9)",              (uint8_t *)"MCU2:(639,9)"},     0}, //MCU2
/*1923*/{0xF0,0xFFFFF, 0xFF /* 521717, 23 */, {(uint8_t *)"MCU2:电机堵转(521717,23)",                                (uint8_t *)"MCU2:(521717,23)"}, 0}, //MCU2
/*1924*/{0xF0,0xFFFFF, 0xFF /* 521718, 11 */, {(uint8_t *)"MCU2:10s之内同一故障出现3次(521718,11)",                  (uint8_t *)"MCU2:(521718,11)"}, 0}, //MCU2
/*1925*/{0xF0, 521719,  0, {(uint8_t *)"MCU2:UVW三相绝缘故障(521719,0)",                          (uint8_t *)"MCU2:(521719,0)"},  0}, //MCU2
/*1926*/{0xF0, 521720,  0, {(uint8_t *)"MCU2:电压传感器信号超过最大范围(521720,0)",               (uint8_t *)"MCU2:(521720,0)"},  0}, //MCU2
/*1927*/{0xF0, 521721,  0, {(uint8_t *)"MCU2:IGBT温度传感器信号超过最大范围(521721,0)",           (uint8_t *)"MCU2:(521721,0)"},  0}, //MCU2
/*1928*/{0xF0, 521721,  4, {(uint8_t *)"MCU2:IGBT温度传感器信号超过最小范围(521721,4)",           (uint8_t *)"MCU2:(521721,4)"},  0}, //MCU2
/*1929*/{0xF0, 521722,  0, {(uint8_t *)"MCU2:电机温度传感器信号超过最大范围(521722,0)",           (uint8_t *)"MCU2:(521722,0)"},  0}, //MCU2
/*1930*/{0xF0, 521722,  4, {(uint8_t *)"MCU2:电机温度传感器信号超过最小范围(521722,4)",           (uint8_t *)"MCU2:(521722,4)"},  0}, //MCU2
/*1931*/{0xF0, 521723,  2, {(uint8_t *)"MCU2:转速传感器信号错误(521723,2)",                       (uint8_t *)"MCU2:(521723,2)"},  0}, //MCU2
/*1932*/{0xF0, 521724,  0, {(uint8_t *)"MCU2:高压线路断路(521724,0)",                             (uint8_t *)"MCU2:(521724,0)"},  0}, //MCU2
/*1933*/{0xF0, 521725,  0, {(uint8_t *)"MCU2:初始化的所有故障(521725,0)",                         (uint8_t *)"MCU2:(521725,0)"},  0}, //MCU2
/*1934*/{0xF0, 521726,  2, {(uint8_t *)"MCU2:电流传感器偏移超出范围(521726,2)",                   (uint8_t *)"MCU2:(521726,2)"},  0}, //MCU2
/*1935*/{0xF0, 521727, 16, {(uint8_t *)"MCU2:输出缺相故障(521727,16)",                            (uint8_t *)"MCU2:(521727,16)"}, 0}, //MCU2
/*1936*/{0xF0,0xFFFFF, 0xFF /* 521728,  3 */, {(uint8_t *)"MCU2:转速偏差过大故障(521728,3)",                         (uint8_t *)"MCU2:(521728,3)"},  0}, //MCU2
/*1937*/{0xF0,0xFFFFF, 0xFF /* 521729, 16 */, {(uint8_t *)"MCU2:主动放电故障(521729,16)",                            (uint8_t *)"MCU2:(521729,16)"}, 0}, //MCU2
/*1938*/{0xF0, 521702, 16, {(uint8_t *)"MCU2:电机转速超速报警保护(521702,16)",                    (uint8_t *)"MCU2:(521702,16)"}, 0}, //MCU2

/*1939*/{0xF5, 522017,  1, {(uint8_t *)"FCU:低压供电欠压报警(522017,1)",    (uint8_t *)"FCU:(522017,1)"},  0},//FCU
/*1940*/{0xF5, 522016, 18, {(uint8_t *)"FCU:专用冷却液液位过低(522016,18)", (uint8_t *)"FCU:(522016,18)"}, 0},//FCU
/*1941*/{0xF5, 522027, 12, {(uint8_t *)"FCU:整车急停有效(522027,12)",       (uint8_t *)"FCU:(522027,12)"}, 0},//FCU
/*1942*/{0xF5, 522028, 12, {(uint8_t *)"FCU:HMS异常(522028,12)",            (uint8_t *)"FCU:(522028,12)"}, 0},//FCU V1.14由522026,12更新为(522028,12)

/*1943*/{0x31,0xFFFFF, 0xFF, {(uint8_t *)"HCU:车辆监管,上电限速限扭(1746,2)", (uint8_t *)"HCU:(1746,2)"}, 0},//HCU
/*1944*/{0x31,0xFFFFF, 0xFF, {(uint8_t *)"HCU:TBOX心跳异常(1746,9)",          (uint8_t *)"HCU:(1746,9)"}, 0},//HCU

/*1945*/{0xF4, 521305, 12, {(uint8_t *)"BMS:单体过放(521305,12)",                        (uint8_t *)"BMS:(521305,12)"}, 0}, //BMS
/*1946*/{0xF4, 521307,  6, {(uint8_t *)"请更换充电桩, 无效则联系服务站保养", (uint8_t *)"Please replace the charging pile"}, /* {(uint8_t *)"BMS:充电电流超限(521307,6)",                     (uint8_t *)"BMS:(521307,6)"}, */  0}, //BMS
/*1947*/{0xF4, 521328,  5, {(uint8_t *)"BMS:主正接触器无法闭合(521328,5)",               (uint8_t *)"BMS:(521328,5)"},  0}, //BMS
/*1948*/{0xF4, 521328,  3, {(uint8_t *)"BMS:主正接触器无法断开(521328,3)",               (uint8_t *)"BMS:(521328,3)"},  0}, //BMS
/*1949*/{0xF4, 521331,  5, {(uint8_t *)"BMS:直流充电B正接触器无法闭合(521331,5)",        (uint8_t *)"BMS:(521331,5)"},  0}, //BMS
/*1950*/{0xF4, 521331,  3, {(uint8_t *)"BMS:直流充电B正接触器无法断开(521331,3)",        (uint8_t *)"BMS:(521331,3)"},  0}, //BMS
/*1951*/{0xF4, 521332,  5, {(uint8_t *)"BMS:直流充电B负接触器无法闭合(521332,5)",        (uint8_t *)"BMS:(521332,5)"},  0}, //BMS
/*1952*/{0xF4, 521332,  3, {(uint8_t *)"BMS:直流充电B负接触器无法断开(521332,3)",       (uint8_t *)"BMS:(521332,3)"},  0}, //BMS
/*1953*/{0xF4,0xFFFFF, 0xFF /* 521353,  0 */, {(uint8_t *)"BMS:SOC差异过大报警(521353,0)",                  (uint8_t *)"BMS:(521353,0)"},  0}, //BMS
/*1954*/{0xF4, 521360, 15, {(uint8_t *)"BMS:持续一般放电过流(521360,15)",                    (uint8_t *)"BMS:(521360,15)"}, 0}, //BMS
/*1955*/{0xF4, 521360, 16, {(uint8_t *)"BMS:持续明显放电过流(521360,16)",                    (uint8_t *)"BMS:(521360,16)"}, 0}, //BMS
/*1956*/{0xF4, 521360,  0, {(uint8_t *)"BMS:持续严重放电过流(521360,0)",                     (uint8_t *)"BMS:(521360,0)"},  0}, //BMS
/*1957*/{0xF4,0xFFFFF, 0xFF /* 521361, 15 */, {(uint8_t *)"BMS:行车持续回充过流(521361,15)",                (uint8_t *)"BMS:(521361,15)"}, 0}, //BMS
/*1958*/{0xF4,0xFFFFF, 0xFF /* 521361, 16 */, {(uint8_t *)"BMS:行车持续回充过流(521361,16)",                (uint8_t *)"BMS:(521361,16)"}, 0}, //BMS
/*1959*/{0xF4,0xFFFFF, 0xFF /* 521361,  0 */, {(uint8_t *)"BMS:行车持续回充过流(521361,0)",                 (uint8_t *)"BMS:(521361,0)"},  0}, //BMS
/*1960*/{0xF4, 521362,  7, {(uint8_t *)"BMS:主回路预充或预检故障(521362,7)",             (uint8_t *)"BMS:(521362,7)"},  0}, //BMS
/*1961*/{0xF4, 521363,  7, {(uint8_t *)"BMS:辅件回路预充或预检故障(521363,7)",           (uint8_t *)"BMS:(521363,7)"},  0}, //BMS
/*1962*/{0xF4,0xFFFFF, 0xFF /* 521364, 12 */, {(uint8_t *)"BMS:BMS-DC-DC故障(521364,12)",                   (uint8_t *)"BMS:(521364,12)"}, 0}, //BMS
/*1963*/{0xF4, 521365, 12, {(uint8_t *)"BMS:充电插座NTC故障(521365,12)",                 (uint8_t *)"BMS:(521365,12)"}, 0}, //BMS
/*1964*/{0xF4,0xFFFFF, 0xFF /* 521366,  5 */, {(uint8_t *)"BMS:交流充电正接触器无法闭合故障报警(521366,5)", (uint8_t *)"BMS:(521366,5)"},  0}, //BMS
/*1965*/{0xF4,0xFFFFF, 0xFF /* 521366,  3 */, {(uint8_t *)"BMS:交流充电正接触器无法断开故障报警(521366,3)", (uint8_t *)"BMS:(521366,3)"},  0}, //BMS
/*1966*/{0xF4,0xFFFFF, 0xFF /* 521367,  5 */, {(uint8_t *)"BMS:交流充电负接触器无法闭合故障报警(521367,5)", (uint8_t *)"BMS:(521367,5)"},  0}, //BMS
/*1967*/{0xF4,0xFFFFF, 0xFF /* 521367,  3 */, {(uint8_t *)"BMS:交流充电负接触器无法断开故障报警(521367,3)", (uint8_t *)"BMS:(521367,3)"},  0}, //BMS

/*1968*/{0x2F, 274430, 11, {(uint8_t *)"ECAS:控制器内部故障(274430,11)",                (uint8_t *)"ECAS:(274430,11)"}, 0}, //瑞立ECAS
/*1969*/{0x2F, 274430,  2, {(uint8_t *)"ECAS:控制器内部故障(274430,2)",                 (uint8_t *)"ECAS:(274430,2)"},  0}, //瑞立ECAS
/*1970*/{0x2F, 274222,  3, {(uint8_t *)"ECAS:遥控器电源或线路故障(274222,3)",           (uint8_t *)"ECAS:(274222,3)"},  0}, //瑞立ECAS
/*1971*/{0x2F, 274210,  3, {(uint8_t *)"ECAS:电磁阀电源或线路故障(274210,3)",           (uint8_t *)"ECAS:(274210,3)"},  0}, //瑞立ECAS
/*1972*/{0x2F, 274210,  6, {(uint8_t *)"ECAS:电磁阀电源或线路故障(274210,6)",           (uint8_t *)"ECAS:(274210,6)"},  0}, //瑞立ECAS
/*1973*/{0x2F, 274223,  3, {(uint8_t *)"ECAS:遥控器电源或线路故障(274223,3)",           (uint8_t *)"ECAS:(274223,3)"},  0}, //瑞立ECAS
/*1974*/{0x2F, 274224,  3, {(uint8_t *)"ECAS:遥控器或线路故障(274224,3)",               (uint8_t *)"ECAS:(274224,3)"},  0}, //瑞立ECAS
/*1975*/{0x2F, 274192,  6, {(uint8_t *)"ECAS:前桥高度传感器或线路故障(274192,6)",       (uint8_t *)"ECAS:(274192,6)"},  0}, //瑞立ECAS
/*1976*/{0x2F, 274192,  5, {(uint8_t *)"ECAS:前桥高度传感器或线路故障(274192,5)",       (uint8_t *)"ECAS:(274192,5)"},  0}, //瑞立ECAS
/*1977*/{0x2F, 274192,  4, {(uint8_t *)"ECAS:前桥高度传感器或线路故障(274192,4)",       (uint8_t *)"ECAS:(274192,4)"},  0}, //瑞立ECAS
/*1978*/{0x2F, 274195,  6, {(uint8_t *)"ECAS:后桥高度传感器或线路故障(274195,6)",       (uint8_t *)"ECAS:(274195,6)"},  0}, //瑞立ECAS
/*1979*/{0x2F, 274195,  5, {(uint8_t *)"ECAS:后桥高度传感器或线路故障(274195,5)",       (uint8_t *)"ECAS:(274195,5)"},  0}, //瑞立ECAS
/*1980*/{0x2F, 274195,  4, {(uint8_t *)"ECAS:后桥高度传感器或线路故障(274195,4)",       (uint8_t *)"ECAS:(274195,4)"},  0}, //瑞立ECAS
/*1981*/{0x2F, 274194,  6, {(uint8_t *)"ECAS:后桥高度传感器或线路故障(274194,6)",       (uint8_t *)"ECAS:(274194,6)"},  0}, //瑞立ECAS
/*1982*/{0x2F, 274194,  5, {(uint8_t *)"ECAS:后桥高度传感器或线路故障(274194,5)",       (uint8_t *)"ECAS:(274194,5)"},  0}, //瑞立ECAS
/*1983*/{0x2F, 274194,  4, {(uint8_t *)"ECAS:后桥高度传感器或线路故障(274194,4)",       (uint8_t *)"ECAS:(274194,4)"},  0}, //瑞立ECAS
/*1984*/{0x2F, 274198,  6, {(uint8_t *)"ECAS:前桥气囊气压传感器或线路故障(274198,6)",   (uint8_t *)"ECAS:(274198,6)"},  0}, //瑞立ECAS
/*1985*/{0x2F, 274198,  3, {(uint8_t *)"ECAS:前桥气囊气压传感器或线路故障(274198,3)",   (uint8_t *)"ECAS:(274198,3)"},  0}, //瑞立ECAS
/*1986*/{0x2F, 274198,  5, {(uint8_t *)"ECAS:前桥气囊气压传感器或线路故障(274198,5)",   (uint8_t *)"ECAS:(274198,5)"},  0}, //瑞立ECAS
/*1987*/{0x2F, 274201,  6, {(uint8_t *)"ECAS:驱动桥气囊气压传感器或线路故障(274201,6)", (uint8_t *)"ECAS:(274201,6)"},  0}, //瑞立ECAS
/*1988*/{0x2F, 274201,  3, {(uint8_t *)"ECAS:驱动桥气囊气压传感器或线路故障(274201,3)", (uint8_t *)"ECAS:(274201,3)"},  0}, //瑞立ECAS
/*1989*/{0x2F, 274201,  5, {(uint8_t *)"ECAS:驱动桥气囊气压传感器或线路故障(274201,5)", (uint8_t *)"ECAS:(274201,5)"},  0}, //瑞立ECAS
/*1990*/{0x2F, 274200,  6, {(uint8_t *)"ECAS:驱动桥气囊气压传感器或线路故障(274200,6)", (uint8_t *)"ECAS:(274200,6)"},  0}, //瑞立ECAS
/*1991*/{0x2F, 274200,  3, {(uint8_t *)"ECAS:驱动桥气囊气压传感器或线路故障(274200,3)", (uint8_t *)"ECAS:(274200,3)"},  0}, //瑞立ECAS
/*1992*/{0x2F, 274200,  5, {(uint8_t *)"ECAS:驱动桥气囊气压传感器或线路故障(274200,5)", (uint8_t *)"ECAS:(274200,5)"},  0}, //瑞立ECAS
/*1993*/{0x2F, 274203,  6, {(uint8_t *)"ECAS:第三桥气囊气压传感器或线路故障(274203,6)", (uint8_t *)"ECAS:(274203,6)"},  0}, //瑞立ECAS
/*1994*/{0x2F, 274203,  3, {(uint8_t *)"ECAS:第三桥气囊气压传感器或线路故障(274203,3)", (uint8_t *)"ECAS:(274203,3)"},  0}, //瑞立ECAS
/*1995*/{0x2F, 274203,  5, {(uint8_t *)"ECAS:第三桥气囊气压传感器或线路故障(274203,5)", (uint8_t *)"ECAS:(274203,5)"},  0}, //瑞立ECAS
/*1996*/{0x2F, 274202,  6, {(uint8_t *)"ECAS:第三桥气囊气压传感器或线路故障(274202,6)", (uint8_t *)"ECAS:(274202,6)"},  0}, //瑞立ECAS
/*1997*/{0x2F, 274202,  3, {(uint8_t *)"ECAS:第三桥气囊气压传感器或线路故障(274202,3)", (uint8_t *)"ECAS:(274202,3)"},  0}, //瑞立ECAS
/*1998*/{0x2F, 274202,  5, {(uint8_t *)"ECAS:第三桥气囊气压传感器或线路故障(274202,5)", (uint8_t *)"ECAS:(274202,5)"},  0}, //瑞立ECAS
/*1999*/{0x2F, 274204,  6, {(uint8_t *)"ECAS:提升气囊气压传感器或线路故障(274204,6)",   (uint8_t *)"ECAS:(274204,6)"},  0}, //瑞立ECAS
/*2000*/{0x2F, 274204,  3, {(uint8_t *)"ECAS:提升气囊气压传感器或线路故障(274204,3)",   (uint8_t *)"ECAS:(274204,3)"},  0}, //瑞立ECAS
/*2001*/{0x2F, 274204,  5, {(uint8_t *)"ECAS:提升气囊气压传感器或线路故障(274204,5)",   (uint8_t *)"ECAS:(274204,5)"},  0}, //瑞立ECAS
/*2002*/{0x2F, 274177,  6, {(uint8_t *)"ECAS:前桥电磁阀或线路故障(274177,6)",           (uint8_t *)"ECAS:(274177,6)"},  0}, //瑞立ECAS
/*2003*/{0x2F, 274177,  3, {(uint8_t *)"ECAS:前桥电磁阀或线路故障(274177,3)",           (uint8_t *)"ECAS:(274177,3)"},  0}, //瑞立ECAS
/*2004*/{0x2F, 274177,  5, {(uint8_t *)"ECAS:前桥电磁阀或线路故障(274177,5)",           (uint8_t *)"ECAS:(274177,5)"},  0}, //瑞立ECAS
/*2005*/{0x2F, 274180,  6, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274180,6)",         (uint8_t *)"ECAS:(274180,6)"},  0}, //瑞立ECAS
/*2006*/{0x2F, 274180,  3, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274180,3)",         (uint8_t *)"ECAS:(274180,3)"},  0}, //瑞立ECAS
/*2007*/{0x2F, 274180,  5, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274180,5)",         (uint8_t *)"ECAS:(274180,5)"},  0}, //瑞立ECAS
/*2008*/{0x2F, 274183,  6, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274183,6)",         (uint8_t *)"ECAS:(274183,6)"},  0}, //瑞立ECAS
/*2009*/{0x2F, 274183,  3, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274183,3)",         (uint8_t *)"ECAS:(274183,3)"},  0}, //瑞立ECAS
/*2010*/{0x2F, 274183,  5, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274183,5)",         (uint8_t *)"ECAS:(274183,5)"},  0}, //瑞立ECAS
/*2011*/{0x2F, 274179,  6, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274179,6)",         (uint8_t *)"ECAS:(274179,6)"},  0}, //瑞立ECAS
/*2012*/{0x2F, 274179,  3, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274179,3)",         (uint8_t *)"ECAS:(274179,3)"},  0}, //瑞立ECAS
/*2013*/{0x2F, 274179,  5, {(uint8_t *)"ECAS:驱动桥电磁阀或线路故障(274179,5)",         (uint8_t *)"ECAS:(274179,5)"},  0}, //瑞立ECAS
/*2014*/{0x2F, 274182,  6, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274182,6)",         (uint8_t *)"ECAS:(274182,6)"},  0}, //瑞立ECAS
/*2015*/{0x2F, 274182,  3, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274182,3)",         (uint8_t *)"ECAS:(274182,3)"},  0}, //瑞立ECAS
/*2016*/{0x2F, 274182,  5, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274182,5)",         (uint8_t *)"ECAS:(274182,5)"},  0}, //瑞立ECAS
/*2017*/{0x2F, 274181,  6, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274181,6)",         (uint8_t *)"ECAS:(274181,6)"},  0}, //瑞立ECAS
/*2018*/{0x2F, 274181,  3, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274181,3)",         (uint8_t *)"ECAS:(274181,3)"},  0}, //瑞立ECAS
/*2019*/{0x2F, 274181,  5, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274181,5)",         (uint8_t *)"ECAS:(274181,5)"},  0}, //瑞立ECAS
/*2020*/{0x2F, 274219,  6, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274219,6)",         (uint8_t *)"ECAS:(274219,6)"},  0}, //瑞立ECAS
/*2021*/{0x2F, 274219,  3, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274219,3)",         (uint8_t *)"ECAS:(274219,3)"},  0}, //瑞立ECAS
/*2022*/{0x2F, 274219,  5, {(uint8_t *)"ECAS:第三桥电磁阀或线路故障(274219,5)",         (uint8_t *)"ECAS:(274219,5)"},  0}, //瑞立ECAS
/*2023*/{0x2F, 274186,  6, {(uint8_t *)"ECAS:提升气囊电磁阀或线路故障(274186,6)",       (uint8_t *)"ECAS:(274186,6)"},  0}, //瑞立ECAS
/*2024*/{0x2F, 274186,  3, {(uint8_t *)"ECAS:提升气囊电磁阀或线路故障(274186,3)",       (uint8_t *)"ECAS:(274186,3)"},  0}, //瑞立ECAS
/*2025*/{0x2F, 274186,  5, {(uint8_t *)"ECAS:提升气囊电磁阀或线路故障(274186,5)",       (uint8_t *)"ECAS:(274186,5)"},  0}, //瑞立ECAS
/*2026*/{0x2F, 274237,  9, {(uint8_t *)"ECAS:CAN总线信号超时(274237,9)",                (uint8_t *)"ECAS:(274237,9)"},  0}, //瑞立ECAS
/*2027*/{0x2F, 274244,  9, {(uint8_t *)"ECAS:CAN总线信号超时(274244,9)",                (uint8_t *)"ECAS:(274244,9)"},  0}, //瑞立ECAS
/*2028*/{0x2F, 274251,  9, {(uint8_t *)"ECAS:CAN总线信号超时(274251,9)",                (uint8_t *)"ECAS:(274251,9)"},  0}, //瑞立ECAS
/*2029*/{0x2F,      1,  3, {(uint8_t *)"ECAS:前桥右2/2电磁阀或线路故障(1,3)",          (uint8_t *)"ECAS:(1,3)"},    0}, //WabcoECAS
/*2030*/{0x2F,      1,  5, {(uint8_t *)"ECAS:前桥右2/2电磁阀或线路故障(1,5)",          (uint8_t *)"ECAS:(1,5)"},    0}, //WabcoECAS
/*2031*/{0x2F,      1,  6, {(uint8_t *)"ECAS:前桥右2/2电磁阀或线路故障(1,6)",          (uint8_t *)"ECAS:(1,6)"},    0}, //WabcoECAS
/*2032*/{0x2F,      3,  3, {(uint8_t *)"ECAS:驱动桥右2/2电磁阀或线路故障(3,3)",        (uint8_t *)"ECAS:(3,3)"},    0}, //WabcoECAS
/*2033*/{0x2F,      3,  5, {(uint8_t *)"ECAS:驱动桥右2/2电磁阀或线路故障(3,5)",        (uint8_t *)"ECAS:(3,5)"},    0}, //WabcoECAS
/*2034*/{0x2F,      3,  6, {(uint8_t *)"ECAS:驱动桥右2/2电磁阀或线路故障(3,6)",        (uint8_t *)"ECAS:(3,6)"},    0}, //WabcoECAS
/*2035*/{0x2F,      4,  3, {(uint8_t *)"ECAS:驱动桥左2/2电磁阀或线路故障(4,3)",        (uint8_t *)"ECAS:(4,3)"},    0}, //WabcoECAS
/*2036*/{0x2F,      4,  5, {(uint8_t *)"ECAS:驱动桥左2/2电磁阀或线路故障(4,5)",        (uint8_t *)"ECAS:(4,5)"},    0}, //WabcoECAS
/*2037*/{0x2F,      4,  6, {(uint8_t *)"ECAS:驱动桥左2/2电磁阀或线路故障(4,6)",        (uint8_t *)"ECAS:(4,6)"},    0}, //WabcoECAS
/*2038*/{0x2F,      5,  3, {(uint8_t *)"ECAS:第三桥右2/2电磁阀或线路故障(5,3)",        (uint8_t *)"ECAS:(5,3)"},    0}, //WabcoECAS
/*2039*/{0x2F,      5,  5, {(uint8_t *)"ECAS:第三桥右2/2电磁阀或线路故障(5,5)",        (uint8_t *)"ECAS:(5,5)"},    0}, //WabcoECAS
/*2040*/{0x2F,      5,  6, {(uint8_t *)"ECAS:第三桥右2/2电磁阀或线路故障(5,6)",        (uint8_t *)"ECAS:(5,6)"},    0}, //WabcoECAS
/*2041*/{0x2F,      6,  3, {(uint8_t *)"ECAS:第三桥左2/2电磁阀或线路故障(6,3)",        (uint8_t *)"ECAS:(6,3)"},    0}, //WabcoECAS
/*2042*/{0x2F,      6,  5, {(uint8_t *)"ECAS:第三桥左2/2电磁阀或线路故障(6,5)",        (uint8_t *)"ECAS:(6,5)"},    0}, //WabcoECAS
/*2043*/{0x2F,      6,  6, {(uint8_t *)"ECAS:第三桥左2/2电磁阀或线路故障(6,6)",        (uint8_t *)"ECAS:(6,6)"},    0}, //WabcoECAS
/*2044*/{0x2F,      7,  3, {(uint8_t *)"ECAS:驱动桥电磁阀中央3/2阀或线路故障(7,3)",    (uint8_t *)"ECAS:(7,3)"},    0}, //WabcoECAS
/*2045*/{0x2F,      7,  5, {(uint8_t *)"ECAS:驱动桥电磁阀中央3/2阀或线路故障(7,5)",    (uint8_t *)"ECAS:(7,5)"},    0}, //WabcoECAS
/*2046*/{0x2F,      7,  6, {(uint8_t *)"ECAS:驱动桥电磁阀中央3/2阀或线路故障(7,6)",    (uint8_t *)"ECAS:(7,6)"},    0}, //WabcoECAS
/*2047*/{0x2F,      8,  3, {(uint8_t *)"ECAS:第三桥提升3/3电磁阀或线路故障(8,3)",      (uint8_t *)"ECAS:(8,3)"},    0}, //WabcoECAS
/*2048*/{0x2F,      8,  5, {(uint8_t *)"ECAS:第三桥提升3/3电磁阀或线路故障(8,5)",      (uint8_t *)"ECAS:(8,5)"},    0}, //WabcoECAS
/*2049*/{0x2F,      8,  6, {(uint8_t *)"ECAS:第三桥提升3/3电磁阀或线路故障(8,6)",      (uint8_t *)"ECAS:(8,6)"},    0}, //WabcoECAS
/*2050*/{0x2F,      9,  3, {(uint8_t *)"ECAS:第三桥下降3/3电磁阀或线路故障(9,3)",      (uint8_t *)"ECAS:(9,3)"},    0}, //WabcoECAS
/*2051*/{0x2F,      9,  5, {(uint8_t *)"ECAS:第三桥下降3/3电磁阀或线路故障(9,5)",      (uint8_t *)"ECAS:(9,5)"},    0}, //WabcoECAS
/*2052*/{0x2F,      9,  6, {(uint8_t *)"ECAS:第三桥下降3/3电磁阀或线路故障(9,6)",      (uint8_t *)"ECAS:(9,6)"},    0}, //WabcoECAS
/*2053*/{0x2F,     10,  3, {(uint8_t *)"ECAS:第三桥提升气囊2/2电磁阀或线路故障(10,3)", (uint8_t *)"ECAS:(10,3)"},   0}, //WabcoECAS
/*2054*/{0x2F,     10,  5, {(uint8_t *)"ECAS:第三桥提升气囊2/2电磁阀或线路故障(10,5)", (uint8_t *)"ECAS:(10,5)"},   0}, //WabcoECAS
/*2055*/{0x2F,     10,  6, {(uint8_t *)"ECAS:第三桥提升气囊2/2电磁阀或线路故障(10,6)", (uint8_t *)"ECAS:(10,6)"},   0}, //WabcoECAS
/*2056*/{0x2F,     16,  2, {(uint8_t *)"ECAS:前桥右高度传感器或线路故障(16,2)",        (uint8_t *)"ECAS:(16,2)"},   0}, //WabcoECAS
/*2057*/{0x2F,     16,  3, {(uint8_t *)"ECAS:前桥右高度传感器或线路故障(16,3)",        (uint8_t *)"ECAS:(16,3)"},   0}, //WabcoECAS
/*2058*/{0x2F,     16,  5, {(uint8_t *)"ECAS:前桥右高度传感器或线路故障(16,5)",        (uint8_t *)"ECAS:(16,5)"},   0}, //WabcoECAS
/*2059*/{0x2F,     16,  6, {(uint8_t *)"ECAS:前桥右高度传感器或线路故障(16,6)",        (uint8_t *)"ECAS:(16,6)"},   0}, //WabcoECAS
/*2060*/{0x2F,     18,  2, {(uint8_t *)"ECAS:驱动桥右高度传感器或线路故障(18,2)",      (uint8_t *)"ECAS:(18,2)"},   0}, //WabcoECAS
/*2061*/{0x2F,     18,  3, {(uint8_t *)"ECAS:驱动桥右高度传感器或线路故障(18,3)",      (uint8_t *)"ECAS:(18,3)"},   0}, //WabcoECAS
/*2062*/{0x2F,     18,  5, {(uint8_t *)"ECAS:驱动桥右高度传感器或线路故障(18,5)",      (uint8_t *)"ECAS:(18,5)"},   0}, //WabcoECAS
/*2063*/{0x2F,     18,  6, {(uint8_t *)"ECAS:驱动桥右高度传感器或线路故障(18,6)",      (uint8_t *)"ECAS:(18,6)"},   0}, //WabcoECAS
/*2064*/{0x2F,     19,  2, {(uint8_t *)"ECAS:驱动桥左高度传感器或线路故障(19,2)",      (uint8_t *)"ECAS:(19,2)"},   0}, //WabcoECAS
/*2065*/{0x2F,     19,  3, {(uint8_t *)"ECAS:驱动桥左高度传感器或线路故障(19,3)",      (uint8_t *)"ECAS:(19,3)"},   0}, //WabcoECAS
/*2066*/{0x2F,     19,  5, {(uint8_t *)"ECAS:驱动桥左高度传感器或线路故障(19,5)",      (uint8_t *)"ECAS:(19,5)"},   0}, //WabcoECAS
/*2067*/{0x2F,     19,  6, {(uint8_t *)"ECAS:驱动桥左高度传感器或线路故障(19,6)",      (uint8_t *)"ECAS:(19,6)"},   0}, //WabcoECAS
/*2068*/{0x2F,     22,  3, {(uint8_t *)"ECAS:前桥右压力传感器或线路故障(22,3)",        (uint8_t *)"ECAS:(22,3)"},   0}, //WabcoECAS
/*2069*/{0x2F,     22,  5, {(uint8_t *)"ECAS:前桥右压力传感器或线路故障(22,5)",        (uint8_t *)"ECAS:(22,5)"},   0}, //WabcoECAS
/*2070*/{0x2F,     22,  6, {(uint8_t *)"ECAS:前桥右压力传感器或线路故障(22,6)",        (uint8_t *)"ECAS:(22,6)"},   0}, //WabcoECAS
/*2071*/{0x2F,     24,  3, {(uint8_t *)"ECAS:驱动桥右压力传感器或线路故障(24,3)",      (uint8_t *)"ECAS:(24,3)"},   0}, //WabcoECAS
/*2072*/{0x2F,     24,  5, {(uint8_t *)"ECAS:驱动桥右压力传感器或线路故障(24,5)",      (uint8_t *)"ECAS:(24,5)"},   0}, //WabcoECAS
/*2073*/{0x2F,     24,  6, {(uint8_t *)"ECAS:驱动桥右压力传感器或线路故障(24,6)",      (uint8_t *)"ECAS:(24,6)"},   0}, //WabcoECAS
/*2074*/{0x2F,     25,  3, {(uint8_t *)"ECAS:驱动桥左压力传感器或线路故障(25,3)",      (uint8_t *)"ECAS:(25,3)"},   0}, //WabcoECAS
/*2075*/{0x2F,     25,  5, {(uint8_t *)"ECAS:驱动桥左压力传感器或线路故障(25,5)",      (uint8_t *)"ECAS:(25,5)"},   0}, //WabcoECAS
/*2076*/{0x2F,     25,  6, {(uint8_t *)"ECAS:驱动桥左压力传感器或线路故障(25,6)",      (uint8_t *)"ECAS:(25,6)"},   0}, //WabcoECAS
/*2077*/{0x2F,     26,  3, {(uint8_t *)"ECAS:第三桥右压力传感器或线路故障(26,3)",      (uint8_t *)"ECAS:(26,3)"},   0}, //WabcoECAS
/*2078*/{0x2F,     26,  5, {(uint8_t *)"ECAS:第三桥右压力传感器或线路故障(26,5)",      (uint8_t *)"ECAS:(26,5)"},   0}, //WabcoECAS
/*2079*/{0x2F,     26,  6, {(uint8_t *)"ECAS:第三桥右压力传感器或线路故障(26,6)",      (uint8_t *)"ECAS:(26,6)"},   0}, //WabcoECAS
/*2080*/{0x2F,     27,  3, {(uint8_t *)"ECAS:第三桥左压力传感器或线路故障(27,3)",      (uint8_t *)"ECAS:(27,3)"},   0}, //WabcoECAS
/*2081*/{0x2F,     27,  5, {(uint8_t *)"ECAS:第三桥左压力传感器或线路故障(27,5)",      (uint8_t *)"ECAS:(27,5)"},   0}, //WabcoECAS
/*2082*/{0x2F,     27,  6, {(uint8_t *)"ECAS:第三桥左压力传感器或线路故障(27,6)",      (uint8_t *)"ECAS:(27,6)"},   0}, //WabcoECAS
/*2083*/{0x2F,     28,  3, {(uint8_t *)"ECAS:提升气囊压力传感器或线路故障(28,3)",      (uint8_t *)"ECAS:(28,3)"},   0}, //WabcoECAS
/*2084*/{0x2F,     28,  5, {(uint8_t *)"ECAS:提升气囊压力传感器或线路故障(28,5)",      (uint8_t *)"ECAS:(28,5)"},   0}, //WabcoECAS
/*2085*/{0x2F,     28,  6, {(uint8_t *)"ECAS:提升气囊压力传感器或线路故障(28,6)",      (uint8_t *)"ECAS:(28,6)"},   0}, //WabcoECAS
/*2086*/{0x2F,     33, 11, {(uint8_t *)"ECAS:遥控器故障(33,11)",                       (uint8_t *)"ECAS:(33,11)"},  0}, //WabcoECAS
/*2087*/{0x2F,     34,  3, {(uint8_t *)"ECAS:中间继动电磁阀电源或线路故障(34,3)",      (uint8_t *)"ECAS:(34,3)"},   0}, //WabcoECAS
/*2088*/{0x2F,     34,  5, {(uint8_t *)"ECAS:中间继动电磁阀电源或线路故障(34,5)",      (uint8_t *)"ECAS:(34,5)"},   0}, //WabcoECAS
/*2089*/{0x2F,     34,  6, {(uint8_t *)"ECAS:中间继动电磁阀电源或线路故障(34,6)",      (uint8_t *)"ECAS:(34,6)"},   0}, //WabcoECAS
/*2090*/{0x2F,     34, 11, {(uint8_t *)"ECAS:电磁阀电源故障(34,11)",                   (uint8_t *)"ECAS:(34,11)"},  0}, //WabcoECAS
/*2091*/{0x2F,     38,  2, {(uint8_t *)"ECAS:ECU故障(38,2)",                           (uint8_t *)"ECAS:(38,2)"},   0}, //WabcoECAS
/*2092*/{0x2F,     39,  2, {(uint8_t *)"ECAS:ECU参数错误(39,2)",                       (uint8_t *)"ECAS:(39,2)"},   0}, //WabcoECAS
/*2093*/{0x2F,     39, 13, {(uint8_t *)"ECAS:ECU参数错误(39,13)",                      (uint8_t *)"ECAS:(39,13)"},  0}, //WabcoECAS
/*2094*/{0x2F,     40,  2, {(uint8_t *)"ECAS:高度传感器数据错误(40,2)",                (uint8_t *)"ECAS:(40,2)"},   0}, //WabcoECAS
/*2095*/{0x2F,     40, 13, {(uint8_t *)"ECAS:高度传感器数据错误(40,13)",               (uint8_t *)"ECAS:(40,13)"},  0}, //WabcoECAS
/*2096*/{0x2F,     41,  2, {(uint8_t *)"ECAS:压力传感器数据错误(41,2)",                (uint8_t *)"ECAS:(41,2)"},   0}, //WabcoECAS
/*2097*/{0x2F,     42,  2, {(uint8_t *)"ECAS:最大轴荷数据不正常(42,2)",                (uint8_t *)"ECAS:(42,2)"},   0}, //WabcoECAS
/*2098*/{0x2F,     42, 11, {(uint8_t *)"ECAS:最大轴荷数据不正常(42,11)",               (uint8_t *)"ECAS:(42,11)"},  0}, //WabcoECAS
/*2099*/{0x2F,     42, 12, {(uint8_t *)"ECAS:最大轴荷数据不正常(42,12)",               (uint8_t *)"ECAS:(42,12)"},  0}, //WabcoECAS
/*2100*/{0x2F,     46,  3, {(uint8_t *)"ECAS:压力传感器电源电压高于14V(46,3)",         (uint8_t *)"ECAS:(46,3)"},   0}, //WabcoECAS
/*2101*/{0x2F,     46,  6, {(uint8_t *)"ECAS:压力传感器电源电压低于4V(46,6)",          (uint8_t *)"ECAS:(46,6)"},   0}, //WabcoECAS
/*2102*/{0x2F,     47,  3, {(uint8_t *)"ECAS:ECAS遥控器电源电压高于3.5V(47,3)",        (uint8_t *)"ECAS:(47,3)"},   0}, //WabcoECAS
/*2103*/{0x2F,     47,  6, {(uint8_t *)"ECAS:ECAS遥控器电源电压低于1.0V(47,6)",        (uint8_t *)"ECAS:(47,6)"},   0}, //WabcoECAS
/*2104*/{0x2F,     48,  3, {(uint8_t *)"ECAS:遥控器数据线或线路故障(48,3)",            (uint8_t *)"ECAS:(48,3)"},   0}, //WabcoECAS
/*2105*/{0x2F,     48,  6, {(uint8_t *)"ECAS:遥控器数据线或线路故障(48,6)",            (uint8_t *)"ECAS:(48,6)"},   0}, //WabcoECAS
/*2106*/{0x2F,     49,  3, {(uint8_t *)"ECAS:遥控器时钟线或线路故障(49,3)",            (uint8_t *)"ECAS:(49,3)"},   0}, //WabcoECAS
/*2107*/{0x2F,     49,  6, {(uint8_t *)"ECAS:遥控器时钟线或线路故障(49,6)",            (uint8_t *)"ECAS:(49,6)"},   0}, //WabcoECAS
/*2108*/{0x2F,     60,  9, {(uint8_t *)"ECAS:总线故障(60,9)",                          (uint8_t *)"ECAS:(60,9)"},   0}, //WabcoECAS
/*2109*/{0x2F,    231,  9, {(uint8_t *)"ECAS:总线故障(231,9)",                         (uint8_t *)"ECAS:(231,9)"},  0}, //WabcoECAS
/*2110*/{0x2F,     61,  9, {(uint8_t *)"ECAS:总线报文超时(61,9)",                      (uint8_t *)"ECAS:(61,9)"},   0}, //WabcoECAS
/*2111*/{0x2F,     62,  9, {(uint8_t *)"ECAS:总线报文超时(62,9)",                      (uint8_t *)"ECAS:(62,9)"},   0}, //WabcoECAS
/*2112*/{0x2F,     65,  9, {(uint8_t *)"ECAS:总线报文超时(65,9)",                      (uint8_t *)"ECAS:(65,9)"},   0}, //WabcoECAS
/*2113*/{0x2F,     68,  9, {(uint8_t *)"ECAS:总线报文超时(68,9)",                      (uint8_t *)"ECAS:(68,9)"},   0}, //WabcoECAS
/*2114*/{0x2F,     74,  9, {(uint8_t *)"ECAS:总线报文超时(74,9)",                      (uint8_t *)"ECAS:(74,9)"},   0}, //WabcoECAS
/*2115*/{0x2F,     75,  9, {(uint8_t *)"ECAS:总线报文超时(75,9)",                      (uint8_t *)"ECAS:(75,9)"},   0}, //WabcoECAS
/*2116*/{0x2F,     77,  9, {(uint8_t *)"ECAS:总线报文超时(77,9)",                      (uint8_t *)"ECAS:(77,9)"},   0}, //WabcoECAS
/*2117*/{0x2F,     92,  2, {(uint8_t *)"ECAS:ECU内部总线数据错误(92,2)",               (uint8_t *)"ECAS:(92,2)"},   0}, //WabcoECAS
/*2118*/{0x2F,     98,  2, {(uint8_t *)"ECAS:系统部件匹配不正常(98,2)",                (uint8_t *)"ECAS:(98,2)"},   0}, //WabcoECAS
/*2119*/{0x2F,     98, 11, {(uint8_t *)"ECAS:系统部件匹配不正常(98,11)",               (uint8_t *)"ECAS:(98,11)"},  0}, //WabcoECAS
/*2120*/{0x2F,    254,  2, {(uint8_t *)"ECAS:ECU故障(254,2)",                          (uint8_t *)"ECAS:(254,2)"},  0}, //WabcoECAS
/*2121*/{0x2F,    254, 11, {(uint8_t *)"ECAS:ECU故障(254,11)",                         (uint8_t *)"ECAS:(254,11)"}, 0}, //WabcoECAS
/*2122*/{0x2F,    254, 12, {(uint8_t *)"ECAS:ECU故障(254,12)",                         (uint8_t *)"ECAS:(254,12)"}, 0}, //WabcoECAS
/*2123*/{0x2F,    629, 11, {(uint8_t *)"ECAS:ECU故障(629,11)",                   (uint8_t *)"ECAS:(629,11)"},    0}, //KnorrECAS
/*2124*/{0x2F,    629, 14, {(uint8_t *)"ECAS:ECU故障(629,14)",                   (uint8_t *)"ECAS:(629,14)"},    0}, //KnorrECAS
/*2125*/{0x2F,    629,  2, {(uint8_t *)"ECAS:ECU故障(629,2)",                    (uint8_t *)"ECAS:(629,2)"},     0}, //KnorrECAS
/*2126*/{0x2F,    630, 14, {(uint8_t *)"ECAS:ECU故障(630,14)",                   (uint8_t *)"ECAS:(630,14)"},    0}, //KnorrECAS
/*2127*/{0x2F,   1635, 12, {(uint8_t *)"ECAS:ECU故障(1635,12)",                  (uint8_t *)"ECAS:(1635,12)"},   0}, //KnorrECAS
/*2128*/{0x2F,   1635,  2, {(uint8_t *)"ECAS:ECU故障(1635,2)",                   (uint8_t *)"ECAS:(1635,2)"},    0}, //KnorrECAS
/*2129*/{0x2F,    630, 11, {(uint8_t *)"ECAS:ECU故障(630,11)",                   (uint8_t *)"ECAS:(630,11)"},    0}, //KnorrECAS
/*2130*/{0x2F,    630, 13, {(uint8_t *)"ECAS:ECU故障(630,13)",                   (uint8_t *)"ECAS:(630,13)"},    0}, //KnorrECAS
/*2131*/{0x2F,    629, 12, {(uint8_t *)"ECAS:ECU故障(629,12)",                   (uint8_t *)"ECAS:(629,12)"},    0}, //KnorrECAS
/*2132*/{0x2F,    629, 10, {(uint8_t *)"ECAS:ECU故障(629,10)",                   (uint8_t *)"ECAS:(629,10)"},    0}, //KnorrECAS
/*2133*/{0x2F,    234, 12, {(uint8_t *)"ECAS:ECU故障(234,12)",                   (uint8_t *)"ECAS:(234,12)"},    0}, //KnorrECAS
/*2134*/{0x2F,    234,  1, {(uint8_t *)"ECAS:ECU故障(234,1)",                    (uint8_t *)"ECAS:(234,1)"},     0}, //KnorrECAS
/*2135*/{0x2F,    234,  2, {(uint8_t *)"ECAS:ECU故障(234,2)",                    (uint8_t *)"ECAS:(234,2)"},     0}, //KnorrECAS
/*2136*/{0x2F,    630, 12, {(uint8_t *)"ECAS:ECU故障(630,12)",                   (uint8_t *)"ECAS:(630,12)"},    0}, //KnorrECAS
/*2137*/{0x2F,    630,  2, {(uint8_t *)"ECAS:ECU故障(630,2)",                    (uint8_t *)"ECAS:(630,2)"},     0}, //KnorrECAS
/*2138*/{0x2F,   1827, 11, {(uint8_t *)"ECAS:高度控制未达目标值(1827,11)",       (uint8_t *)"ECAS:(1827,11)"},   0}, //KnorrECAS
/*2139*/{0x2F,    627,  3, {(uint8_t *)"ECAS:供电电压异常(627,3)",               (uint8_t *)"ECAS:(627,3)"},     0}, //KnorrECAS
/*2140*/{0x2F,    627,  4, {(uint8_t *)"ECAS:供电电压异常(627,4)",               (uint8_t *)"ECAS:(627,4)"},     0}, //KnorrECAS
/*2141*/{0x2F,    627,  5, {(uint8_t *)"ECAS:供电电压异常(627,5)",               (uint8_t *)"ECAS:(627,5)"},     0}, //KnorrECAS
/*2142*/{0x2F,   3509, 13, {(uint8_t *)"ECAS:供电电压异常(3509,13)",             (uint8_t *)"ECAS:(3509,13)"},   0}, //KnorrECAS
/*2143*/{0x2F,   3509,  4, {(uint8_t *)"ECAS:供电电压异常(3509,4)",              (uint8_t *)"ECAS:(3509,4)"},    0}, //KnorrECAS
/*2144*/{0x2F,   3509,  3, {(uint8_t *)"ECAS:供电电压异常(3509,3)",              (uint8_t *)"ECAS:(3509,3)"},    0}, //KnorrECAS
/*2145*/{0x2F,    639, 11, {(uint8_t *)"ECAS:CAN通讯故障(639,11)",               (uint8_t *)"ECAS:(639,11)"},    0}, //KnorrECAS
/*2146*/{0x2F, 523860, 19, {(uint8_t *)"ECAS:TD时间报文通讯超时(523860,19)",     (uint8_t *)"ECAS:(523860,19)"}, 0}, //KnorrECAS
/*2147*/{0x2F, 523861, 19, {(uint8_t *)"ECAS:ASC2报文通讯超时(523861,19)",       (uint8_t *)"ECAS:(523861,19)"}, 0}, //KnorrECAS
/*2148*/{0x2F, 523862, 19, {(uint8_t *)"ECAS:ASC2报文通讯超时(523862,19)",       (uint8_t *)"ECAS:(523862,19)"}, 0}, //KnorrECAS
/*2149*/{0x2F, 523863, 19, {(uint8_t *)"ECAS:EEC1报文通讯超时(523863,19)",       (uint8_t *)"ECAS:(523863,19)"}, 0}, //KnorrECAS
/*2150*/{0x2F, 523864, 19, {(uint8_t *)"ECAS:EBC1报文通讯超时(523864,19)",       (uint8_t *)"ECAS:(523864,19)"}, 0}, //KnorrECAS
/*2151*/{0x2F, 523865, 19, {(uint8_t *)"ECAS:EBC2报文通讯超时(523865,19)",       (uint8_t *)"ECAS:(523865,19)"}, 0}, //KnorrECAS
/*2152*/{0x2F, 523866, 19, {(uint8_t *)"ECAS:EBC3报文通讯超时(523866,19)",       (uint8_t *)"ECAS:(523866,19)"}, 0}, //KnorrECAS
/*2153*/{0x2F, 523867, 19, {(uint8_t *)"ECAS:TCO1报文通讯超时(523867,19)",       (uint8_t *)"ECAS:(523867,19)"}, 0}, //KnorrECAS
/*2154*/{0x2F, 523868, 19, {(uint8_t *)"ECAS:VDC1报文通讯超时(523868,19)",       (uint8_t *)"ECAS:(523868,19)"}, 0}, //KnorrECAS
/*2155*/{0x2F, 523869, 19, {(uint8_t *)"ECAS:VDC2报文通讯超时(523869,19)",       (uint8_t *)"ECAS:(523869,19)"}, 0}, //KnorrECAS
/*2156*/{0x2F, 523870, 19, {(uint8_t *)"ECAS:AIR1报文通讯超时(523870,19)",       (uint8_t *)"ECAS:(523870,19)"}, 0}, //KnorrECAS
/*2157*/{0x2F, 523871, 19, {(uint8_t *)"ECAS:CCVS报文通讯超时(523871,19)",       (uint8_t *)"ECAS:(523871,19)"}, 0}, //KnorrECAS
/*2158*/{0x2F,   1066, 11, {(uint8_t *)"ECAS:制动信号故障(1066,11)",             (uint8_t *)"ECAS:(1066,11)"},   0}, //KnorrECAS
/*2159*/{0x2F,    701,  4, {(uint8_t *)"ECAS:电磁阀线路故障(701,4)",             (uint8_t *)"ECAS:(701,4)"},     0}, //KnorrECAS
/*2160*/{0x2F,    701,  3, {(uint8_t *)"ECAS:电磁阀线路故障(701,3)",             (uint8_t *)"ECAS:(701,3)"},     0}, //KnorrECAS
/*2161*/{0x2F,    701,  5, {(uint8_t *)"ECAS:电磁阀线路故障(701,5)",             (uint8_t *)"ECAS:(701,5)"},     0}, //KnorrECAS
/*2162*/{0x2F,    701,  6, {(uint8_t *)"ECAS:电磁阀线路故障(701,6)",             (uint8_t *)"ECAS:(701,6)"},     0}, //KnorrECAS
/*2163*/{0x2F,    701,  1, {(uint8_t *)"ECAS:电磁阀线路故障(701,1)",             (uint8_t *)"ECAS:(701,1)"},     0}, //KnorrECAS
/*2164*/{0x2F,    702,  4, {(uint8_t *)"ECAS:电磁阀线路故障(702,4)",             (uint8_t *)"ECAS:(702,4)"},     0}, //KnorrECAS
/*2165*/{0x2F,    702,  3, {(uint8_t *)"ECAS:电磁阀线路故障(702,3)",             (uint8_t *)"ECAS:(702,3)"},     0}, //KnorrECAS
/*2166*/{0x2F,    702,  5, {(uint8_t *)"ECAS:电磁阀线路故障(702,5)",             (uint8_t *)"ECAS:(702,5)"},     0}, //KnorrECAS
/*2167*/{0x2F,    702,  6, {(uint8_t *)"ECAS:电磁阀线路故障(702,6)",             (uint8_t *)"ECAS:(702,6)"},     0}, //KnorrECAS
/*2168*/{0x2F,    702,  1, {(uint8_t *)"ECAS:电磁阀线路故障(702,1)",             (uint8_t *)"ECAS:(702,1)"},     0}, //KnorrECAS
/*2169*/{0x2F,    713,  4, {(uint8_t *)"ECAS:电磁阀线路故障(713,4)",             (uint8_t *)"ECAS:(713,4)"},     0}, //KnorrECAS
/*2170*/{0x2F,    713,  3, {(uint8_t *)"ECAS:电磁阀线路故障(713,3)",             (uint8_t *)"ECAS:(713,3)"},     0}, //KnorrECAS
/*2171*/{0x2F,    713,  5, {(uint8_t *)"ECAS:电磁阀线路故障(713,5)",             (uint8_t *)"ECAS:(713,5)"},     0}, //KnorrECAS
/*2172*/{0x2F,    713,  6, {(uint8_t *)"ECAS:电磁阀线路故障(713,6)",             (uint8_t *)"ECAS:(713,6)"},     0}, //KnorrECAS
/*2173*/{0x2F,    713,  1, {(uint8_t *)"ECAS:电磁阀线路故障(713,1)",             (uint8_t *)"ECAS:(713,1)"},     0}, //KnorrECAS
/*2174*/{0x2F,   3840, 11, {(uint8_t *)"ECAS:后轴左高度传感器故障(3840,11)",     (uint8_t *)"ECAS:(3840,11)"},   0}, //KnorrECAS
/*2175*/{0x2F,   3840, 13, {(uint8_t *)"ECAS:后轴左高度传感器故障(3840,13)",     (uint8_t *)"ECAS:(3840,13)"},   0}, //KnorrECAS
/*2176*/{0x2F,   3840, 12, {(uint8_t *)"ECAS:后轴左高度传感器故障(3840,12)",     (uint8_t *)"ECAS:(3840,12)"},   0}, //KnorrECAS
/*2177*/{0x2F,   3841, 11, {(uint8_t *)"ECAS:后轴左轴荷气压传感器故障(3841,11)", (uint8_t *)"ECAS:(3841,11)"},   0}, //KnorrECAS
/*2178*/{0x2F,   3841, 13, {(uint8_t *)"ECAS:后轴左轴荷气压传感器故障(3841,13)", (uint8_t *)"ECAS:(3841,13)"},   0}, //KnorrECAS
/*2179*/{0x2F,   3841, 12, {(uint8_t *)"ECAS:后轴左轴荷气压传感器故障(3841,12)", (uint8_t *)"ECAS:(3841,12)"},   0}, //KnorrECAS
/*2180*/{0x2F, 523880,  2, {(uint8_t *)"ECAS:传感器配置故障(523880,2)",          (uint8_t *)"ECAS:(523880,2)"},  0}, //KnorrECAS
/*2181*/{0x2F,   3039, 31, {(uint8_t *)"ECAS:系统自检故障(3039,31)",             (uint8_t *)"ECAS:(3039,31)"},   0}, //KnorrECAS
/*2182*/{0x2F,   1742, 31, {(uint8_t *)"ECAS:系统自检故障(1742,31)",             (uint8_t *)"ECAS:(1742,31)"},   0}, //KnorrECAS
/*2183*/{0x2F,   1753, 31, {(uint8_t *)"ECAS:系统自检故障(1753,31)",             (uint8_t *)"ECAS:(1753,31)"},   0}, //KnorrECAS
/*2184*/{0x2F,   1741, 15, {(uint8_t *)"ECAS:系统自检故障(1741,15)",             (uint8_t *)"ECAS:(1741,15)"},   0}, //KnorrECAS
/*2185*/{0x2F, 521121, 15, {(uint8_t *)"ECAS:中桥轴荷超出最大允许值(521121,15)", (uint8_t *)"ECAS:(521121,15)"}, 0}, //KnorrECAS
/*2186*/{0x2F, 521122, 15, {(uint8_t *)"ECAS:中桥轴荷超出最大允许值(521122,15)", (uint8_t *)"ECAS:(521122,15)"}, 0}, //KnorrECAS
/*2187*/{0xEF, 521713,  4, {(uint8_t *)"MCU:电机温度传感器对地短路(521713,4)",     (uint8_t *)"MCU:(521713,4)"},   0}, //MCU
/*2188*/{0xEF, 521714,  2, {(uint8_t *)"MCU:控制器温度传感器断线(521714,2)",       (uint8_t *)"MCU:(521714,2)"},   0}, //MCU
/*2189*/{0xEF, 521714,  4, {(uint8_t *)"MCU:控制器温度传感器对地短路(521714,4)",   (uint8_t *)"MCU:(521714,4)"},   0}, //MCU
/*2190*/{0xEF, 521730, 22, {(uint8_t *)"MCU:功能模块校核故障(521730,22)",          (uint8_t *)"MCU:(521730,22)"},  0}, //MCU
/*2191*/{0xEF, 521731,  2, {(uint8_t *)"MCU:目标转矩异常增大故障(521731,2)",       (uint8_t *)"MCU:(521731,2)"},   0}, //MCU
/*2192*/{0xEF, 521732,  0, {(uint8_t *)"MCU:电机零位偏差停机故障(521732,0)",       (uint8_t *)"MCU:(521732,0)"},   0}, //MCU
/*2193*/{0xEF, 521732, 16, {(uint8_t *)"MCU:电机零位偏差限功率故障(521732,16)",    (uint8_t *)"MCU:(521732,16)"},  0}, //MCU
/*2194*/{0xEF, 521732,  2, {(uint8_t *)"MCU:电机零位不一致故障(521732,2)",         (uint8_t *)"MCU:(521732,2)"},   0}, //MCU
/*2195*/{0xEF, 521733,  0, {(uint8_t *)"MCU:估算转矩偏差停机故障(521733,0)",       (uint8_t *)"MCU:(521733,0)"},   0}, //MCU
/*2196*/{0xEF,0xFFFFF, 0xFF /* 521733, 16 */, {(uint8_t *)"MCU:估算转矩偏差报警故障(521733,16)",      (uint8_t *)"MCU:(521733,16)"},  0}, //MCU
/*2197*/{0xEF,0xFFFFF, 0xFF /* 521734,  2 */, {(uint8_t *)"MCU:操作顺序保护报警(521734,2)",           (uint8_t *)"MCU:(521734,2)"},   0}, //MCU
/*2198*/{0xEF,0xFFFFF, 0xFF /* 521735,  2 */, {(uint8_t *)"MCU:高速误挂挡保护报警(521735,2)",         (uint8_t *)"MCU:(521735,2)"},   0}, //MCU
/*2199*/{0xF0, 521713,  4, {(uint8_t *)"MCU2:电机温度传感器对地短路 (521713,4)",   (uint8_t *)"MCU2:(521713,4)"},  0}, //MCU2
/*2200*/{0xF0, 521714,  2, {(uint8_t *)"MCU2:控制器温度传感器断线 (521714,2)",     (uint8_t *)"MCU2:(521714,2)"},  0}, //MCU2
/*2201*/{0xF0, 521714,  4, {(uint8_t *)"MCU2:控制器温度传感器对地短路 (521714,4)", (uint8_t *)"MCU2:(521714,4)"},  0}, //MCU2
/*2202*/{0xF0, 521730, 22, {(uint8_t *)"MCU2:功能模块校核故障(521730,22)",         (uint8_t *)"MCU2:(521730,22)"}, 0}, //MCU2
/*2203*/{0xF0, 521731,  2, {(uint8_t *)"MCU2:目标转矩异常增大故障(521731,2)",      (uint8_t *)"MCU2:(521731,2)"},  0}, //MCU2
/*2204*/{0xF0, 521732,  0, {(uint8_t *)"MCU2:电机零位偏差停机故障(521732,0)",      (uint8_t *)"MCU2:(521732,0)"},  0}, //MCU2
/*2205*/{0xF0, 521732, 16, {(uint8_t *)"MCU2:电机零位偏差限功率故障(521732,16)",   (uint8_t *)"MCU2:(521732,16)"}, 0}, //MCU2
/*2206*/{0xF0, 521732,  2, {(uint8_t *)"MCU2:电机零位不一致故障(521732,2)",        (uint8_t *)"MCU2:(521732,2)"},  0}, //MCU2
/*2207*/{0xF0, 521733,  0, {(uint8_t *)"MCU2:估算转矩偏差停机故障(521733,0)",      (uint8_t *)"MCU2:(521733,0)"},  0}, //MCU2
/*2208*/{0xF0,0xFFFFF, 0xFF /* 521733, 16 */, {(uint8_t *)"MCU2:估算转矩偏差报警故障(521733,16)",     (uint8_t *)"MCU2:(521733,16)"}, 0}, //MCU2
/*2209*/{0xF0,0xFFFFF, 0xFF /* 521734,  2 */, {(uint8_t *)"MCU2:操作顺序保护报警(521734,2)",          (uint8_t *)"MCU2:(521734,2)"},  0}, //MCU2
/*2210*/{0xF0,0xFFFFF, 0xFF /* 521735,  2 */, {(uint8_t *)"MCU2:高速误挂挡保护报警(521735,2)",        (uint8_t *)"MCU2:(521735,2)"},  0}, //MCU2
/*2211*/{0x1E, 521554, 31, {(uint8_t *)"PDU:主驱接触器预充失败(521554,31)",     (uint8_t *)"PDU:(521554,31)"}, 0}, //PDU
/*2212*/{0x1E, 521554, 30, {(uint8_t *)"PDU:辅驱接触器预充失败(521554,30)",     (uint8_t *)"PDU:(521554,30)"}, 0}, //PDU
/*2213*/{0x1E, 521554, 29, {(uint8_t *)"PDU:上装接触器预充失败(521554,29)",     (uint8_t *)"PDU:(521554,29)"}, 0}, //PDU
/*2214*/{0x1E, 521555,  1, {(uint8_t *)"PDU:辅助电源欠压(521555,1)",            (uint8_t *)"PDU:(521555,1)"},  0}, //PDU
/*2215*/{0x1E, 521555, 16, {(uint8_t *)"PDU:辅助电源过压(521555,16)",           (uint8_t *)"PDU:(521555,16)"}, 0}, //PDU
/*2216*/{0x1E, 521565, 12, {(uint8_t *)"PDU:EEPROM故障(521565,12)",             (uint8_t *)"PDU:(521565,12)"}, 0}, //PDU
/*2217*/{0x1E, 521566,  0, {(uint8_t *)"PDU:初始化故障(521566,0)",              (uint8_t *)"PDU:(521566,0)"},  0}, //PDU
/*2218*/{0x1E, 521567,  0, {(uint8_t *)"PDU:主驱回路带转速上电故障(521567,0)",  (uint8_t *)"PDU:(521567,0)"},  0}, //PDU
/*2219*/{0x1E, 521568, 20, {(uint8_t *)"PDU:主驱回路上电反向压差大(521568,20)", (uint8_t *)"PDU:(521568,20)"}, 0}, //PDU
/*2220*/{0x1E, 521568, 21, {(uint8_t *)"PDU:辅驱回路上电反向压差大(521568,21)", (uint8_t *)"PDU:(521568,21)"}, 0}, //PDU
/*2221*/{0x1E, 521559,  3, {(uint8_t *)"PDU:辅驱接触器无法断开 (521559,3)",     (uint8_t *)"PDU:(521559,3)"},  0}, //PDU
/*2222*/{0x1E, 521559,  5, {(uint8_t *)"PDU:辅驱接触器无法闭合(521559,5)",      (uint8_t *)"PDU:(521559,5)"},  0}, //PDU
/*2223*/{0x1E, 521560,  0, {(uint8_t *)"PDU:输入欠压(521560,0)",                (uint8_t *)"PDU:(521560,0)"},  0}, //PDU
/*2224*/{0x1E, 521561,  0, {(uint8_t *)"PDU:输入过压(521561,0)",                (uint8_t *)"PDU:(521561,0)"},  0}, //PDU
/*2225*/{0x1E, 521562, 23, {(uint8_t *)"PDU:通讯故障 (521562,23)",              (uint8_t *)"PDU:(521562,23)"}, 0}, //PDU
/*2226*/{0x1E, 521563,  3, {(uint8_t *)"PDU:其他接触器粘连 (521563,3)",         (uint8_t *)"PDU:(521563,3)"},  0}, //PDU
/*2227*/{0x1E,0xFFFFF,0xFF /* 521564,  2 */, {(uint8_t *)"PDU:上装用电硬线请求丢失(521564,2)",    (uint8_t *)"PDU:(521564,2)"},  0}, //PDU
/*2228*/{0x2E,0xFFFFF,0xFF /* 521904, 16 */, {(uint8_t *)"HSCU:过温报警(521904,16)",                (uint8_t *)"HSCU:(521904,16)"}, 0}, //HSCU
/*2229*/{0x2E, 521908, 12, {(uint8_t *)"HSCU:电流检测(零漂)故障(521908,12)",      (uint8_t *)"HSCU:(521908,12)"}, 0}, //HSCU
/*2230*/{0x2E, 521909,  0, {(uint8_t *)"HSCU:控制器过温故障(521909,0)",           (uint8_t *)"HSCU:(521909,0)"},  0}, //HSCU
/*2231*/{0x2E, 521909, 10, {(uint8_t *)"HSCU:转速偏差过大(521909,10)",            (uint8_t *)"HSCU:(521909,10)"}, 0}, //HSCU
/*2232*/{0x2E, 521909, 16, {(uint8_t *)"HSCU:控制器过温报警(521909,16)",          (uint8_t *)"HSCU:(521909,16)"}, 0}, //HSCU
/*2233*/{0x2E,0xFFFFF,0xFF /* 521910, 12 */, {(uint8_t *)"HSCU:PT100 短路(521910,12)",              (uint8_t *)"HSCU:(521910,12)"}, 0}, //HSCU
/*2234*/{0x2E,0xFFFFF,0xFF /* 521910,  5 */, {(uint8_t *)"HSCU:PT100 开路(521910,5)",               (uint8_t *)"HSCU:(521910,5)"},  0}, //HSCU
/*2235*/{0x2E, 521911,  0, {(uint8_t *)"HSCU:超速故障(521911,0)",                 (uint8_t *)"HSCU:(521911,0)"},  0}, //HSCU
/*2236*/{0x2E, 521912,  7, {(uint8_t *)"HSCU:相间短路故障(521912,7)",             (uint8_t *)"HSCU:(521912,7)"},  0}, //HSCU
/*2237*/{0x2E, 521913,  7, {(uint8_t *)"HSCU:失调故障(521913,7)",                 (uint8_t *)"HSCU:(521913,7)"},  0}, //HSCU
/*2238*/{0x2E, 521914, 12, {(uint8_t *)"HSCU:硬件故障(521914,12)",                (uint8_t *)"HSCU:(521914,12)"}, 0}, //HSCU
/*2239*/{0x2E, 521915,  5, {(uint8_t *)"HSCU:控制器温度传感器断路故障(521915,5)", (uint8_t *)"HSCU:(521915,5)"},  0}, //HSCU
/*2240*/{0x2E, 521915,  6, {(uint8_t *)"HSCU:控制器温度传感器短路故障(521915,6)", (uint8_t *)"HSCU:(521915,6)"},  0}, //HSCU
/*2241*/{0x2E, 521916,  1, {(uint8_t *)"HSCU:辅助电源欠压(521916,1)",             (uint8_t *)"HSCU:(521916,1)"},  0}, //HSCU
/*2242*/{0x2E,0xFFFFF,0xFF /* 521916, 16 */, {(uint8_t *)"HSCU:辅助电源过压(521916,16)",            (uint8_t *)"HSCU:(521916,16)"}, 0}, //HSCU
/*2243*/{0x30, 521809,  5, {(uint8_t *)"空压机:温度传感器断路故障(521809,5)", (uint8_t *)"Air Compressor:(521809,5)"},  0}, //空压机
/*2244*/{0x30, 521809,  6, {(uint8_t *)"空压机:温度传感器短路故障(521809,6)", (uint8_t *)"Air Compressor:(521809,6)"},  0}, //空压机
/*2245*/{0x30, 521810,  1, {(uint8_t *)"空压机:辅助电源欠压(521810,1)",       (uint8_t *)"Air Compressor:(521810,1)"},  0}, //空压机
/*2246*/{0x30,0xFFFFF, 0xFF /* 521810, 16 */, {(uint8_t *)"空压机:辅助电源过压(521810,16)",      (uint8_t *)"Air Compressor:(521810,16)"}, 0}, //空压机
/*2247*/{0x30, 521840, 12, {(uint8_t *)"空压机:硬件故障(521840,12)",          (uint8_t *)"Air Compressor:(521840,12)"}, 0}, //空压机
/*2248*/{0x30, 521841,  0, {(uint8_t *)"空压机:超速故障(521841,0)",           (uint8_t *)"Air Compressor:(521841,0)"},  0}, //空压机
/*2249*/{0x30, 521842, 12, {(uint8_t *)"空压机:EEPROM故障(521842,12)",        (uint8_t *)"Air Compressor:(521842,12)"}, 0}, //空压机
/*2250*/{0x30, 521843,  7, {(uint8_t *)"空压机:相间短路故障(521843,7)",       (uint8_t *)"Air Compressor:(521843,7)"},  0}, //空压机
/*2251*/{0x30, 521849,  3, {(uint8_t *)"空压机:压力开关短路故障(521849,3)",               (uint8_t *)"Air Compressor:(521849,3)"}, 0}, //空压机
/*2252*/{0x30, 521849,  4, {(uint8_t *)"空压机:压力开关断路或制动系统漏气故障(521849,4)", (uint8_t *)"Air Compressor:(521849,4)"}, 0}, //空压机
/*2253*/{0x1A, 521506,  1, {(uint8_t *)"DCDC:输出欠压(521506,1)",      (uint8_t *)"DCDC:(521506,1)"},  0}, //DCDC
/*2254*/{0x1A, 521507, 12, {(uint8_t *)"DCDC:通讯故障(521507,12)",     (uint8_t *)"DCDC:(521507,12)"}, 0}, //DCDC
/*2255*/{0x1A, 521508, 11, {(uint8_t *)"DCDC:模块故障(521508,11)",     (uint8_t *)"DCDC:(521508,11)"}, 0}, //DCDC
/*2256*/{0x1A, 521508,  7, {(uint8_t *)"DCDC:模块故障(521508,7)",      (uint8_t *)"DCDC:(521508,7)"},  0}, //DCDC
/*2257*/{0x1A, 521509,  1, {(uint8_t *)"DCDC:辅源欠压(521509,1)",      (uint8_t *)"DCDC:(521509,1)"},  0}, //DCDC
/*2258*/{0x1A, 521509,  0, {(uint8_t *)"DCDC:辅源过压(521509,0)",      (uint8_t *)"DCDC:(521509,0)"},  0}, //DCDC
/*2259*/{0x1A, 521510,  0, {(uint8_t *)"DCDC:输入过流(521510,0)",      (uint8_t *)"DCDC:(521510,0)"},  0}, //DCDC
/*2260*/{0x1A, 521511,  0, {(uint8_t *)"DCDC:硬件保护故障(521511,0)",  (uint8_t *)"DCDC:(521511,0)"},  0}, //DCDC
/*2261*/{0x1A, 521512,  0, {(uint8_t *)"DCDC:输出反向过流(521512,0)",  (uint8_t *)"DCDC:(521512,0)"},  0}, //DCDC
/*2262*/{0x1A, 521513, 12, {(uint8_t *)"DCDC:EEPROM故障(521513,12)",   (uint8_t *)"DCDC:(521513,12)"}, 0}, //DCDC
/*2263*/{0x1A, 521514, 16, {(uint8_t *)"DCDC:输出过载(521514,16)",     (uint8_t *)"DCDC:(521514,16)"}, 0}, //DCDC
/*2264*/{0x1A, 521515,  7, {(uint8_t *)"DCDC:软启动失败(521515,7)",    (uint8_t *)"DCDC:(521515,7)"},  0}, //DCDC
/*2265*/{0xF4,0xFFFFF, 0xFF /* 522243, 15 */, {(uint8_t *)"换电系统:换电连接器瞬断轻微故障(522243,15)", (uint8_t *)"PECU:(522243,15)"}, 0}, //BMS
/*2266*/{0xF4,0xFFFFF, 0xFF /* 522243, 16 */, {(uint8_t *)"换电系统:换电连接器瞬断一般故障(522243,16)", (uint8_t *)"PECU:(522243,16)"}, 0}, //BMS
/*2267*/{0xF4,0xFFFFF, 0xFF /* 522243,  0 */, {(uint8_t *)"换电系统:换电连接器瞬断严重故障(522243,0)",  (uint8_t *)"PECU:(522243,0)"},  0}, //BMS
/*2268*/{0xF4,0xFFFFF, 0xFF /* 522241, 15 */, {(uint8_t *)"换电系统:换电连接器过温轻微故障(522241,15)", (uint8_t *)"PECU:(522241,15)"}, 0}, //BMS
/*2269*/{0xF4,0xFFFFF, 0xFF /* 522241, 16 */, {(uint8_t *)"换电系统:换电连接器过温一般故障(522241,16)", (uint8_t *)"PECU:(522241,16)"}, 0}, //BMS
/*2270*/{0xF4,0xFFFFF, 0xFF /* 522241,  0 */, {(uint8_t *)"换电系统:换电连接器过温严重故障(522241,0)",  (uint8_t *)"PECU:(522241,0)"},  0}, //BMS
/*2271*/{0xF4,0xFFFFF, 0xFF /* 522242,  7 */, {(uint8_t *)"换电系统:换电连接器锁止故障(522242,7)",      (uint8_t *)"PECU:(522242,7)"},  0}, //BMS
/*2272*/{0xF4, 522244,  5, {(uint8_t *)"换电系统:换电连接器温感断线故障(522244,5)", (uint8_t *)"PECU:(522244,5)"},  0}, //BMS
/*2273*/{0xF4,0xFFFFF, 0xFF /* 522239, 12 */, {(uint8_t *)"换电系统:换电控制器自检故障(522239,12)",     (uint8_t *)"PECU:(522239,12)"}, 0}, //BMS
/*2274*/{0xF4,0xFFFFF, 0xFF /* 522238, 13 */, {(uint8_t *)"换电系统:24V供电异常(522238,13)",            (uint8_t *)"PECU:(522238,13)"}, 0}, //BMS
/*2275*/{0xF4,0xFFFFF, 0xFF /* 522237, 23 */, {(uint8_t *)"换电系统:换电系统电池箱不匹配(522237,23)",   (uint8_t *)"PECU:(522237,23)"}, 0}, //BMS
/*2276*/{0x03,   7649,  1, {(uint8_t *)"AMT:TCU与VECU通讯故障(7649,1)",                       (uint8_t *)"AMT:(7649,1)"},     0}, //AMT
/*2277*/{0x03,   7649,  2, {(uint8_t *)"AMT:TCU与MCU通讯故障(7649,2)",                        (uint8_t *)"AMT:(7649,2)"},     0}, //AMT
/*2278*/{0x03,   1824,  1, {(uint8_t *)"AMT:车速传感器信号错误(1824,1)",                      (uint8_t *)"AMT:(1824,1)"},     0}, //AMT
/*2279*/{0x03,   1810,  2, {(uint8_t *)"AMT:坡道传感器通讯故障(1810,2)",                      (uint8_t *)"AMT:(1810,2)"},     0}, //AMT
/*2280*/{0x03,   1810, 11, {(uint8_t *)"AMT:坡道传感器未标定,信号异常(1810,11)",              (uint8_t *)"AMT:(1810,11)"},    0}, //AMT
/*2281*/{0x03, 518310, 12, {(uint8_t *)"AMT:坡道传感器故障或其线路故障(518310,12)",           (uint8_t *)"AMT:(518310,12)"},  0}, //AMT
/*2282*/{0x03,   5997, 12, {(uint8_t *)"AMT:加速度芯片故障(5997,12)",                         (uint8_t *)"AMT:(5997,12)"},    0}, //AMT
/*2283*/{0x03,   5997, 13, {(uint8_t *)"AMT:坡度信号零位标定错误(5997,13)",                   (uint8_t *)"AMT:(5997,13)"},    0}, //AMT
/*2284*/{0x03,   7673,  7, {(uint8_t *)"AMT:取力器堵转报警(7673,7)",                          (uint8_t *)"AMT:(7673,7)"},     0}, //AMT
/*2285*/{0x03,   7673, 15, {(uint8_t *)"AMT:停车取力有车速报警(7673,15)",                     (uint8_t *)"AMT:(7673,15)"},    0}, //AMT
/*2286*/{0x03,   7673, 16, {(uint8_t *)"AMT:取力器反转或转速超速(7673,16)",                   (uint8_t *)"AMT:(7673,16)"},    0}, //AMT
/*2287*/{0x03, 520213,  5, {(uint8_t *)"AMT:AMT换挡清扭超时(520213,5)",                       (uint8_t *)"AMT:(520213,5)"},   0}, //AMT
/*2288*/{0x03, 520213,  6, {(uint8_t *)"AMT:AMT摘挡失败(520213,6)",                           (uint8_t *)"AMT:(520213,6)"},   0}, //AMT
/*2289*/{0x03, 520213,  8, {(uint8_t *)"AMT:AMT换挡调速超时(520213,8)",                       (uint8_t *)"AMT:(520213,8)"},   0}, //AMT
/*2290*/{0x03, 520213,  9, {(uint8_t *)"AMT:AMT挂档失败(520213,9)",                           (uint8_t *)"AMT:(520213,9)"},   0}, //AMT
/*2291*/{0x03, 520213, 10, {(uint8_t *)"AMT:AMT换挡还扭超时(520213,10)",                      (uint8_t *)"AMT:(520213,10)"},  0}, //AMT
/*2292*/{0x03, 520213, 16, {(uint8_t *)"AMT:电机响应超时(520213,16)",                         (uint8_t *)"AMT:(520213,16)"},  0}, //AMT
/*2293*/{0x03, 520214,  7, {(uint8_t *)"AMT:摘空挡失败故障(520214,7)",                        (uint8_t *)"AMT:(520214,7)"},   0}, //AMT
/*2294*/{0x03,    177,  0, {(uint8_t *)"AMT:变速箱油温过高停机(177,0)",                       (uint8_t *)"AMT:(177,0)"},      0}, //AMT
/*2295*/{0x03,    177, 16, {(uint8_t *)"AMT:变速箱油温偏高报警(177,16)",                      (uint8_t *)"AMT:(177,16)"},     0}, //AMT
/*2296*/{0x03,   6031,  4, {(uint8_t *)"AMT:油温传感器断路(6031,4)",                          (uint8_t *)"AMT:(6031,4)"},     0}, //AMT
/*2297*/{0x03,   6031,  3, {(uint8_t *)"AMT:油温传感器短路(6031,3)",                          (uint8_t *)"AMT:(6031,3)"},     0}, //AMT
/*2298*/{0x03, 518389,  7, {(uint8_t *)"AMT:变速箱档位速比异常-1档脱档或其它故障(518389,7)",  (uint8_t *)"AMT:(518389,7)"},   0}, //AMT
/*2299*/{0x03, 518390,  7, {(uint8_t *)"AMT:变速箱档位速比异常-2档脱档或其它故障(518390,7)",  (uint8_t *)"AMT:(518390,7)"},   0}, //AMT
/*2300*/{0x03, 518391,  7, {(uint8_t *)"AMT:变速箱档位速比异常-3档脱档或其它故障(518391,7)",  (uint8_t *)"AMT:(518391,7)"},   0}, //AMT
/*2301*/{0x03, 518392,  7, {(uint8_t *)"AMT:变速箱档位速比异常-4档脱档或其它故障(518392,7)",  (uint8_t *)"AMT:(518392,7)"},   0}, //AMT
/*2302*/{0x03, 518393,  7, {(uint8_t *)"AMT:变速箱档位速比异常-5档脱档或其它故障(518393,7)",  (uint8_t *)"AMT:(518393,7)"},   0}, //AMT
/*2303*/{0x03, 518394,  7, {(uint8_t *)"AMT:变速箱档位速比异常-6档脱档或其它故障(518394,7)",  (uint8_t *)"AMT:(518394,7)"},   0}, //AMT
/*2304*/{0x03, 518395,  7, {(uint8_t *)"AMT:变速箱档位速比异常-倒档脱档或其它故障(518395,7)", (uint8_t *)"AMT:(518395,7)"},   0}, //AMT
/*2305*/{0x03, 518332, 13, {(uint8_t *)"AMT:AMT E方档位位移值无效,请重新自学习(518332,13)",   (uint8_t *)"AMT:(518332,13)"},  0}, //AMT
/*2306*/{0x03, 518332, 14, {(uint8_t *)"AMT:正在自学习,请勿操作车辆(518332,14)",              (uint8_t *)"AMT:(518332,14)"},  0}, //AMT
/*2307*/{0x03, 518333, 13, {(uint8_t *)"AMT:换挡自学习失败,请重新进行自学习(518333,13)",      (uint8_t *)"AMT:(518333,13)"},  0}, //AMT
/*2308*/{0x03, 518333, 14, {(uint8_t *)"AMT:换挡自学习完成(518333,14)",                       (uint8_t *)"AMT:(518333,14)"},  0}, //AMT
/*2309*/{0x03,   1824,  1, {(uint8_t *)"AMT:车速传感器故障(1824,1)",             (uint8_t *)"AMT:(1824,1)"},    0}, //AMT
/*2310*/{0x03,   1810, 12, {(uint8_t *)"AMT:坡道传感器故障(1810,12)",            (uint8_t *)"AMT:(1810,12)"},   0}, //AMT
/*2311*/{0x03,   1810, 13, {(uint8_t *)"AMT:坡道传感器故障(1810,13)",            (uint8_t *)"AMT:(1810,13)"},   0}, //AMT
/*2312*/{0x03,   1810, 14, {(uint8_t *)"AMT:坡道传感器故障(1810,14)",            (uint8_t *)"AMT:(1810,14)"},   0}, //AMT
/*2313*/{0x03,   1810,  4, {(uint8_t *)"AMT:坡道传感器故障(1810,4)",             (uint8_t *)"AMT:(1810,4)"},    0}, //AMT
/*2314*/{0x03, 518332, 11, {(uint8_t *)"AMT:自学习数据错误(518332,11)",          (uint8_t *)"AMT:(518332,11)"}, 0}, //AMT
/*2315*/{0x03,   7670,  6, {(uint8_t *)"AMT:取力器故障(7670,6)",                 (uint8_t *)"AMT:(7670,6)"},    0}, //AMT
/*2316*/{0x03,   7670,  7, {(uint8_t *)"AMT:取力器故障(7670,7)",                 (uint8_t *)"AMT:(7670,7)"},    0}, //AMT
/*2317*/{0x03,   7670,  8, {(uint8_t *)"AMT:取力器故障(7670,8)",                 (uint8_t *)"AMT:(7670,8)"},    0}, //AMT
/*2318*/{0x03, 522110,  5, {(uint8_t *)"AMT:换挡电机回路开路(522110,5)",         (uint8_t *)"AMT:(522110,5)"},  0}, //AMT
/*2319*/{0x03, 522111,  8, {(uint8_t *)"AMT:换挡电机故障(522111,8)",             (uint8_t *)"AMT:(522111,8)"},  0}, //AMT
/*2320*/{0x03, 522111,  6, {(uint8_t *)"AMT:换挡电机电流偏大(522111,6)",         (uint8_t *)"AMT:(522111,6)"},  0}, //AMT
/*2321*/{0x03, 522111,  7, {(uint8_t *)"AMT:换挡电机电流偏大(522111,7)",         (uint8_t *)"AMT:(522111,7)"},  0}, //AMT
/*2322*/{0x03, 522117, 12, {(uint8_t *)"AMT:VCU CAN信号完全丢失故障(522117,12)", (uint8_t *)"AMT:(522117,12)"}, 0}, //AMT
/*2323*/{0x03, 522119, 12, {(uint8_t *)"AMT:MCU CAN信号完全丢失故障(522119,12)", (uint8_t *)"AMT:(522119,12)"}, 0}, //AMT
/*2324*/{0x03, 522119, 12, {(uint8_t *)"AMT:MCU CAN信号完全丢失故障(522119,12)", (uint8_t *)"AMT:(522119,12)"}, 0}, //AMT
/*2325*/{0x03,    177,  2, {(uint8_t *)"AMT:温度传感器故障(177,2)",              (uint8_t *)"AMT:(177,2)"}, 0}, //AMT
/*2326*/{0x03,    177,  3, {(uint8_t *)"AMT:温度传感器故障(177,3)",              (uint8_t *)"AMT:(177,3)"}, 0}, //AMT
/*2327*/{0x03,    177, 16, {(uint8_t *)"AMT:变速箱油温偏高报警(177,16)",         (uint8_t *)"AMT:(177,16)"}, 0}, //AMT
/*2328*/{0x03,    177,  0, {(uint8_t *)"AMT:变速箱油温过高停机(177,0)",          (uint8_t *)"AMT:(177,0)"}, 0}, //AMT
/*2329*/{0x03,   7665,  3, {(uint8_t *)"TCU程序故障(7665,3)",                    (uint8_t *)"AMT:(7665,3)"}, 0}, //AMT
/*2330*/{0x03,   7669,  1, {(uint8_t *)"TCU程序故障(7669,1)",                    (uint8_t *)"AMT:(7669,1)"}, 0}, //AMT
/*2331*/{0x03,   7665,  6, {(uint8_t *)"TCU程序故障(7665,6)",                    (uint8_t *)"AMT:(7665,6)"}, 0}, //AMT
/*2332*/{0x03,   7665,  6, {(uint8_t *)"TCU程序故障(7665,6)",                    (uint8_t *)"AMT:(7665,6)"}, 0}, //AMT
/*2333*/{0xA7,    639, 23, {(uint8_t *)"ATS:CAN通讯异常(639,23)",          (uint8_t *)"ATS:(639,23)"},   0},//ATS
/*2334*/{0xA8,   9691, 12, {(uint8_t *)"ATS:电机冷却风扇故障(9691,12)",    (uint8_t *)"ATS:(9691,12)"},  0},//ATS
/*2335*/{0xA8,  12836, 12, {(uint8_t *)"ATS:进水温度传感器故障(12836,12)", (uint8_t *)"ATS:(12836,12)"}, 0},//ATS
/*2336*/{0xA8,  12837, 12, {(uint8_t *)"ATS:出水温度传感器故障(12837,12)", (uint8_t *)"ATS:(12837,12)"}, 0},//ATS
/*2337*/{0xA8,  12836,  5, {(uint8_t *)"ATS:进水温度传感器掉线(12836,5)",  (uint8_t *)"ATS:(12836,5)"},  0},//ATS
/*2338*/{0xA8,  12837,  5, {(uint8_t *)"ATS:出水温度传感器掉线(12837,5)",  (uint8_t *)"ATS:(12837,5)"},  0},//ATS
/*2339*/{0xA8,    639, 23, {(uint8_t *)"ATS:CAN通讯异常(639,23)",          (uint8_t *)"ATS:(639,23)"},   0},//ATS
/*2340*/{0x8F,   9691, 12, {(uint8_t *)"FTS:电子冷却风扇故障(9691,12)",       (uint8_t *)"FTS:(9691,12)"},  0},//FTS
/*2341*/{0x8F,  12836, 12, {(uint8_t *)"FTS:进水温度传感器故障(12836,12)",    (uint8_t *)"FTS:(12836,12)"}, 0},//FTS
/*2342*/{0x8F,  12837, 12, {(uint8_t *)"FTS:出水温度传感器故障(12837,12)",    (uint8_t *)"FTS:(12837,12)"}, 0},//FTS
/*2343*/{0x8F,  12836,  5, {(uint8_t *)"FTS:进水温度传感器掉线(12836,5)",     (uint8_t *)"FTS:(12836,5)"},  0},//FTS
/*2344*/{0x8F,  12837,  5, {(uint8_t *)"FTS:出水温度传感器掉线(12837,5)",     (uint8_t *)"FTS:(12837,5)"},  0},//FTS
/*2345*/{0x8F,    639, 23, {(uint8_t *)"FTS:CAN通讯异常(639,23)",             (uint8_t *)"FTS:(639,23)"},   0},//FTS
/*2346*/{0x8F,   2430, 12, {(uint8_t *)"燃料电池冷却液液位低，请添加冷却液",  (uint8_t *)"Fuel cell coolant level is low, please add coolant"}/* {(uint8_t *)"FTS:液位低或液位传感器故障(2430,12)", (uint8_t *)"FTS:(2430,12)"} */,  0},//FTS
/*2347*/{0x17, 523031, 12, {(uint8_t *)"仪表:第五桥左轮摩擦片磨损(523031,12)",   (uint8_t *)"IC:(523031,12)"}, 0},//仪表
/*2348*/{0x17, 523032, 12, {(uint8_t *)"仪表:第五桥右轮摩擦片磨损(523032,12)",   (uint8_t *)"IC:(523032,12)"}, 0},//仪表
/*2349*/{0x31, 522111, 18, {(uint8_t *)"请加电机冷却液", (uint8_t *)"Please add motor coolant"}, /* {(uint8_t *)"HCU:电机冷却液液位低(522111,19)",   (uint8_t *)"HCU:(522111,19)"}, */ 0}, //HCU
/*2350*/{0x31, 522112, 18, {(uint8_t *)"请加电池冷却液", (uint8_t *)"Please add battery coolant"}, /* {(uint8_t *)"HCU:电池冷却液液位低(522112,18)", (uint8_t *)"HCU:(522112,18)"}, */ 0}, //HCU
/*2351*/{0x31, 522115, 12, {(uint8_t *)"HCU:空调压缩机故障(522115,12)",            (uint8_t *)"HCU:(522115,12)"}, 0}, //HCU
/*2352*/{0x31, 522116, 12, {(uint8_t *)"HCU:四通阀故障(522116,12)",                (uint8_t *)"HCU:(522116,12)"}, 0}, //HCU
/*2353*/{0x31, 522117, 12, {(uint8_t *)"HCU:三通阀故障(522117,12)",                (uint8_t *)"HCU:(522117,12)"}, 0}, //HCU
/*2354*/{0x31, 522119,  5, {(uint8_t *)"HCU:电机冷却回水温度传感器故障(522119,5)", (uint8_t *)"HCU:(522119,5)"},  0}, //HCU
/*2355*/{0x31, 522119,  4, {(uint8_t *)"HCU:电机冷却回水温度传感器故障(522119,4)", (uint8_t *)"HCU:(522119,4)"},  0}, //HCU
/*2356*/{0x31,   1746,  9, {(uint8_t *)"HCU:HCU与Tbox间通讯异常(1746,9)",          (uint8_t *)"HCU:(1746,9)"},    0}, //HCU
/*2357*/{0x31,   1746,  2, {(uint8_t *)"HCU:车辆监管、即将激活限速限扭(1746,2)",   (uint8_t *)"HCU:(1746,2)"},    0}, //HCU
/*2358*/{0x31,  21068,  2, {(uint8_t *)"HCU:干燥器压力开关信号不合理(21068,2)",    (uint8_t *)"HCU:(21068,2)"},   0}, //HCU
/*2359*/{0x31,  21069,  2, {(uint8_t *)"HCU:整车气路或空压机漏气(21069,2)",        (uint8_t *)"HCU:(21069,2)"},   0}, //HCU
/*2360*/{0x31,0xFFFFF,0xFF /* 522113, 16 */, {(uint8_t *)"HCU:冷媒压力高(522113,16)",                (uint8_t *)"HCU:(522113,16)"}, 0}, //HCU
/*2361*/{0x31,0xFFFFF,0xFF /* 522114, 18 */, {(uint8_t *)"HCU:冷媒压力低(522114,18)",                (uint8_t *)"HCU:(522114,18)"}, 0}, //HCU
/*2362*/{0x31,0xFFFFF,0xFF /* 522113, 16 */, {(uint8_t *)"HCU:空调压缩机排气温度高(522118,16)",      (uint8_t *)"HCU:(522118,16)"}, 0}, //HCU
/*2363*/{0xF4, 521313,  7, {(uint8_t *)"BMS:燃料电池回路故障(521313,7)",   (uint8_t *)"BMS:(521313,7)"},  0}, //BMS
/*2364*/{0xF4, 521316, 12, {(uint8_t *)"BMS:燃料电池回路故障(521316,12)",  (uint8_t *)"BMS:(521316,12)"}, 0}, //BMS
/*2365*/{0xF4, 521314,  3, {(uint8_t *)"BMS:燃料电池回路故障(521314,3)",   (uint8_t *)"BMS:(521314,3)"},  0}, //BMS
/*2366*/{0xF4, 521315,  5, {(uint8_t *)"BMS:燃料电池回路故障(521315,5)",   (uint8_t *)"BMS:(521315,5)"},  0}, //BMS
/*2367*/{0xF4, 521317,  3, {(uint8_t *)"BMS:DC-DC回路故障(521317,3)",      (uint8_t *)"BMS:(521317,3)"},  0}, //BMS
/*2368*/{0xF4, 521318,  5, {(uint8_t *)"BMS:DC-DC回路故障(521318,5)",      (uint8_t *)"BMS:(521318,5)"},  0}, //BMS
/*2369*/{0xF4, 0xFFFFF,0xFF /* 522240, 12 */, {(uint8_t *)"换电系统:温控机组故障(522240,12)", (uint8_t *)"PECU:(522240,12)"}, 0}, //BMS
/*2370*/{0xF5, 522029, 19, {(uint8_t *)"FCU:燃料电池系统故障(522029,19)", (uint8_t *)"FCU:(522029,19)"}, 0}, //FCU
/*2371*/{0xF5, 522029, 12, {(uint8_t *)"FCU:燃料电池系统故障(522029,12)", (uint8_t *)"FCU:(522029,12)"}, 0}, //FCU
/*2372*/{0xF5, 522030, 16, {(uint8_t *)"FCU:DCDC电容端过压(522030,16)",   (uint8_t *)"FCU:(522030,16)"}, 0}, //FCU
/*2373*/{0xF5, 522030,  0, {(uint8_t *)"FCU:DCDC电容端过压(522030,0)",    (uint8_t *)"FCU:(522030,0)"},  0}, //FCU
/*2374*/{0xF5, 522030, 18, {(uint8_t *)"FCU:DCDC电容端欠压(522030,18)",   (uint8_t *)"FCU:(522030,18)"}, 0}, //FCU
/*2375*/{0xF5, 522030,  1, {(uint8_t *)"FCU:DCDC电容端欠压(522030,1)",    (uint8_t *)"FCU:(522030,1)"},  0}, //FCU
/*2376*/{0xF5, 522031, 16, {(uint8_t *)"FCU:DCDC电容端过流(522031,16)",   (uint8_t *)"FCU:(522031,16)"}, 0}, //FCU
/*2377*/{0xF5, 522031,  0, {(uint8_t *)"FCU:DCDC电容端过流(522031,0)",    (uint8_t *)"FCU:(522031,0)"},  0}, //FCU
/*2378*/{0xF5, 522032, 16, {(uint8_t *)"FCU:DCDC电池端过压(522032,16)",   (uint8_t *)"FCU:(522032,16)"}, 0}, //FCU
/*2379*/{0xF5, 522032,  0, {(uint8_t *)"FCU:DCDC电池端过压(522032,0)",    (uint8_t *)"FCU:(522032,0)"},  0}, //FCU
/*2380*/{0xF5, 522032, 18, {(uint8_t *)"FCU:DCDC电池端欠压(522032,18)",   (uint8_t *)"FCU:(522032,18)"}, 0}, //FCU
/*2381*/{0xF5, 522032,  1, {(uint8_t *)"FCU:DCDC电池端欠压(522032,1)",    (uint8_t *)"FCU:(522032,1)"},  0}, //FCU
/*2382*/{0xF5, 522033, 16, {(uint8_t *)"FCU:DCDC电池端过流(522033,16)",   (uint8_t *)"FCU:(522033,16)"}, 0}, //FCU
/*2383*/{0xF5, 522033,  0, {(uint8_t *)"FCU:DCDC电池端过流(522033,0)",    (uint8_t *)"FCU:(522033,0)"},  0}, //FCU
/*2384*/{0xF5, 522034, 16, {(uint8_t *)"FCU:DCDC过热(522034,16)",         (uint8_t *)"FCU:(522034,16)"}, 0}, //FCU
/*2385*/{0xF5, 522034,  0, {(uint8_t *)"FCU:DCDC过热(522034,0)",          (uint8_t *)"FCU:(522034,0)"},  0}, //FCU
/*2386*/{0xF5, 522035,  4, {(uint8_t *)"FCU:DCDC短路保护(522035,4)",      (uint8_t *)"FCU:(522035,4)"},  0}, //FCU
/*2387*/{0xF5,   2853, 19, {(uint8_t *)"FCU:DCDC通信丢失故障(2853,19)",   (uint8_t *)"FCU:(2853,19)"},   0}, //FCU
/*2388*/{0xF5,   2853, 12, {(uint8_t *)"FCU:DCDC通信丢失故障(2853,12)",   (uint8_t *)"FCU:(2853,12)"},   0}, //FCU
/*2389*/{0xF6,   2853, 12, {(uint8_t *)"HMS:通讯故障(2853,12)",    (uint8_t *)"HMS:(2853,12)"}, 0}, //HMS
/*2390*/{0x84, 521600,  0, {(uint8_t *)"外挂DCDC:输出严重过压(521600,0)",  (uint8_t *)"Plug-in DCDC:(521600,0)"},   0}, //外挂DCDC
/*2391*/{0x84, 521600, 16, {(uint8_t *)"外挂DCDC:输出过压(521600,16)",     (uint8_t *)"Plug-in DCDC:(521600,16)"},  0}, //外挂DCDC
/*2392*/{0x84, 521601,  0, {(uint8_t *)"外挂DCDC:输出过流(521601,0)",      (uint8_t *)"Plug-in DCDC:(521601,0)"},   0}, //外挂DCDC
/*2393*/{0x84, 521602,  7, {(uint8_t *)"外挂DCDC:过温保护(521602,7)",      (uint8_t *)"Plug-in DCDC:(521602,7)"},   0}, //外挂DCDC
/*2394*/{0x84, 521603,  0, {(uint8_t *)"外挂DCDC:输入过压(521603,0)",      (uint8_t *)"Plug-in DCDC:(521603,0)"},   0}, //外挂DCDC
/*2395*/{0x84, 521604,  4, {(uint8_t *)"外挂DCDC:输入欠压(521604,4)",      (uint8_t *)"Plug-in DCDC:(521604,4)"},   0}, //外挂DCDC
/*2396*/{0x84, 521605,  3, {(uint8_t *)"外挂DCDC:过温告警(521605,3)",      (uint8_t *)"Plug-in DCDC:(521605,3)"},   0}, //外挂DCDC
/*2397*/{0x84, 521606,  1, {(uint8_t *)"外挂DCDC:输出欠压(521606,1)",      (uint8_t *)"Plug-in DCDC:(521606,1)"},   0}, //外挂DCDC
/*2398*/{0x84, 521607, 12, {(uint8_t *)"外挂DCDC:通讯故障(521607,12)",     (uint8_t *)"Plug-in DCDC:(521607,12)"},  0}, //外挂DCDC
/*2399*/{0x84, 521608, 11, {(uint8_t *)"外挂DCDC:模块故障(521608,11)",     (uint8_t *)"Plug-in DCDC:(521608,11)"},  0}, //外挂DCDC
/*2400*/{0x84, 521609,  1, {(uint8_t *)"外挂DCDC:辅源欠压(521609,1)",      (uint8_t *)"Plug-in DCDC:(521609,1)"},   0}, //外挂DCDC
/*2401*/{0x85, 521600,  0, {(uint8_t *)"外挂DCDC2:输出严重过压(521600,0)", (uint8_t *)"Plug-in DCDC2:(521600,0)"},  0}, //外挂DCDC
/*2402*/{0x85, 521600, 16, {(uint8_t *)"外挂DCDC2:输出过压(521600,16)",    (uint8_t *)"Plug-in DCDC2:(521600,16)"}, 0}, //外挂DCDC
/*2403*/{0x85, 521601,  0, {(uint8_t *)"外挂DCDC2:输出过流(521601,0)",     (uint8_t *)"Plug-in DCDC2:(521601,0)"},  0}, //外挂DCDC
/*2404*/{0x85, 521602,  7, {(uint8_t *)"外挂DCDC2:过温保护(521602,7)",     (uint8_t *)"Plug-in DCDC2:(521602,7)"},  0}, //外挂DCDC
/*2405*/{0x85, 521603,  0, {(uint8_t *)"外挂DCDC2:输入过压(521603,0)",     (uint8_t *)"Plug-in DCDC2:(521603,0)"},  0}, //外挂DCDC
/*2406*/{0x85, 521604,  4, {(uint8_t *)"外挂DCDC2:输入欠压(521604,4)",     (uint8_t *)"Plug-in DCDC2:(521604,4)"},  0}, //外挂DCDC
/*2407*/{0x85, 521605,  3, {(uint8_t *)"外挂DCDC2:过温告警(521605,3)",     (uint8_t *)"Plug-in DCDC2:(521605,3)"},  0}, //外挂DCDC
/*2408*/{0x85, 521606,  1, {(uint8_t *)"外挂DCDC2:输出欠压(521606,1)",     (uint8_t *)"Plug-in DCDC2:(521606,1)"},  0}, //外挂DCDC
/*2409*/{0x85, 521607, 12, {(uint8_t *)"外挂DCDC2:通讯故障(521607,12)",    (uint8_t *)"Plug-in DCDC2:(521607,12)"}, 0}, //外挂DCDC
/*2410*/{0x85, 521608, 11, {(uint8_t *)"外挂DCDC2:模块故障(521608,11)",    (uint8_t *)"Plug-in DCDC2:(521608,11)"}, 0}, //外挂DCDC
/*2411*/{0x85, 521609,  1, {(uint8_t *)"外挂DCDC2:辅源欠压(521609,1)",     (uint8_t *)"Plug-in DCDC2:(521609,1)"},  0}, //外挂DCDC
/*2412*/{0xEF, 521736,  3, {(uint8_t *)"MCU:油泵过压(521736,3)",         (uint8_t *)"MCU:(521736,3)"},   0},
/*2413*/{0xEF, 521736,  4, {(uint8_t *)"MCU:油泵欠压(521736,4)",         (uint8_t *)"MCU:(521736,4)"},   0},
/*2414*/{0xEF, 521736, 22, {(uint8_t *)"MCU:油泵短路(521736,22)",        (uint8_t *)"MCU:(521736,22)"},  0},
/*2415*/{0xEF, 521736,  6, {(uint8_t *)"MCU:油泵过流(521736,6)",         (uint8_t *)"MCU:(521736,6)"},   0},
/*2416*/{0xEF, 521736,  7, {(uint8_t *)"MCU:油泵电机堵转(521736,7)",     (uint8_t *)"MCU:(521736,7)"},   0},
/*2417*/{0xEF, 521736, 16, {(uint8_t *)"MCU:油泵控制器过温(521736,16)",  (uint8_t *)"MCU:(521736,16)"},  0},
/*2418*/{0xEF, 521736,  0, {(uint8_t *)"MCU:油泵电机超速(521736,0)",     (uint8_t *)"MCU:(521736,0)"},   0},
/*2419*/{0xF0, 521736,  3, {(uint8_t *)"MCU2:油泵过压(521736,3)",        (uint8_t *)"MCU2:(521736,3)"},  0},
/*2420*/{0xF0, 521736,  4, {(uint8_t *)"MCU2:油泵欠压(521736,4)",        (uint8_t *)"MCU2:(521736,4)"},  0},
/*2421*/{0xF0, 521736, 22, {(uint8_t *)"MCU2:油泵短路(521736,22)",       (uint8_t *)"MCU2:(521736,22)"}, 0},
/*2422*/{0xF0, 521736,  6, {(uint8_t *)"MCU2:油泵过流(521736,6)",        (uint8_t *)"MCU2:(521736,6)"},  0},
/*2423*/{0xF0, 521736,  7, {(uint8_t *)"MCU2:油泵电机堵转(521736,7)",    (uint8_t *)"MCU2:(521736,7)"},  0},
/*2424*/{0xF0, 521736, 16, {(uint8_t *)"MCU2:油泵控制器过温(521736,16)", (uint8_t *)"MCU2:(521736,16)"}, 0},
/*2425*/{0xF0, 521736,  0, {(uint8_t *)"MCU2:油泵电机超速(521736,0)",    (uint8_t *)"MCU2:(521736,0)"},  0},
/*2426*/{0xDB,0xFFFFF,0xFF /* 522241, 16 */, {(uint8_t *)"换电系统:换电连接器过温故障(522241,16)",       (uint8_t *)"PECU:(522241,16)"}, 0}, //V1.14 由过温一般故障更新为过温故障
/*2427*/{0xDB,0xFFFFF,0xFF /* 522241,  0 */, {(uint8_t *)"换电系统:换电连接器过温严重故障(522241,0)",    (uint8_t *)"PECU:(522241,0)"},  0},
/*2428*/{0xDB,0xFFFFF,0xFF /* 522242,  5 */, {(uint8_t *)"换电系统:换电机构锁止故障(522242,7)",          (uint8_t *)"PECU:(522242,7)"},  0}, //V1.14 由(522242,7)更新为(522242,5)
/*2429*/{0xDB,0xFFFFF,0xFF /* 522243,  5 */, {(uint8_t *)"换电系统:换电连接器持续断开故障(522243,5)",    (uint8_t *)"PECU:(522243,5)"},  0},
/*2430*/{0xDB,0xFFFFF,0xFF /* 522243, 16 */, {(uint8_t *)"换电系统:换电连接器瞬断一般故障(522243,16)",   (uint8_t *)"PECU:(522243,16)"}, 0},
/*2431*/{0xDB,0xFFFFF,0xFF /* 522243,  0 */, {(uint8_t *)"换电系统:换电连接器瞬断严重故障(522243,0)",    (uint8_t *)"PECU:(522243,0)"},  0},
/*2432*/{0xDB,0xFFFFF,0xFF /* 522244,  2 */, {(uint8_t *)"换电系统:换电连接器温感失效故障(522244,2)",    (uint8_t *)"PECU:(522244,2)"},  0},
/*2433*/{0xDB,0xFFFFF,0xFF /* 522244,  5 */, {(uint8_t *)"换电系统:换电连接器温感断线故障(522244,5)",    (uint8_t *)"PECU:(522244,5)"},  0},
/*2434*/{0xDB,0xFFFFF,0xFF /* 522244,  6 */, {(uint8_t *)"换电系统:换电连接器温感短路故障(522244,6)",    (uint8_t *)"PECU:(522244,6)"},  0},
/*2435*/{0xDB,0xFFFFF,0xFF /* 522245,  9 */, {(uint8_t *)"换电系统:换电控制器接收CAN信息超时(522245,9)", (uint8_t *)"PECU:(522245,9)"},  0},
/*2436*/{0xDB,0xFFFFF,0xFF /* 522239, 12 */, {(uint8_t *)"换电系统:换电控制器自检故障(522239,12)",       (uint8_t *)"PECU:(522239,12)"}, 0},
/*2437*/{0xDB,0xFFFFF,0xFF /* 522238, 13 */, {(uint8_t *)"换电系统:换电控制器输入电压异常(522238,13)",   (uint8_t *)"PECU:(522238,13)"}, 0},
/*2438*/{0xDB,0xFFFFF,0xFF /* 522237, 12 */, {(uint8_t *)"换电系统:无线通讯故障(522237,12)",             (uint8_t *)"PECU:(522237,12)"}, 0},
/*2439*/{0xDB,0xFFFFF,0xFF /* 522235, 12 */, {(uint8_t *)"换电系统:换电过程中驻车状态异常(522235,12)",   (uint8_t *)"PECU:(522235,12)"}, 0},
/*2440*/{0xDB,0xFFFFF,0xFF /* 522234,  7 */, {(uint8_t *)"换电系统:换电机构电磁阀或电机故障(522234,7)",  (uint8_t *)"PECU:(522234,7)"},  0},
/*2441*/{0xDB,0xFFFFF,0xFF /* 522233,  7 */, {(uint8_t *)"换电系统:换电机构液压或气压异常(522233,7)",    (uint8_t *)"PECU:(522233,7)"},  0},
/*2442*/{0xDB,0xFFFFF,0xFF /* 522232, 23 */, {(uint8_t *)"换电系统:电池箱换电柜不匹配(522232,23)",       (uint8_t *)"PECU:(522232,23)"}, 0},
/*2443*/{0xFF,      0,  0, {(uint8_t *)"临时解除限速输入模式",                   (uint8_t *)"Temporarily release speed limit input mode"}, 0},
/*2444*/{0xFF,      0,  0, {(uint8_t *)"临时解除限速失败,限速状态已激活",        (uint8_t *)"Temporary lift speed limit failed,Speed limit activated"}, 0},
/*2445*/{0xFF,      0,  0, {(uint8_t *)"车辆已临时解除限速,请注意安全!",         (uint8_t *)"Speed limit temporarily lifted, Take care of safety!"}, 0},
/*2446*/{0xFF,      0,  0, {(uint8_t *)"车辆即将进入锁车状态,请注意安全!",       (uint8_t *)"Vehicle will enter lock state, Take care of safety!"}, 0},
/*2447*/{0xFF,      0,  0, {(uint8_t *)"车辆限速即将激活,熄火前请联系4009005555",(uint8_t *)"Speed limit will activate,Contact manufacturers "}, 0},
/*2448*/{0xFF,      0,  0, {(uint8_t *)"车辆已进入锁车状态,请注意安全!",         (uint8_t *)"Vehicle is locked,Please take care of safety!"}, 0},
/*2449*/{0xFF,      0,  0, {(uint8_t *)"车辆限速已激活,请联系4009005555",        (uint8_t *)"Speed limit activated,Contact manufacturers"}, 0},
/*2450*/{0xFF,      0,  0, {(uint8_t *)"限速预警,请联系4009005555",              (uint8_t *)"Warning of speed limit,Contact manufacturers"}, 0},
/*2451*/{0xFF,      0,  0, {(uint8_t *)"车辆受控中!",                            (uint8_t *)"vehicle under control"}, 0},

/*2452*/{0x82,0xFFFFF,0xFF /* 522085,  3 */, {(uint8_t *)"TMS:电机风扇1过压故障(522085,3)",           (uint8_t *)"TMS:(522085,3)"}, 0},
/*2453*/{0x82,0xFFFFF,0xFF /* 522085,  4 */, {(uint8_t *)"TMS:电机风扇1欠压故障(522085,4)",           (uint8_t *)"TMS:(522085,4)"}, 0},
/*2454*/{0x82,0xFFFFF,0xFF /* 522085,  6 */, {(uint8_t *)"TMS:电机风扇1过流故障(522085,6)",           (uint8_t *)"TMS:(522085,6)"}, 0},
/*2455*/{0x82,0xFFFFF,0xFF /* 522085, 20 */, {(uint8_t *)"TMS:电机风扇1过温故障(522085,20)",           (uint8_t *)"TMS:(522085,20)"}, 0},
/*2456*/{0x82, 522085, 22, {(uint8_t *)"进站维修，风扇故障",              (uint8_t *)"TMS:(522085,22)"}, 0},
/*2457*/{0x82, 521403, 12, {(uint8_t *)"进站维修，风扇故障",              (uint8_t *)"TMS:(521403,12)"}, 0},
/*2458*/{0x82, 522093,  5, {(uint8_t *)"进站维修，电机进水温度传感器故障",           (uint8_t *)"TMS:(522093,5)"}, 0},
/*2459*/{0x82, 522093,  4, {(uint8_t *)"进站维修，电机进水温度传感器故障",           (uint8_t *)"TMS:(522093,4)"}, 0},
/*2460*/{0x82, 522093,  3, {(uint8_t *)"进站维修，电机进水温度传感器故障",           (uint8_t *)"TMS:(522093,3)"}, 0},
/*2461*/{0x82, 522094,  5, {(uint8_t *)"进站维修，电机出水温度传感器故障",           (uint8_t *)"TMS:(522094,5)"}, 0},
/*2462*/{0x82, 522094,  4, {(uint8_t *)"进站维修，电机出水温度传感器故障",           (uint8_t *)"TMS:(522094,4)"}, 0},
/*2463*/{0x82, 522094,  3, {(uint8_t *)"进站维修，电机出水温度传感器故障",           (uint8_t *)"TMS:(522094,3)"}, 0},
/*2464*/{0x82, 522095,  5, {(uint8_t *)"进站维修，电池进水温度传感器故障",           (uint8_t *)"TMS:(522095,5)"}, 0},
/*2465*/{0x82, 522095,  4, {(uint8_t *)"进站维修，电池进水温度传感器故障",           (uint8_t *)"TMS:(522095,4)"}, 0},
/*2466*/{0x82, 522095,  3, {(uint8_t *)"进站维修，电池进水温度传感器故障",           (uint8_t *)"TMS:(522095,3)"}, 0},
/*2467*/{0x82, 521407, 12, {(uint8_t *)"进站维修，电池进水温度传感器故障",           (uint8_t *)"TMS:(521407,12)"}, 0},
/*2468*/{0x82,0xFFFFF,0xFF /* 522096,  5 */, {(uint8_t *)"TMS:电池出-水温传感器开路(522096,5)",           (uint8_t *)"TMS:(522096,5)"}, 0},
/*2469*/{0x82,0xFFFFF,0xFF /* 522096,  4 */, {(uint8_t *)"TMS:电池出-水温传感器短低(522096,4)",           (uint8_t *)"TMS:(522096,4)"}, 0},
/*2470*/{0x82,0xFFFFF,0xFF /* 522096,  3 */, {(uint8_t *)"TMS:电池出-水温传感器短高(522096,3)",           (uint8_t *)"TMS:(522096,3)"}, 0},
/*2471*/{0x82, 521406, 12, {(uint8_t *)"进站维修，电池回水温度传感器故障",           (uint8_t *)"TMS:(521406,12)"}, 0},
/*2472*/{0x82, 522102,  5, {(uint8_t *)"进站维修，高压压力传感器故障",           (uint8_t *)"TMS:(522102,5)"}, 0},
/*2473*/{0x82, 522102,  4, {(uint8_t *)"进站维修，高压压力传感器故障",           (uint8_t *)"TMS:(522102,4)"}, 0},
/*2474*/{0x82, 522102,  3, {(uint8_t *)"进站维修，高压压力传感器故障",           (uint8_t *)"TMS:(522102,3)"}, 0},
/*2475*/{0x82, 521404, 12, {(uint8_t *)"进站维修，高压压力传感器故障",           (uint8_t *)"TMS:(521404,12)"}, 0},
/*2476*/{0x82, 522103,  5, {(uint8_t *)"进站维修，低压压力传感器故障",           (uint8_t *)"TMS:(522103,5)"}, 0},
/*2477*/{0x82, 522103,  4, {(uint8_t *)"进站维修，低压压力传感器故障",           (uint8_t *)"TMS:(522103,4)"}, 0},
/*2478*/{0x82, 522103,  3, {(uint8_t *)"进站维修，低压压力传感器故障",           (uint8_t *)"TMS:(522103,3)"}, 0},
/*2479*/{0x82, 521405, 12, {(uint8_t *)"进站维修，低压压力传感器故障",           (uint8_t *)"TMS:(521405,12)"}, 0},
/*2480*/{0x82, 522104,  5, {(uint8_t *)"进站维修，冷媒温度传感器故障",           (uint8_t *)"TMS:(522104,5)"}, 0},
/*2481*/{0x82, 522104,  4, {(uint8_t *)"进站维修，冷媒温度传感器故障",           (uint8_t *)"TMS:(522104,4)"}, 0},
/*2482*/{0x82, 522104,  3, {(uint8_t *)"进站维修，冷媒温度传感器故障",           (uint8_t *)"TMS:(522104,3)"}, 0},
/*2483*/{0x82, 521419, 12, {(uint8_t *)"进站维修，排气温度传感器故障",           (uint8_t *)"TMS:(521419,12)"}, 0},
/*2484*/{0x82, 522108,  5, {(uint8_t *)"进站维修，三通阀故障",           (uint8_t *)"TMS:(522108,5)"}, 0},
/*2485*/{0x82, 522108,  4, {(uint8_t *)"进站维修，三通阀故障",           (uint8_t *)"TMS:(522108,4)"}, 0},
/*2486*/{0x82,0xFFFFF,0xFF /* 522108,  3 */, {(uint8_t *)"TMS:三通水阀过流故障(522108,3)",           (uint8_t *)"TMS:(522108,3)"}, 0},
/*2487*/{0x82,0xFFFFF,0xFF /* 522108, 12 */, {(uint8_t *)"TMS:三通水阀过温故障(522108,12)",           (uint8_t *)"TMS:(522108,12)"}, 0},
/*2488*/{0x82,0xFFFFF,0xFF /* 522108, 13 */, {(uint8_t *)"TMS:三通水阀电压异常(522108,13)",           (uint8_t *)"TMS:(522108,13)"}, 0},
/*2489*/{0x82,0xFFFFF,0xFF /* 522108,  2 */, {(uint8_t *)"TMS:三通水阀通讯故障(522108,2)",           (uint8_t *)"TMS:(522108,2)"}, 0},
/*2490*/{0x82, 522109,  5, {(uint8_t *)"进站维修，四通阀故障",           (uint8_t *)"TMS:(522109,5)"}, 0},
/*2491*/{0x82, 522109,  4, {(uint8_t *)"进站维修，四通阀故障",           (uint8_t *)"TMS:(522109,4)"}, 0},
/*2492*/{0x82,0xFFFFF,0xFF /* 522109,  3 */, {(uint8_t *)"TMS:四通水阀过流故障(522109,3)",           (uint8_t *)"TMS:(522109,3)"}, 0},
/*2493*/{0x82,0xFFFFF,0xFF /* 522109, 12 */, {(uint8_t *)"TMS:四通水阀过温故障(522109,12)",           (uint8_t *)"TMS:(522109,12)"}, 0},
/*2494*/{0x82,0xFFFFF,0xFF /* 522109, 13 */, {(uint8_t *)"TMS:四通水阀电压异常(522109,13)",           (uint8_t *)"TMS:(522109,13)"}, 0},
/*2495*/{0x82,0xFFFFF,0xFF /* 522109,  2 */, {(uint8_t *)"TMS:四通水阀通讯故障(522109,2)",           (uint8_t *)"TMS:(522109,2)"}, 0},
/*2496*/{0x82, 522144,  5, {(uint8_t *)"进站维修，六通阀故障",           (uint8_t *)"TMS:(522144,5)"}, 0},
/*2497*/{0x82, 522144,  4, {(uint8_t *)"进站维修，六通阀故障",           (uint8_t *)"TMS:(522144,4)"}, 0},
/*2498*/{0x82, 522144,  3, {(uint8_t *)"进站维修，六通阀故障",           (uint8_t *)"TMS:(522144,3)"}, 0},
/*2499*/{0x82, 522144, 12, {(uint8_t *)"进站维修，六通阀故障",           (uint8_t *)"TMS:(522144,12)"}, 0},
/*2500*/{0x82, 522144, 13, {(uint8_t *)"进站维修，六通阀故障",           (uint8_t *)"TMS:(522144,13)"}, 0},
/*2501*/{0x82, 522144,  2, {(uint8_t *)"进站维修，六通阀故障",           (uint8_t *)"TMS:(522144,2)"}, 0},
/*2502*/{0x82, 522110,  5, {(uint8_t *)"进站维修，电子膨胀阀故障",           (uint8_t *)"TMS:(522110,5)"}, 0},
/*2503*/{0x82, 522110,  4, {(uint8_t *)"进站维修，电子膨胀阀故障",           (uint8_t *)"TMS:(522110,4)"}, 0},
/*2504*/{0x82, 522110,  3, {(uint8_t *)"进站维修，电子膨胀阀故障",           (uint8_t *)"TMS:(522110,3)"}, 0},
/*2505*/{0x82, 522146,  5, {(uint8_t *)"进站维修，电子膨胀阀故障",           (uint8_t *)"TMS:(522146,5)"}, 0},
/*2506*/{0x82, 522146,  4, {(uint8_t *)"进站维修，电子膨胀阀故障",           (uint8_t *)"TMS:(522146,4)"}, 0},
/*2507*/{0x82, 522146,  3, {(uint8_t *)"进站维修，电子膨胀阀故障",           (uint8_t *)"TMS:(522146,3)"}, 0},
/*2508*/{0x82,0xFFFFF,0xFF /* 522122,  1 */, {(uint8_t *)"TMS:PTC高压反接(522122，1)",           (uint8_t *)"TMS:(522122,1)"}, 0},
/*2509*/{0x82, 522122,  0, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522122,0)"}, 0},
/*2510*/{0x82, 522122, 25, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522122,25)"}, 0},
/*2511*/{0x82, 522122,  5, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522122,5)"}, 0},
/*2512*/{0x82, 522122, 20, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522122,20)"}, 0},
/*2513*/{0x82,0xFFFFF,0xFF /* 522123, 19 */, {(uint8_t *)"TMS:PTC通讯故障(522123,19)",           (uint8_t *)"TMS:(522123,19)"}, 0},
/*2514*/{0x82,0xFFFFF,0xFF /* 522123, 16 */, {(uint8_t *)"TMS:PTC出水温度过高(522123,16)",           (uint8_t *)"TMS:(522123,16)"}, 0},
/*2515*/{0x82,0xFFFFF,0xFF /* 522123,  6 */, {(uint8_t *)"TMS:PTC过流故障(522123,6)",           (uint8_t *)"TMS:(522123,6)"}, 0},
/*2516*/{0x82,0xFFFFF,0xFF /* 522123,  3 */, {(uint8_t *)"TMS:PTC过压故障(522123,3)",           (uint8_t *)"TMS:(522123,3)"}, 0},
/*2517*/{0x82,0xFFFFF,0xFF /* 522123,  4 */, {(uint8_t *)"TMS:PTC欠压故障(522123,4)",           (uint8_t *)"TMS:(522123,4)"}, 0},
/*2518*/{0x82,0xFFFFF,0xFF /* 522123, 26 */, {(uint8_t *)"TMS:PTCIGBT过温(522123,26)",           (uint8_t *)"TMS:(522123,26)"}, 0},
/*2519*/{0x82, 522123, 21, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522123,21)"}, 0},
/*2520*/{0x82, 522123, 22, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522123,22)"}, 0},
/*2521*/{0x82, 522123, 12, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(522123,12)"}, 0},
/*2522*/{0x82, 521401, 20, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,20)"}, 0},
/*2523*/{0x82, 521401,  1, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,1)"}, 0},
/*2524*/{0x82, 521401,  0, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,0)"}, 0},
/*2525*/{0x82, 521401, 25, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,25)"}, 0},
/*2526*/{0x82, 521401,  5, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,5)"}, 0},
/*2527*/{0x82, 521401, 12, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,12)"}, 0},
/*2528*/{0x82, 521401, 19, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,19)"}, 0},
/*2529*/{0x82,0xFFFFF,0xFF /* 521401, 16 */, {(uint8_t *)"TMS:PTC温度过高(521401,16)",           (uint8_t *)"TMS:(521401,16)"}, 0},
/*2530*/{0x82,0xFFFFF,0xFF /* 521401,  6 */, {(uint8_t *)"TMS:PTC过电流(521401,6)",           (uint8_t *)"TMS:(521401,6)"}, 0},
/*2531*/{0x82,0xFFFFF,0xFF /* 521401,  3 */, {(uint8_t *)"TMS:PTC过电压(521401,3)",           (uint8_t *)"TMS:(521401,3)"}, 0},
/*2532*/{0x82,0xFFFFF,0xFF /* 521401,  4 */, {(uint8_t *)"TMS:PTC欠电压(521401,4)",           (uint8_t *)"TMS:(521401,4)"}, 0},
/*2533*/{0x82,0xFFFFF,0xFF /* 521401, 26 */, {(uint8_t *)"TMS:PTC IGBT芯片温度过高(521401,26)",           (uint8_t *)"TMS:(521401,26)"}, 0},
/*2534*/{0x82, 521401, 21, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,21)"}, 0},
/*2535*/{0x82, 521401, 22, {(uint8_t *)"进站维修，PTC故障",           (uint8_t *)"TMS:(521401,22)"}, 0},
/*2536*/{0x82, 521410, 12, {(uint8_t *)"请检查液位",           (uint8_t *)"TMS:(521410,12)"}, 0},
/*2537*/{0x82, 522124, 18, {(uint8_t *)"请补加冷却液",           (uint8_t *)"TMS:(522124,18)"}, 0},
/*2538*/{0x82, 522125, 18, {(uint8_t *)"请补加冷却液",           (uint8_t *)"TMS:(522125,18)"}, 0},
/*2539*/{0x82,0xFFFFF,0xFF /* 522126, 16 */, {(uint8_t *)"TMS:冷媒压力高(522126,16)",           (uint8_t *)"TMS:(522126,16)"}, 0},
/*2540*/{0x82,0xFFFFF,0xFF /* 522127, 18 */, {(uint8_t *)"TMS:冷媒压力低(522127,18)",           (uint8_t *)"TMS:(522127,18)"}, 0},
/*2541*/{0x82,0xFFFFF,0xFF /* 522128,  6 */, {(uint8_t *)"TMS:压缩机长时过流(522128,6)",           (uint8_t *)"TMS:(522128,6)"}, 0},
/*2542*/{0x82,0xFFFFF,0xFF /* 522128, 21 */, {(uint8_t *)"TMS:压缩机短时过流(522128,21)",           (uint8_t *)"TMS:(522128,21)"}, 0},
/*2543*/{0x82,0xFFFFF,0xFF /* 522128,  3 */, {(uint8_t *)"TMS:压缩机过压故障(522128,3)",           (uint8_t *)"TMS:(522128,3)"}, 0},
/*2544*/{0x82,0xFFFFF,0xFF /* 522128,  4 */, {(uint8_t *)"TMS:压缩机欠压故障(522128,4)",           (uint8_t *)"TMS:(522128,4)"}, 0},
/*2545*/{0x82,0xFFFFF,0xFF /* 522128, 19 */, {(uint8_t *)"TMS:压缩机通讯故障(522128,19)",           (uint8_t *)"TMS:(522128,19)"}, 0},
/*2546*/{0x82,0xFFFFF,0xFF /* 522128, 16 */, {(uint8_t *)"TMS:压缩机过温故障(522128,16)",           (uint8_t *)"TMS:(522128,16)"}, 0},
/*2547*/{0x82, 522128, 24, {(uint8_t *)"进站维修，压缩机故障",           (uint8_t *)"TMS:(522128,24)"}, 0},
/*2548*/{0x82, 522128, 20, {(uint8_t *)"进站维修，压缩机故障",           (uint8_t *)"TMS:(522128,20)"}, 0},
/*2549*/{0x82, 0xFFFFF,0xFF /* 522131, 16 */, {(uint8_t *)"TMS:排气温度高(522131,16)",           (uint8_t *)"TMS:(522131,16)"}, 0},
/*2550*/{0x82, 521402, 12, {(uint8_t *)"进站维修，压缩机故障",           (uint8_t *)"TMS:(521402,12)"}, 0},
/*2551*/{0x82,0xFFFFF,0xFF /* 521402,  6 */, {(uint8_t *)"TMS:压缩机过电流(521402,6)",           (uint8_t *)"TMS:(521402,6)"}, 0},
/*2552*/{0x82,0xFFFFF,0xFF /* 521402,  3 */, {(uint8_t *)"TMS:压缩机过电压(521402,3)",           (uint8_t *)"TMS:(521402,3)"}, 0},
/*2553*/{0x82,0xFFFFF,0xFF /* 521402,  4 */, {(uint8_t *)"TMS:压缩机欠电压(521402,4)",           (uint8_t *)"TMS:(521402,4)"}, 0},
/*2554*/{0x82, 521402, 19, {(uint8_t *)"进站维修，压缩机故障",           (uint8_t *)"TMS:(521402,19)"}, 0},
/*2555*/{0x82,0xFFFFF,0xFF /* 521402, 16 */, {(uint8_t *)"TMS:压缩机过温(521402,16)",           (uint8_t *)"TMS:(521402,16)"}, 0},
/*2556*/{0x82,0xFFFFF,0xFF /* 521402, 20 */, {(uint8_t *)"TMS:压缩机启动失败(521402,20)",           (uint8_t *)"TMS:(521402,20)"}, 0},
/*2557*/{0x82,0xFFFFF,0xFF /* 521402, 15 */, {(uint8_t *)"TMS:压缩机过载/过功率报警(521402,15)",           (uint8_t *)"TMS:(521402,15)"}, 0},
/*2558*/{0x82, 521402, 10, {(uint8_t *)"进站维修，压缩机故障",           (uint8_t *)"TMS:(521402,10)"}, 0},
/*2559*/{0x82, 522118,  5, {(uint8_t *)"进站维修，暖风出水温度传感器故障",           (uint8_t *)"TMS:(522118,5)"}, 0},
/*2560*/{0x82, 522118,  4, {(uint8_t *)"进站维修，暖风出水温度传感器故障",           (uint8_t *)"TMS:(522118,4)"}, 0},
/*2561*/{0x82, 522118,  3, {(uint8_t *)"进站维修，暖风出水温度传感器故障",           (uint8_t *)"TMS:(522118,3)"}, 0},
/*2562*/{0x82, 522105,  5, {(uint8_t *)"进站维修，加热电磁阀故障",           (uint8_t *)"TMS:(522105,5)"}, 0},
/*2563*/{0x82, 522105,  4, {(uint8_t *)"进站维修，加热电磁阀故障",           (uint8_t *)"TMS:(522105,4)"}, 0},
/*2564*/{0x82, 522105,  3, {(uint8_t *)"进站维修，加热电磁阀故障",           (uint8_t *)"TMS:(522105,3)"}, 0},
/*2565*/{0x82, 521412,  0, {(uint8_t *)"进站维修，供电异常",           (uint8_t *)"TMS:(521412,0)"}, 0},

/*2566*/{0x50,    158, 10, {(uint8_t *)"EPB:(158,10)",   (uint8_t *)"EPB:(158,10)"},   0}, //科密瑞立EPB
/*2567*/{0x50,    158,  3, {(uint8_t *)"EPB:(158,3)",    (uint8_t *)"EPB:(158,3)"},   0}, //科密瑞立EPB
/*2568*/{0x50,    168,  0, {(uint8_t *)"EPB:(168,0)",    (uint8_t *)"EPB:(168,0)"},   0}, //科密瑞立EPB
/*2569*/{0x50,    168,  1, {(uint8_t *)"EPB:(168,1)",    (uint8_t *)"EPB:(168,1)"},   0}, //科密瑞立EPB
/*2570*/{0x50,    168, 12, {(uint8_t *)"EPB:(168,12)",   (uint8_t *)"EPB:(168,12)"},   0}, //科密瑞立EPB
/*2571*/{0x50,    168,  5, {(uint8_t *)"EPB:(168,5)",    (uint8_t *)"EPB:(168,5)"},   0}, //科密瑞立EPB
/*2572*/{0x50,   3132,  3, {(uint8_t *)"EPB:(3132,3)",   (uint8_t *)"EPB:(3132,3)"},   0}, //科密瑞立EPB
/*2573*/{0x50,   3132,  4, {(uint8_t *)"EPB:(3132,4)",   (uint8_t *)"EPB:(3132,4)"},   0}, //科密瑞立EPB
/*2574*/{0x50,   3132,  5, {(uint8_t *)"EPB:(3132,5)",   (uint8_t *)"EPB:(3132,5)"},   0}, //科密瑞立EPB
/*2575*/{0x50,   3136,  0, {(uint8_t *)"EPB:(3136,0)",   (uint8_t *)"EPB:(3136,0)"},   0}, //科密瑞立EPB
/*2576*/{0x50,    617,  7, {(uint8_t *)"EPB:(617,7)",    (uint8_t *)"EPB:(617,7)"},   0}, //科密瑞立EPB
/*2577*/{0x50,    618,  7, {(uint8_t *)"EPB:(618,7)",    (uint8_t *)"EPB:(618,7)"},   0}, //科密瑞立EPB
/*2578*/{0x50,    619, 14, {(uint8_t *)"EPB:(619,14)",   (uint8_t *)"EPB:(619,14)"},   0}, //科密瑞立EPB
/*2579*/{0x50,    619,  7, {(uint8_t *)"EPB:(619,7)",    (uint8_t *)"EPB:(619,7)"},   0}, //科密瑞立EPB
/*2580*/{0x50,    629, 13, {(uint8_t *)"EPB:(629,13)",   (uint8_t *)"EPB:(629,13)"},   0}, //科密瑞立EPB
/*2581*/{0x50,    629,  2, {(uint8_t *)"EPB:(629,2)",    (uint8_t *)"EPB:(629,2)"},   0}, //科密瑞立EPB
/*2582*/{0x50,    629,  9, {(uint8_t *)"EPB:(629,9)",    (uint8_t *)"EPB:(629,9)"},   0}, //科密瑞立EPB
/*2583*/{0x50,    630, 13, {(uint8_t *)"EPB:(630,13)",   (uint8_t *)"EPB:(630,13)"},   0}, //科密瑞立EPB
/*2584*/{0x50,    630,  2, {(uint8_t *)"EPB:(630,2)",    (uint8_t *)"EPB:(630,2)"},   0}, //科密瑞立EPB
/*2585*/{0x50,    193,  9, {(uint8_t *)"EPB:(193,9)",    (uint8_t *)"EPB:(193,9)"},   0}, //科密瑞立EPB
/*2586*/{0x50,   4289,  5, {(uint8_t *)"EPB:(4289,5)",   (uint8_t *)"EPB:(4289,5)"},   0}, //科密瑞立EPB
/*2587*/{0x50,  12370,  3, {(uint8_t *)"EPB:(12370,3)",  (uint8_t *)"EPB:(12370,3)"},   0}, //科密瑞立EPB
/*2588*/{0x50,  12370,  5, {(uint8_t *)"EPB:(12370,5)",  (uint8_t *)"EPB:(12370,5)"},   0}, //科密瑞立EPB
/*2589*/{0x50,  12370,  6, {(uint8_t *)"EPB:(12370,6)",  (uint8_t *)"EPB:(12370,6)"},   0}, //科密瑞立EPB
/*2590*/{0x50,  13138,  3, {(uint8_t *)"EPB:(13138,3)",  (uint8_t *)"EPB:(13138,3)"},   0}, //科密瑞立EPB
/*2591*/{0x50,  13138,  4, {(uint8_t *)"EPB:(13138,4)",  (uint8_t *)"EPB:(13138,4)"},   0}, //科密瑞立EPB
/*2592*/{0x50,  13138,  5, {(uint8_t *)"EPB:(13138,5)",  (uint8_t *)"EPB:(13138,5)"},   0}, //科密瑞立EPB
/*2593*/{0x50,  13394,  3, {(uint8_t *)"EPB:(13394,3)",  (uint8_t *)"EPB:(13394,3)"},   0}, //科密瑞立EPB
/*2594*/{0x50,  13394,  5, {(uint8_t *)"EPB:(13394,5)",  (uint8_t *)"EPB:(13394,5)"},   0}, //科密瑞立EPB
/*2595*/{0x50,  13394,  6, {(uint8_t *)"EPB:(13394,6)",  (uint8_t *)"EPB:(13394,6)"},   0}, //科密瑞立EPB
/*2596*/{0x50,  13906,  3, {(uint8_t *)"EPB:(13906,3)",  (uint8_t *)"EPB:(13906,3)"},   0}, //科密瑞立EPB
/*2597*/{0x50,  13906,  5, {(uint8_t *)"EPB:(13906,5)",  (uint8_t *)"EPB:(13906,5)"},   0}, //科密瑞立EPB
/*2598*/{0x50,  13906,  6, {(uint8_t *)"EPB:(13906,6)",  (uint8_t *)"EPB:(13906,6)"},   0}, //科密瑞立EPB
/*2599*/{0x50,  14162,  3, {(uint8_t *)"EPB:(14162,3)",  (uint8_t *)"EPB:(14162,3)"},   0}, //科密瑞立EPB
/*2600*/{0x50,  14418, 11, {(uint8_t *)"EPB:(14418,11)", (uint8_t *)"EPB:(14418,11)"},   0}, //科密瑞立EPB
/*2601*/{0x50,  14674, 11, {(uint8_t *)"EPB:(14674,11)", (uint8_t *)"EPB:(14674,11)"},   0}, //科密瑞立EPB
/*2602*/{0x50,  14930, 11, {(uint8_t *)"EPB:(14930,11)", (uint8_t *)"EPB:(14930,11)"},   0}, //科密瑞立EPB
/*2603*/{0x50,0xFFFFF, 0xFF /*  1121,  8 */, {(uint8_t *)"EPB:(1121,8)",    (uint8_t *)"EPB:(1121,8)"},    0}, //Knorr EPB
/*2604*/{0x50,0xFFFFF, 0xFF /*  1121,  9 */, {(uint8_t *)"EPB:(1121,9)",    (uint8_t *)"EPB:(1121,9)"},    0}, //Knorr EPB
/*2605*/{0x50,0xFFFFF, 0xFF /*  1324,  9 */, {(uint8_t *)"EPB:(1324,9)",    (uint8_t *)"EPB:(1324,9)"},    0}, //Knorr EPB
/*2606*/{0x50,    158, 10, {(uint8_t *)"EPB:(158,10)",    (uint8_t *)"EPB:(158,10)"},    0}, //Knorr EPB
/*2607*/{0x50,    158,  3, {(uint8_t *)"EPB:(158,3)",     (uint8_t *)"EPB:(158,3)"},     0}, //Knorr EPB
/*2608*/{0x50,    168,  0, {(uint8_t *)"EPB:(168,0)",     (uint8_t *)"EPB:(168,0)"},     0}, //Knorr EPB
/*2609*/{0x50,    168,  1, {(uint8_t *)"EPB:(168,1)",     (uint8_t *)"EPB:(168,1)"},     0}, //Knorr EPB
/*2610*/{0x50,    168, 12, {(uint8_t *)"EPB:(168,12)",    (uint8_t *)"EPB:(168,12)"},    0}, //Knorr EPB
/*2611*/{0x50,    168,  5, {(uint8_t *)"EPB:(168,5)",     (uint8_t *)"EPB:(168,5)"},     0}, //Knorr EPB
/*2612*/{0x50,0xFFFFF, 0xFF /*  1814,  9 */, {(uint8_t *)"EPB:(1814,9)",    (uint8_t *)"EPB:(1814,9)"},    0}, //Knorr EPB
/*2613*/{0x50,0xFFFFF, 0xFF /*  3132, 12 */, {(uint8_t *)"EPB:(3132,12)",   (uint8_t *)"EPB:(3132,12)"},   0}, //Knorr EPB
/*2614*/{0x50,   3132,  3, {(uint8_t *)"EPB:(3132,3)",    (uint8_t *)"EPB:(3132,3)"},    0}, //Knorr EPB
/*2615*/{0x50,   3132,  4, {(uint8_t *)"EPB:(3132,4)",    (uint8_t *)"EPB:(3132,4)"},    0}, //Knorr EPB
/*2616*/{0x50,   3132,  5, {(uint8_t *)"EPB:(3132,5)",    (uint8_t *)"EPB:(3132,5)"},    0}, //Knorr EPB
/*2617*/{0x50,   3136,  0, {(uint8_t *)"EPB:(3136,0)",    (uint8_t *)"EPB:(3136,0)"},    0}, //Knorr EPB
/*2618*/{0x50,0xFFFFF, 0xFF /*   3136, 16 */, {(uint8_t *)"EPB:(3136,16)",   (uint8_t *)"EPB:(3136,16)"},   0}, //Knorr EPB
/*2619*/{0x50,0xFFFFF, 0xFF /*     46,  9 */, {(uint8_t *)"EPB:(46,9)",      (uint8_t *)"EPB:(46,9)"},      0}, //Knorr EPB
/*2620*/{0x50,0xFFFFF, 0xFF /*    513,  9 */, {(uint8_t *)"EPB:(513,9)",     (uint8_t *)"EPB:(513,9)"},     0}, //Knorr EPB
/*2621*/{0x50,0xFFFFF, 0xFF /* 516096,  2 */, {(uint8_t *)"EPB:(516096,2)",  (uint8_t *)"EPB:(516096,2)"},  0}, //Knorr EPB
/*2622*/{0x50,0xFFFFF, 0xFF /* 516096,  8 */, {(uint8_t *)"EPB:(516096,8)",  (uint8_t *)"EPB:(516096,8)"},  0}, //Knorr EPB
/*2623*/{0x50,0xFFFFF, 0xFF /* 516097, 12 */, {(uint8_t *)"EPB:(516097,12)", (uint8_t *)"EPB:(516097,12)"}, 0}, //Knorr EPB
/*2624*/{0x50,0xFFFFF, 0xFF /* 516097,  2 */, {(uint8_t *)"EPB:(516097,2)",  (uint8_t *)"EPB:(516097,2)"},  0}, //Knorr EPB
/*2625*/{0x50,0xFFFFF, 0xFF /* 516097,  8 */, {(uint8_t *)"EPB:(516097,8)",  (uint8_t *)"EPB:(516097,8)"},  0}, //Knorr EPB
/*2626*/{0x50,0xFFFFF, 0xFF /* 516097,  9 */, {(uint8_t *)"EPB:(516097,9)",  (uint8_t *)"EPB:(516097,9)"},  0}, //Knorr EPB
/*2627*/{0x50,0xFFFFF, 0xFF /* 516098, 12 */, {(uint8_t *)"EPB:(516098,12)", (uint8_t *)"EPB:(516098,12)"}, 0}, //Knorr EPB
/*2628*/{0x50,0xFFFFF, 0xFF /* 516098,  2 */, {(uint8_t *)"EPB:(516098,2)",  (uint8_t *)"EPB:(516098,2)"},  0}, //Knorr EPB
/*2629*/{0x50,0xFFFFF, 0xFF /* 516098,  8 */, {(uint8_t *)"EPB:(516098,8)",  (uint8_t *)"EPB:(516098,8)"},  0}, //Knorr EPB
/*2630*/{0x50,0xFFFFF, 0xFF /* 516098,  9 */, {(uint8_t *)"EPB:(516098,9)",  (uint8_t *)"EPB:(516098,9)"},  0}, //Knorr EPB
/*2631*/{0x50,0xFFFFF, 0xFF /* 516099, 12 */, {(uint8_t *)"EPB:(516099,12)", (uint8_t *)"EPB:(516099,12)"}, 0}, //Knorr EPB
/*2632*/{0x50,0xFFFFF, 0xFF /* 516099,  2 */, {(uint8_t *)"EPB:(516099,2)",  (uint8_t *)"EPB:(516099,2)"},  0}, //Knorr EPB
/*2633*/{0x50,0xFFFFF, 0xFF /* 516099,  8 */, {(uint8_t *)"EPB:(516099,8)",  (uint8_t *)"EPB:(516099,8)"},  0}, //Knorr EPB
/*2634*/{0x50,0xFFFFF, 0xFF /* 516099,  9 */, {(uint8_t *)"EPB:(516099,9)",  (uint8_t *)"EPB:(516099,9)"},  0}, //Knorr EPB
/*2635*/{0x50,0xFFFFF, 0xFF /*    523,  9 */, {(uint8_t *)"EPB:(523,9)",     (uint8_t *)"EPB:(523,9)"},     0}, //Knorr EPB
/*2636*/{0x50,0xFFFFF, 0xFF /*   5630, 10 */, {(uint8_t *)"EPB:(5630,10)",   (uint8_t *)"EPB:(5630,10)"},   0}, //Knorr EPB
/*2637*/{0x50,0xFFFFF, 0xFF /*   5630, 12 */, {(uint8_t *)"EPB:(5630,12)",   (uint8_t *)"EPB:(5630,12)"},   0}, //Knorr EPB
/*2638*/{0x50,0xFFFFF, 0xFF /*   5630,  2 */, {(uint8_t *)"EPB:(5630,2)",    (uint8_t *)"EPB:(5630,2)"},    0}, //Knorr EPB
/*2639*/{0x50,0xFFFFF, 0xFF /*   5630, 20 */, {(uint8_t *)"EPB:(5630,20)",   (uint8_t *)"EPB:(5630,20)"},   0}, //Knorr EPB
/*2640*/{0x50,0xFFFFF, 0xFF /*   5630,  8 */, {(uint8_t *)"EPB:(5630,8)",    (uint8_t *)"EPB:(5630,8)"},    0}, //Knorr EPB
/*2641*/{0x50,0xFFFFF, 0xFF /*   5360,  9 */, {(uint8_t *)"EPB:(5360,9)",    (uint8_t *)"EPB:(5360,9)"},    0}, //Knorr EPB
/*2642*/{0x50,    617,  7, {(uint8_t *)"EPB:(617,7)",     (uint8_t *)"EPB:(617,7)"},     0}, //Knorr EPB
/*2643*/{0x50,    618,  7, {(uint8_t *)"EPB:(618,7)",     (uint8_t *)"EPB:(618,7)"},     0}, //Knorr EPB
/*2644*/{0x50,0xFFFFF, 0xFF /*    619, 10 */, {(uint8_t *)"EPB:(619,10)",    (uint8_t *)"EPB:(619,10)"},    0}, //Knorr EPB
/*2645*/{0x50,    619, 14, {(uint8_t *)"EPB:(619,14)",    (uint8_t *)"EPB:(619,14)"},    0}, //Knorr EPB
/*2646*/{0x50,    619,  7, {(uint8_t *)"EPB:(619,7)",     (uint8_t *)"EPB:(619,7)"},     0}, //Knorr EPB
/*2647*/{0x50,0xFFFFF, 0xFF /*    625,  5 */, {(uint8_t *)"EPB:(625,5)",     (uint8_t *)"EPB:(625,5)"},     0}, //Knorr EPB
/*2648*/{0x50,    629, 13, {(uint8_t *)"EPB:(629,13)",    (uint8_t *)"EPB:(629,13)"},    0}, //Knorr EPB
/*2649*/{0x50,0xFFFFF, 0xFF /*    629, 14 */, {(uint8_t *)"EPB:(629,14)",    (uint8_t *)"EPB:(629,14)"},    0}, //Knorr EPB
/*2650*/{0x50,    629,  2, {(uint8_t *)"EPB:(629,2)",     (uint8_t *)"EPB:(629,2)"},     0}, //Knorr EPB
/*2651*/{0x50,    629,  9, {(uint8_t *)"EPB:(629,9)",     (uint8_t *)"EPB:(629,9)"},     0}, //Knorr EPB
/*2652*/{0x50,    630, 13, {(uint8_t *)"EPB:(630,13)",    (uint8_t *)"EPB:(630,13)"},    0}, //Knorr EPB
/*2653*/{0x50,    630,  2, {(uint8_t *)"EPB:(630,2)",     (uint8_t *)"EPB:(630,2)"},     0}, //Knorr EPB
/*2654*/{0x50,0xFFFFF, 0xFF /*   639,  5 */, {(uint8_t *)"EPB:(639,5)",     (uint8_t *)"EPB:(639,5)"},     0}, //Knorr EPB
/*2655*/{0x50,0xFFFFF, 0xFF /*   708,  9 */, {(uint8_t *)"EPB:(708,9)",     (uint8_t *)"EPB:(708,9)"},     0}, //Knorr EPB
/*2656*/{0x50,0xFFFFF, 0xFF /*   887, 12 */, {(uint8_t *)"EPB:(887,12)",    (uint8_t *)"EPB:(887,12)"},    0}, //Knorr EPB
/*2657*/{0x50,0xFFFFF, 0xFF /*   887,  9 */, {(uint8_t *)"EPB:(887,9)",     (uint8_t *)"EPB:(887,9)"},     0}, //Knorr EPB

/*2658*/{0x13, 520192, 12, {(uint8_t *)"EHPS:(520192,12)",          (uint8_t *)"EHPS:(520192,12)"}, 0}, //久隆电液转向机EHPS
/*2659*/{0x13, 520234, 31, {(uint8_t *)"EHPS:(520234,31)",          (uint8_t *)"EHPS:(520234,31)"}, 0}, //久隆电液转向机EHPS
/*2660*/{0x13, 520196, 31, {(uint8_t *)"EHPS:(520196,31)",          (uint8_t *)"EHPS:(520196,31)"}, 0}, //久隆电液转向机EHPS
/*2661*/{0x13, 520202, 31, {(uint8_t *)"EHPS:(520202,31)",          (uint8_t *)"EHPS:(520202,31)"}, 0}, //久隆电液转向机EHPS
/*2662*/{0x13, 520236,  2, {(uint8_t *)"EHPS:(520236,2)",           (uint8_t *)"EHPS:(520236,2)"},  0}, //久隆电液转向机EHPS
/*2663*/{0x13, 520238, 31, {(uint8_t *)"EHPS:(520238,31)",          (uint8_t *)"EHPS:(520238,31)"}, 0}, //久隆电液转向机EHPS
/*2664*/{0x13, 520208, 13, {(uint8_t *)"EHPS:方向盘中间位置未标定", (uint8_t *)"EHPS: The steering wheel is not calibrated"}, 0}, //久隆电液转向机EHPS
/*2665*/{0x13, 520210, 31, {(uint8_t *)"EHPS:(520210,31)",          (uint8_t *)"EHPS:(520210,31)"}, 0}, //久隆电液转向机EHPS
/*2666*/{0x13,    168,  0, {(uint8_t *)"EHPS:(168,0)",              (uint8_t *)"EHPS:(168,0)"},     0}, //久隆电液转向机EHPS
/*2667*/{0x13,    168,  1, {(uint8_t *)"EHPS:(168,1)",              (uint8_t *)"EHPS:(168,1)"},     0}, //久隆电液转向机EHPS
/*2668*/{0x13, 520240,  2, {(uint8_t *)"EHPS:(520240,2)",           (uint8_t *)"EHPS:(520240,2)"},  0}, //久隆电液转向机EHPS
/*2669*/{0x13, 520241, 12, {(uint8_t *)"EHPS:(520241,12)",          (uint8_t *)"EHPS:(520241,12)"}, 0}, //久隆电液转向机EHPS
/*2670*/{0x13,   5585,  9, {(uint8_t *)"EHPS:(5585,9)",             (uint8_t *)"EHPS:(5585,9)"},    0}, //久隆电液转向机EHPS
/*2671*/{0x13,   5585, 19, {(uint8_t *)"EHPS:(5585,19)",            (uint8_t *)"EHPS:(5585,19)"},   0}, //久隆电液转向机EHPS
/*2672*/{0x13, 454656, 30, {(uint8_t *)"EHPS:(454656,30)",          (uint8_t *)"EHPS:(454656,30)"}, 0}, //久隆电液转向机EHPS
/*2673*//*2447*/{0xFF,      0,  0, {(uint8_t *)"车辆限速即将激活,熄火前请联系厂家",(uint8_t *)"Speed limit will activate,Contact manufacturers "}, 0},
/*2674*//*2449*/{0xFF,      0,  0, {(uint8_t *)"车辆限速已激活,请联系厂家",       (uint8_t *)"Speed limit activated,Contact manufacturers"}, 0},
/*2675*//*2450*/{0xFF,      0,  0, {(uint8_t *)"限速预警,请联系厂家",            (uint8_t *)"Warning of speed limit,Contact manufacturers"}, 0},
/*2676*/{0x82, 521413,  0, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521413,0)"}, 0}, //TMS
/*2677*/{0x82, 521418,  0, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521418,0)"}, 0}, //TMS
/*2678*/{0x82, 521414,  0, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,0)"}, 0}, //TMS
/*2679*/{0x82, 521414, 12, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,12)"}, 0}, //TMS
/*2680*/{0x82, 521414, 19, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,19)"}, 0}, //TMS
/*2681*/{0x82, 521414,  6, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,6)"}, 0}, //TMS
/*2682*/{0x82, 521414,  3, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,3)"}, 0}, //TMS
/*2683*/{0x82, 521414,  4, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,4)"}, 0}, //TMS
/*2684*/{0x82, 521414, 16, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,16)"}, 0}, //TMS
/*2685*/{0x82, 521414, 18, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,18)"}, 0}, //TMS
/*2686*/{0x82, 521414, 23, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,23)"}, 0}, //TMS
/*2687*/{0x82, 521414, 24, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521414,24)"}, 0}, //TMS
/*2688*/{0x82, 521415,  0, {(uint8_t *)"进站维修，从机组故障",          (uint8_t *)"TMS:(521415,0)"}, 0}, //TMS
/*2689*/{0x82, 521415,  1, {(uint8_t *)"进站维修，从机组故障",          (uint8_t *)"TMS:(521415,1)"}, 0}, //TMS
/*2690*/{0x82, 521415, 23, {(uint8_t *)"进站维修，从机组故障",          (uint8_t *)"TMS:(521415,23)"}, 0}, //TMS
/*2691*/{0x82, 521416,  0, {(uint8_t *)"进站维修，从机组故障",          (uint8_t *)"TMS:(521416,0)"}, 0}, //TMS
/*2692*/{0x82, 521416,  1, {(uint8_t *)"进站维修，从机组故障",          (uint8_t *)"TMS:(521416,1)"}, 0}, //TMS
/*2693*/{0x82, 521416, 23, {(uint8_t *)"进站维修，从机组故障",          (uint8_t *)"TMS:(521416,23)"}, 0}, //TMS
/*2694*/{0x82, 521417,  1, {(uint8_t *)"进站维修，供电异常",          (uint8_t *)"TMS:(521417,1)"}, 0}, //TMS
/*2695*/
/*2696*/
/*2697*/
/*2698*/
/*2699*/

};

void DM1_Flt_Init(void)
{
	DM1_Ftl_Sum = DM1_LIST_FLT_NUM;
	
	for(uint32_t i = 0;i < DM1_LIST_FLT_NUM; i++)
	{
		DMPackage[i].set = 0;
	}
	
	memset(&icuCrtDM1Flt, 0, sizeof(icuCrtDM1Flt));
	memset(&CurrentFltInfo, 0, sizeof(CurrentFltInfo));
	
}

void ICU_DM1_Handler(void) //仪表发送的DM1故障检测
{
	uint32_t ap_sensor_scale = 0;
	
	GeneralUse_t *GU_10FE6FE8_t =NULL;
	GeneralUse_t *GU_10F007E8_t =NULL;
	GeneralUse_t *GU_18FF16E8_t =NULL;
	GeneralUse_t *GU_18FE5BE8_t =NULL;
	
	GU_10FE6FE8_t = (GeneralUse_t*)can_getBCanBuffer(0x10FE6FE8);
	GU_18FE5BE8_t = (GeneralUse_t*)can_getBCanBuffer(0x18FE5BE8);
	GU_10F007E8_t = (GeneralUse_t*)can_getBCanBuffer(0x10F007E8);
	GU_18FF16E8_t = (GeneralUse_t*)can_getBCanBuffer(0x18FF16E8);
	
	DMPackage[1320].set = 0; //仪表:车速传感器电压高
	DMPackage[1321].set = 0; //仪表:车速传感器电压低
	
	ap_sensor_scale = get_input_analog_quantity(AD_V_B3) * 100 / get_input_analog_quantity(B24_5V_DET);
    DMPackage[1322].set = (ap_sensor_scale >= 96); //仪表:前桥回路气压传感器电压高
    DMPackage[1323].set = (ap_sensor_scale <= 4);  //仪表:前桥回路气压传感器电压低
	ap_sensor_scale = get_input_analog_quantity(AD_V_B20) * 100 / get_input_analog_quantity(B24_5V_DET);
    DMPackage[1324].set = (ap_sensor_scale >= 96); //仪表:后桥回路气压传感器电压高
	DMPackage[1325].set = (ap_sensor_scale <= 4);  //仪表:后桥回路气压传感器电压低
	DMPackage[1326].set = 0; //仪表:内部故障
	DMPackage[1327].set = 0; //仪表:内部故障
	
    if(CANCounters.PCAN < 3)
		CANCounters.PCAN++;
    else
		CANCounters.PCAN = 3;
	
    if(CANCounters.BCAN < 3)
		CANCounters.BCAN++;
    else
		CANCounters.BCAN = 3;

    DMPackage[1328].set = (CANCounters.BCAN == 3);//仪表:CAN 1总线故障
    DMPackage[1329].set = (CANCounters.PCAN == 3);//仪表:CAN 2总线故障
	DMPackage[1330].set = BCM_NODE_TMO_FLG; //(can_getBCanRxState(0x18FF2732) == 2);//仪表:BCM报文超时
    DMPackage[1331].set = 0;//仪表:水温过高指示灯故障
    DMPackage[1332].set = 0;//仪表:门开报警灯故障
	DMPackage[1333].set = ((eol_mcpbaojing == 1 || eol_mcpbaojing == 3 || eol_mcpbaojing == 5 || eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN17);	//L1蹄片磨损报警
	DMPackage[1334].set = ((eol_mcpbaojing == 1 || eol_mcpbaojing == 3 || eol_mcpbaojing == 5 || eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN15);	//R1蹄片磨损报警
	DMPackage[1335].set = ((eol_mcpbaojing == 3 || eol_mcpbaojing == 5 || eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN21); //L2蹄片磨损报警
	DMPackage[1336].set = ((eol_mcpbaojing == 3 || eol_mcpbaojing == 5 || eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN19); //R2蹄片磨损报警
	DMPackage[1337].set = ((eol_mcpbaojing == 5 || eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN18); //L3蹄片磨损报警
	DMPackage[1338].set = ((eol_mcpbaojing == 5 || eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN23); //R3蹄片磨损报警
	DMPackage[1339].set = ((eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN22); //L4蹄片磨损报警
	DMPackage[1340].set = ((eol_mcpbaojing == 7 || eol_mcpbaojing == 9) && IN16); //R4蹄片磨损报警
	DMPackage[2347].set = ((eol_mcpbaojing == 9) && IN27); //L5蹄片磨损报警 第五桥左轮摩擦片磨损(523031,12)
	DMPackage[2348].set = ((eol_mcpbaojing == 9) && IN13); //R5蹄片磨损报警 第五桥右轮摩擦片磨损(523032,12)
	
	DMPackage[1341].set = 0; //AMT:离合器磨损(523031,0)
	DMPackage[1342].set = 0; //AMT:空气压力过低(523032,0)
	DMPackage[1343].set = (((eol_tpmsyesno > 0) && (eol_tpmsyesno < 6))&&(TPMS_NODE_TMO_FLG == 1)); //(can_getBCanRxState(0x18FFE633) == 2)); //仪表:TPMS CAN报文超时

    if((eol_ebs ==1)||(eol_ebs ==2)||(eol_ebs ==3)||(eol_ebs ==4)||(eol_ebs ==7)||(eol_ebs ==8)||(eol_ebs ==9)||(eol_ebs ==11)|| (eol_ebs == 12))
	{
		DMPackage[1344].set = ABS_NODE_TMO_FLG; //(can_getPCanRxState(0x18F0010B) == 2);//仪表:ABS系统失效
		DMPackage[1345].set = 0;
	}
		
    else if((eol_ebs ==5)||(eol_ebs == 6)||(eol_ebs ==10)|| (eol_ebs == 13))
	{
		DMPackage[1344].set = 0;
		DMPackage[1345].set = EBS_NODE_TMO_FLG; //(can_getPCanRxState(0x18F0010B) == 2);//仪表:EBS系统失效
	}
    else
	{
		DMPackage[1344].set = 0;
		DMPackage[1345].set = 0;
	}
	
	static ptmrType_t flt_evn_gnd_Tmr = 0;
	static ptmrType_t flt_evn_vcc_Tmr = 0;
	static ptmrType_t flt_evn_gnd_flg = 0;
	static ptmrType_t flt_evn_vcc_flg = 0;
	
    if(get_input_analog_quantity(AD_R_B18) < 250)//<250ohm 短路到地
	{
		if(!ptmr_IsStart(&flt_evn_gnd_Tmr))
			ptmr_Start(&flt_evn_gnd_Tmr);
		
		if(ptmr_Get(&flt_evn_gnd_Tmr) >= 3000)
			flt_evn_gnd_flg = 1;
		else
			flt_evn_gnd_flg = 0;
		
	}
    else
	{
		ptmr_Stop(&flt_evn_gnd_Tmr);
		flt_evn_gnd_flg = 0;
	}
	
    if(get_input_analog_quantity(AD_R_B18) > 60000) //>60000ohm
	{
		if(!ptmr_IsStart(&flt_evn_vcc_Tmr))
			ptmr_Start(&flt_evn_vcc_Tmr);
		
		if(ptmr_Get(&flt_evn_vcc_Tmr) >= 3000)
			flt_evn_vcc_flg = 1;
		else
			flt_evn_vcc_flg = 0;
		
	}
    else
	{
		ptmr_Stop(&flt_evn_vcc_Tmr);
		flt_evn_vcc_flg = 0;
	}
	
	DMPackage[1346].set = 0; //flt_evn_vcc_flg||flt_evn_gnd_flg;//仪表:环境温度传感器信号异常
    DMPackage[1347].set = flt_evn_vcc_flg;//仪表:环境温度传感器或线路故障
    DMPackage[1348].set = flt_evn_gnd_flg;//仪表:环境温度传感器电压低
    DMPackage[1349].set = 0;//变速箱油温传感器电压高
    DMPackage[1350].set = 0;//变速箱油温传感器电压低
    DMPackage[1351].set = 0;//不充电指示灯故障
    DMPackage[1352].set = 0;//驻车制动指示灯故障
    DMPackage[1353].set = 0;//安全带指示灯故障
    DMPackage[1354].set = 0;//仪表:空气压力过低
    DMPackage[1355].set = ((33U != eol_atmtype) && (34U != eol_atmtype) && (AMT_NODE_TMO_FLG == 1)); //(can_getPCanRxState(0x0CEF3103) == 2)&&(can_getPCanRxState(0x18F00503) == 2)); //AMT CAN报文超时
	DMPackage[1356].set = 0;//SCU CAN报文超时
    DMPackage[1357].set = (((0x05 == eol_ecastype) || (0x04 == eol_ecastype) || (0x03 == eol_ecastype)) && (ECAS_NODE_TMO_FLG == 1)); //(0x02 == can_getBCanRxState(0x0CFE5A2F)));//ECAS CAN报文超时
	
    if(eol_ldwstype == 3)	//东软、佑驾、南 斗
	{
		DMPackage[1358].set = (LDWS_NODE_TMO_FLG == 1); //(can_getBCanRxState(0x18FE5BE8) == 2);//仪表:LDWS CAN报文超时
		DMPackage[1361].set = ((GU_10FE6FE8_t->byte8.byte&0x0f)!=0&&(GU_10FE6FE8_t->byte7.bit78 == 3));//FCWS:前方碰撞系统故障
		DMPackage[1362].set = ((GU_10FE6FE8_t->byte8.byte&0x0f)==2);//FCWS:前方碰撞系统前视相机未标定
		DMPackage[1363].set = ((GU_10FE6FE8_t->byte8.byte&0x0f)==3);//FCWS:前方碰撞系统前视相机故障	
		
		if(GU_18FE5BE8_t->byte1.bit78 != 0)//not closed
		{
			DMPackage[1527].set = ((GU_10F007E8_t->byte2.byte&0x0f) == 1);//LDWS:车道偏离系统故障
			DMPackage[1528].set = ((GU_10F007E8_t->byte2.byte&0x0f) == 2);//LDWS:车道偏离系统前视相机未标定
			DMPackage[1529].set = ((GU_10F007E8_t->byte2.byte&0x0f) == 3);//LDWS:车道偏离系统前视相机故障
			DMPackage[1360].set = ((GU_10F007E8_t->byte2.byte&0x0f) == 4);//LDWS:车道偏离系统标定未完成
		}
		else
		{
			DMPackage[1527].set = 0;
			DMPackage[1528].set = 0;
			DMPackage[1529].set = 0;
			DMPackage[1360].set = 0;
		}
    }
    else 
	{
		// if(eol_ldwstype == 2)	//Knorr       if(eol_ldwstype == 4)	//月照松
		DMPackage[1358].set = (((eol_ldwstype == 2) || (eol_ldwstype == 4)) && (LDWS_NODE_TMO_FLG == 1)); //(can_getPCanRxState(0x18FE5BE8) == 2));//仪表:LDWS CAN报文超时
		
		DMPackage[1361].set = 0;//FCWS:前方碰撞系统故障
		DMPackage[1362].set = 0;//FCWS:前方碰撞系统前视相机未标定
		DMPackage[1363].set = 0;//FCWS:前方碰撞系统前视相机故障
		
		DMPackage[1527].set = 0;//LDWS:车道偏离系统故障
		DMPackage[1528].set = 0;//LDWS:车道偏离系统前视相机未标定
		DMPackage[1529].set = 0;//LDWS:车道偏离系统前视相机故障
		DMPackage[1360].set = 0;//LDWS:车道偏离系统标定未完成
    }
	
	// if(eol_aebstype == 2) //Knorr       if(eol_aebstype == 3) //月照松
	DMPackage[1359].set = (((eol_aebstype==2) || (eol_aebstype==3)) && (AEBS_NODE_TMO_FLG == 1)); //(can_getPCanRxState(0x0CF02F2A) == 2)); //AEBS CAN报文超时
	DMPackage[1530].set = (0);//右盲区探测系统故障
	DMPackage[1531].set = ((GU_18FF16E8_t->byte2.byte&0x0f) == 2);//右盲区探测系统未标定
	DMPackage[1532].set = ((GU_18FF16E8_t->byte2.byte&0x0f) == 3);//右盲区探测系统相机故障
	
	
}

void DM1_Flt_Scan_Check(void) //故障扫描检测
{
	uint16_t ListCrtFltNum = 0; //当前列表中故障发生数量
	uint16_t BMSListCrtFltNum = 0; //BMS当前列表中故障发生数量
	
	icuCrtFltNum = 0;
	if(M_ON_flag) //仪表发送故障只在钥匙ON档检测
		ICU_DM1_Handler();
	for(uint32_t cnt = 0; cnt < DM1_LIST_FLT_NUM; cnt++)
	{
		if(DMPackage[cnt].SourceAdress != 0x17) //略过仪表发送的DM1故障检测
		{
			DMPackage[cnt].set = 0;
		}
		else
		{
			if(M_ON_flag)
			{
				if(DMPackage[cnt].set == 1)
				{
					icuCrtDM1Flt[icuCrtFltNum].SPN = DMPackage[cnt].spn;
					icuCrtDM1Flt[icuCrtFltNum].FMI = DMPackage[cnt].fmi;
					icuCrtDM1Flt[icuCrtFltNum].OC  = 0x7F; //OC未定,设为全1
					icuCrtDM1Flt[icuCrtFltNum].CM  = 0;    //CM = 0
					icuCrtFltNum++; //仪表发生故障数量
					if(icuCrtFltNum > ICU_MAX_ERR_NUM)
						icuCrtFltNum = ICU_MAX_ERR_NUM;
					
					ListCrtFltPos[ListCrtFltNum] = cnt;
					ListCrtFltNum++;
					
				}
			}
		}
		
	}
	for(uint8_t owner = 0; owner < DM1_OWNER_NUM; owner++)
	{
		for(uint32_t num = 0; num < CurrentFltInfo[owner].FltNum; num++)
		{
			for(uint32_t cnt = 0; cnt < DM1_LIST_FLT_NUM; cnt++)
			{
				if((DMPackage[cnt].SourceAdress == CurrentFltInfo[owner].SA)
				&& (DMPackage[cnt].spn == CurrentFltInfo[owner].FltBuf.DTC[num].SPN) \
				&& (DMPackage[cnt].fmi == CurrentFltInfo[owner].FltBuf.DTC[num].FMI))
				{
					if(0x0B == CurrentFltInfo[owner].SA)
					{
						if(8 == eol_ebs) //ABS-河南焦作
						{
							if((cnt >= 174) && (cnt <= 197))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else if(11U == eol_ebs) //ABS-KNORR
						{
							if((cnt >= 198) && (cnt <= 422))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else if(6 == eol_ebs) //EBS-KNORR
						{
							if((cnt >= 423) && (cnt <= 1207))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else
						{
							//暂不支持其他标定的故障码
							break;
						}
					}
					else if(0xE8 == CurrentFltInfo[owner].SA || 0xA0 == CurrentFltInfo[owner].SA || 0x2A == CurrentFltInfo[owner].SA)
					{
						if(0x03 == eol_aebstype) //月照松AEBS
						{
							if((cnt>= 1677)&&(cnt <= 1752))//月照松AEBS
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
							else
							{
								//暂不支持其他标定的故障码
								break;
							}
						}
						else if(0x02 == eol_aebstype) //KnorrAEBS
						{
							if((cnt>= 1753)&&(cnt <= 1885))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
							else
							{
								//暂不支持其他标定的故障码
								break;
							}
						}
						else
						{
							//暂不支持其他标定的故障码
							break;
						}
					}
					else if(0x33 == CurrentFltInfo[owner].SA)
					{
						if((eol_tpmsyesno > 0) && (eol_tpmsyesno < 6))
						{
							DMPackage[cnt].set = 1;
							ListCrtFltPos[ListCrtFltNum] = cnt;
							ListCrtFltNum++;
							break;
						}
						else
						{
							//暂不支持其他标定的故障码
							break;
						}
					}
					else if(0xF6 == CurrentFltInfo[owner].SA)
					{
						if(0x2d == eol_fadongjiorkaji)
						{
							DMPackage[cnt].set = 1;
							ListCrtFltPos[ListCrtFltNum] = cnt;
							ListCrtFltNum++;
							break;
						}
						else
						{
							//暂不支持其他标定的故障码
							break;
						}
					}
					else if(0x2F == CurrentFltInfo[owner].SA)
					{
						if(0x05 == eol_ecastype)//瑞立ECAS
						{
							if((cnt >= 1968) && (cnt <= 2028))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else if(0x03 == eol_ecastype)//Wabco ECAS
						{
							if((cnt >= 2029) && (cnt <= 2122))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else if(0x04 == eol_ecastype)//Knorr ECAS
						{
							if((cnt >= 2123) && (cnt <= 2186))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else
						{
							//暂不支持其他标定的故障码
							break;
						}
					}
					else if(0x50 == CurrentFltInfo[owner].SA)
					{
						if(1 == eol_epbtype)//科密瑞立EPB
						{
							if((cnt >= 2566) && (cnt <= 2602))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else if(2 == eol_epbtype) //Knorr EPB
						{
							if((cnt >= 2603) && (cnt <= 2657))
							{
								DMPackage[cnt].set = 1;
								ListCrtFltPos[ListCrtFltNum] = cnt;
								ListCrtFltNum++;
								break;
							}
						}
						else
						{
							//暂不支持其他标定的故障码
							break;
						}
					}
					else
					{
						DMPackage[cnt].set = 1;
						ListCrtFltPos[ListCrtFltNum] = cnt;
						ListCrtFltNum++;
						
						if(0xF4 == CurrentFltInfo[owner].SA)
						{
							bmsListCrtFltPos[BMSListCrtFltNum] = cnt;
							BMSListCrtFltNum++;
						}
						
						break;
					}
				}
				
			}
		
		}
		
	}
	
	/* for(uint32_t cnt = 0; cnt < DM1_LIST_FLT_NUM; cnt++)
	{
		if(DMPackage[cnt].set == 1)
		{
			ListCrtFltNum ++;
			
			if(DMPackage[cnt].SourceAdress == 0x17)
				icuCrtFltNum++;
			
		}
	} */
	
	if(BMSListCrtFltNum > 99)
		BMSListCrtFltNum = 99;
	bmsCrtFltNum = BMSListCrtFltNum;
	
	if(ListCrtFltNum > 99)
		ListCrtFltNum = 99;
	TotalDM = ListCrtFltNum;
	
}

bool get_dm1_flt_status(uint8_t owner, uint32_t spn, uint8_t fmi)
{
	bool ret = false;
	
	if(owner < DM1_OWNER_NUM)
	{
		for(uint8_t i = 0; i < CurrentFltInfo[owner].FltNum;i++)
		{
			if((spn == CurrentFltInfo[owner].FltBuf.DTC[i].SPN) \
			&& (fmi == CurrentFltInfo[owner].FltBuf.DTC[i].FMI))
			{
				ret = true;
				break;
			}
		}
	}
	return ret;
}




